#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RadialUi_SubWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_RadialUi_SubWidget.W_RadialUi_SubWidget_C.ExecuteUbergraph_W_RadialUi_SubWidget
// 0x0098 (0x0098 - 0x0000)
struct W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0018(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_RadialUi_GroupIndicatorWidget_C*     K2Node_DynamicCast_AsW_Radial_Ui_Group_Indicator_Widget; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget) == 0x000008, "Wrong alignment on W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget");
static_assert(sizeof(W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget) == 0x000098, "Wrong size on W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget");
static_assert(offsetof(W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget, EntryPoint) == 0x000000, "Member 'W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget, CallFunc_IsActive_ReturnValue) == 0x000004, "Member 'W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget, Temp_int_Array_Index_Variable) == 0x000008, "Member 'W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget, K2Node_Event_IsDesignTime) == 0x000014, "Member 'W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget, K2Node_Event_MyGeometry) == 0x000018, "Member 'W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget, K2Node_Event_InDeltaTime) == 0x000050, "Member 'W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget, CallFunc_GetAllChildren_ReturnValue) == 0x000058, "Member 'W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000068, "Member 'W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget, CallFunc_Array_Get_Item) == 0x000070, "Member 'W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget, K2Node_DynamicCast_AsW_Radial_Ui_Group_Indicator_Widget) == 0x000078, "Member 'W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget::K2Node_DynamicCast_AsW_Radial_Ui_Group_Indicator_Widget' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget, CallFunc_Array_Length_ReturnValue) == 0x000084, "Member 'W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget, CallFunc_Array_IsEmpty_ReturnValue) == 0x000089, "Member 'W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget, CallFunc_Array_Length_ReturnValue_1) == 0x00008C, "Member 'W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000090, "Member 'W_RadialUi_SubWidget_C_ExecuteUbergraph_W_RadialUi_SubWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function W_RadialUi_SubWidget.W_RadialUi_SubWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_RadialUi_SubWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RadialUi_SubWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_RadialUi_SubWidget_C_PreConstruct");
static_assert(sizeof(W_RadialUi_SubWidget_C_PreConstruct) == 0x000001, "Wrong size on W_RadialUi_SubWidget_C_PreConstruct");
static_assert(offsetof(W_RadialUi_SubWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_RadialUi_SubWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_RadialUi_SubWidget.W_RadialUi_SubWidget_C.SetGroupIndicators
// 0x00A0 (0x00A0 - 0x0000)
struct W_RadialUi_SubWidget_C_SetGroupIndicators final
{
public:
	int32                                         TotalGroupOptions;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalOptions_0;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_RadialUi_GroupIndicatorWidget_C*     CallFunc_Create_ReturnValue;                       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderTransformAngle_Angle_ImplicitCast; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RadialUi_SubWidget_C_SetGroupIndicators) == 0x000008, "Wrong alignment on W_RadialUi_SubWidget_C_SetGroupIndicators");
static_assert(sizeof(W_RadialUi_SubWidget_C_SetGroupIndicators) == 0x0000A0, "Wrong size on W_RadialUi_SubWidget_C_SetGroupIndicators");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, TotalGroupOptions) == 0x000000, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::TotalGroupOptions' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, TotalOptions_0) == 0x000004, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::TotalOptions_0' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, Temp_int_Variable) == 0x000008, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, CallFunc_Divide_IntInt_ReturnValue) == 0x00000C, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, K2Node_MakeArray_Array) == 0x000010, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, CallFunc_Divide_IntInt_ReturnValue_1) == 0x000020, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, CallFunc_Multiply_IntInt_ReturnValue) == 0x000028, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000030, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000038, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000040, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, CallFunc_Array_Get_Item) == 0x000050, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000058, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000068, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000070, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, CallFunc_Add_IntInt_ReturnValue_1) == 0x00007C, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, CallFunc_GetOwningPlayer_ReturnValue) == 0x000080, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, CallFunc_Create_ReturnValue) == 0x000088, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, CallFunc_AddChildToOverlay_ReturnValue) == 0x000090, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::CallFunc_AddChildToOverlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetGroupIndicators, CallFunc_SetRenderTransformAngle_Angle_ImplicitCast) == 0x000098, "Member 'W_RadialUi_SubWidget_C_SetGroupIndicators::CallFunc_SetRenderTransformAngle_Angle_ImplicitCast' has a wrong offset!");

// Function W_RadialUi_SubWidget.W_RadialUi_SubWidget_C.SetOptionSizeAndTextures
// 0x000C (0x000C - 0x0000)
struct W_RadialUi_SubWidget_C_SetOptionSizeAndTextures final
{
public:
	int32                                         TotalOptions_0;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RadialUi_SubWidget_C_SetOptionSizeAndTextures) == 0x000004, "Wrong alignment on W_RadialUi_SubWidget_C_SetOptionSizeAndTextures");
static_assert(sizeof(W_RadialUi_SubWidget_C_SetOptionSizeAndTextures) == 0x00000C, "Wrong size on W_RadialUi_SubWidget_C_SetOptionSizeAndTextures");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetOptionSizeAndTextures, TotalOptions_0) == 0x000000, "Member 'W_RadialUi_SubWidget_C_SetOptionSizeAndTextures::TotalOptions_0' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetOptionSizeAndTextures, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'W_RadialUi_SubWidget_C_SetOptionSizeAndTextures::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_SetOptionSizeAndTextures, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'W_RadialUi_SubWidget_C_SetOptionSizeAndTextures::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function W_RadialUi_SubWidget.W_RadialUi_SubWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_RadialUi_SubWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RadialUi_SubWidget_C_Tick) == 0x000004, "Wrong alignment on W_RadialUi_SubWidget_C_Tick");
static_assert(sizeof(W_RadialUi_SubWidget_C_Tick) == 0x00003C, "Wrong size on W_RadialUi_SubWidget_C_Tick");
static_assert(offsetof(W_RadialUi_SubWidget_C_Tick, MyGeometry) == 0x000000, "Member 'W_RadialUi_SubWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_RadialUi_SubWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'W_RadialUi_SubWidget_C_Tick::InDeltaTime' has a wrong offset!");

}

