#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidReport_SquadContractRewards

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_RaidReport_SquadContractRewards.W_RaidReport_SquadContractRewards_C.ExecuteUbergraph_W_RaidReport_SquadContractRewards
// 0x0008 (0x0008 - 0x0000)
struct W_RaidReport_SquadContractRewards_C_ExecuteUbergraph_W_RaidReport_SquadContractRewards final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidReport_SquadContractRewards_C_ExecuteUbergraph_W_RaidReport_SquadContractRewards) == 0x000004, "Wrong alignment on W_RaidReport_SquadContractRewards_C_ExecuteUbergraph_W_RaidReport_SquadContractRewards");
static_assert(sizeof(W_RaidReport_SquadContractRewards_C_ExecuteUbergraph_W_RaidReport_SquadContractRewards) == 0x000008, "Wrong size on W_RaidReport_SquadContractRewards_C_ExecuteUbergraph_W_RaidReport_SquadContractRewards");
static_assert(offsetof(W_RaidReport_SquadContractRewards_C_ExecuteUbergraph_W_RaidReport_SquadContractRewards, EntryPoint) == 0x000000, "Member 'W_RaidReport_SquadContractRewards_C_ExecuteUbergraph_W_RaidReport_SquadContractRewards::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_RaidReport_SquadContractRewards_C_ExecuteUbergraph_W_RaidReport_SquadContractRewards, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_RaidReport_SquadContractRewards_C_ExecuteUbergraph_W_RaidReport_SquadContractRewards::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_RaidReport_SquadContractRewards.W_RaidReport_SquadContractRewards_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_RaidReport_SquadContractRewards_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidReport_SquadContractRewards_C_PreConstruct) == 0x000001, "Wrong alignment on W_RaidReport_SquadContractRewards_C_PreConstruct");
static_assert(sizeof(W_RaidReport_SquadContractRewards_C_PreConstruct) == 0x000001, "Wrong size on W_RaidReport_SquadContractRewards_C_PreConstruct");
static_assert(offsetof(W_RaidReport_SquadContractRewards_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_RaidReport_SquadContractRewards_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_RaidReport_SquadContractRewards.W_RaidReport_SquadContractRewards_C.SetReward
// 0x00A0 (0x00A0 - 0x0000)
struct W_RaidReport_SquadContractRewards_C_SetReward final
{
public:
	bool                                          InIsEXPReward;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RewardValue_0;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0010(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0018)()
};
static_assert(alignof(W_RaidReport_SquadContractRewards_C_SetReward) == 0x000008, "Wrong alignment on W_RaidReport_SquadContractRewards_C_SetReward");
static_assert(sizeof(W_RaidReport_SquadContractRewards_C_SetReward) == 0x0000A0, "Wrong size on W_RaidReport_SquadContractRewards_C_SetReward");
static_assert(offsetof(W_RaidReport_SquadContractRewards_C_SetReward, InIsEXPReward) == 0x000000, "Member 'W_RaidReport_SquadContractRewards_C_SetReward::InIsEXPReward' has a wrong offset!");
static_assert(offsetof(W_RaidReport_SquadContractRewards_C_SetReward, RewardValue_0) == 0x000008, "Member 'W_RaidReport_SquadContractRewards_C_SetReward::RewardValue_0' has a wrong offset!");
static_assert(offsetof(W_RaidReport_SquadContractRewards_C_SetReward, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000010, "Member 'W_RaidReport_SquadContractRewards_C_SetReward::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_SquadContractRewards_C_SetReward, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'W_RaidReport_SquadContractRewards_C_SetReward::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_RaidReport_SquadContractRewards_C_SetReward, K2Node_MakeArray_Array) == 0x000078, "Member 'W_RaidReport_SquadContractRewards_C_SetReward::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_RaidReport_SquadContractRewards_C_SetReward, CallFunc_Format_ReturnValue) == 0x000088, "Member 'W_RaidReport_SquadContractRewards_C_SetReward::CallFunc_Format_ReturnValue' has a wrong offset!");

}

