#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidResult_DmgLogGroupWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_RaidResult_DmgLogGroupWidget.W_RaidResult_DmgLogGroupWidget_C
// 0x0028 (0x02C0 - 0x0298)
class UW_RaidResult_DmgLogGroupWidget_C final : public UP2RaidResultDamageLogGroupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_RaidResult_DmgLogWidget_C*           W_RaidResult_DmgLog_AreaOfEffect;                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   AttackerName;                                      // 0x02A8(0x0018)(Edit, BlueprintVisible)

public:
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_RaidResult_DmgLogGroupWidget(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_RaidResult_DmgLogGroupWidget_C">();
	}
	static class UW_RaidResult_DmgLogGroupWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_RaidResult_DmgLogGroupWidget_C>();
	}
};
static_assert(alignof(UW_RaidResult_DmgLogGroupWidget_C) == 0x000008, "Wrong alignment on UW_RaidResult_DmgLogGroupWidget_C");
static_assert(sizeof(UW_RaidResult_DmgLogGroupWidget_C) == 0x0002C0, "Wrong size on UW_RaidResult_DmgLogGroupWidget_C");
static_assert(offsetof(UW_RaidResult_DmgLogGroupWidget_C, UberGraphFrame) == 0x000298, "Member 'UW_RaidResult_DmgLogGroupWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_DmgLogGroupWidget_C, W_RaidResult_DmgLog_AreaOfEffect) == 0x0002A0, "Member 'UW_RaidResult_DmgLogGroupWidget_C::W_RaidResult_DmgLog_AreaOfEffect' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_DmgLogGroupWidget_C, AttackerName) == 0x0002A8, "Member 'UW_RaidResult_DmgLogGroupWidget_C::AttackerName' has a wrong offset!");

}

