#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidResult_FatalityDetailsWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_RaidResult_FatalityDetailsWidget.W_RaidResult_FatalityDetailsWidget_C.RefreshNonBallisticCauseIconOnBP
// 0x0004 (0x0004 - 0x0000)
struct W_RaidResult_FatalityDetailsWidget_C_RefreshNonBallisticCauseIconOnBP final
{
public:
	int32                                         InDeathReasonIdx;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidResult_FatalityDetailsWidget_C_RefreshNonBallisticCauseIconOnBP) == 0x000004, "Wrong alignment on W_RaidResult_FatalityDetailsWidget_C_RefreshNonBallisticCauseIconOnBP");
static_assert(sizeof(W_RaidResult_FatalityDetailsWidget_C_RefreshNonBallisticCauseIconOnBP) == 0x000004, "Wrong size on W_RaidResult_FatalityDetailsWidget_C_RefreshNonBallisticCauseIconOnBP");
static_assert(offsetof(W_RaidResult_FatalityDetailsWidget_C_RefreshNonBallisticCauseIconOnBP, InDeathReasonIdx) == 0x000000, "Member 'W_RaidResult_FatalityDetailsWidget_C_RefreshNonBallisticCauseIconOnBP::InDeathReasonIdx' has a wrong offset!");

// Function W_RaidResult_FatalityDetailsWidget.W_RaidResult_FatalityDetailsWidget_C.ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget
// 0x00A0 (0x00A0 - 0x0000)
struct W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InDeathReasonIdx;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0050)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0018)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget) == 0x000008, "Wrong alignment on W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget");
static_assert(sizeof(W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget) == 0x0000A0, "Wrong size on W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget");
static_assert(offsetof(W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget, EntryPoint) == 0x000000, "Member 'W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget, K2Node_Event_InDeathReasonIdx) == 0x000004, "Member 'W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget::K2Node_Event_InDeathReasonIdx' has a wrong offset!");
static_assert(offsetof(W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget, K2Node_SwitchInteger_CmpSuccess) == 0x000058, "Member 'W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget, K2Node_MakeArray_Array) == 0x000060, "Member 'W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000070, "Member 'W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget, CallFunc_Format_ReturnValue) == 0x000078, "Member 'W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000090, "Member 'W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000098, "Member 'W_RaidResult_FatalityDetailsWidget_C_ExecuteUbergraph_W_RaidResult_FatalityDetailsWidget::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

}

