#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RadialUi_GroupIndicatorWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_RadialUi_GroupIndicatorWidget.W_RadialUi_GroupIndicatorWidget_C
// 0x0020 (0x02A0 - 0x0280)
class UW_RadialUi_GroupIndicatorWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_GroupIndicatorGlow;                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_GroupIndicator;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsHoveredGroup;                                    // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x0299(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_RadialUi_GroupIndicatorWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void UpdateIndicator()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_RadialUi_GroupIndicatorWidget_C">();
	}
	static class UW_RadialUi_GroupIndicatorWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_RadialUi_GroupIndicatorWidget_C>();
	}
};
static_assert(alignof(UW_RadialUi_GroupIndicatorWidget_C) == 0x000008, "Wrong alignment on UW_RadialUi_GroupIndicatorWidget_C");
static_assert(sizeof(UW_RadialUi_GroupIndicatorWidget_C) == 0x0002A0, "Wrong size on UW_RadialUi_GroupIndicatorWidget_C");
static_assert(offsetof(UW_RadialUi_GroupIndicatorWidget_C, UberGraphFrame) == 0x000280, "Member 'UW_RadialUi_GroupIndicatorWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_RadialUi_GroupIndicatorWidget_C, Bdr_GroupIndicatorGlow) == 0x000288, "Member 'UW_RadialUi_GroupIndicatorWidget_C::Bdr_GroupIndicatorGlow' has a wrong offset!");
static_assert(offsetof(UW_RadialUi_GroupIndicatorWidget_C, Img_GroupIndicator) == 0x000290, "Member 'UW_RadialUi_GroupIndicatorWidget_C::Img_GroupIndicator' has a wrong offset!");
static_assert(offsetof(UW_RadialUi_GroupIndicatorWidget_C, IsHoveredGroup) == 0x000298, "Member 'UW_RadialUi_GroupIndicatorWidget_C::IsHoveredGroup' has a wrong offset!");
static_assert(offsetof(UW_RadialUi_GroupIndicatorWidget_C, IsSelected) == 0x000299, "Member 'UW_RadialUi_GroupIndicatorWidget_C::IsSelected' has a wrong offset!");

}

