#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidResult_HitMapWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_RaidResult_HitMapWidget.W_RaidResult_HitMapWidget_C
// 0x0020 (0x0600 - 0x05E0)
class UW_RaidResult_HitMapWidget_C final : public UP2RaidResultHitMapWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_HitMapModel;                                   // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_HitMapModel;                                   // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsDead;                                            // 0x05F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void RefreshHitMapWidgetOnBP()	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_RaidResult_HitMapWidget(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_RaidResult_HitMapWidget_C">();
	}
	static class UW_RaidResult_HitMapWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_RaidResult_HitMapWidget_C>();
	}
};
static_assert(alignof(UW_RaidResult_HitMapWidget_C) == 0x000008, "Wrong alignment on UW_RaidResult_HitMapWidget_C");
static_assert(sizeof(UW_RaidResult_HitMapWidget_C) == 0x000600, "Wrong size on UW_RaidResult_HitMapWidget_C");
static_assert(offsetof(UW_RaidResult_HitMapWidget_C, UberGraphFrame) == 0x0005E0, "Member 'UW_RaidResult_HitMapWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_HitMapWidget_C, Bdr_HitMapModel) == 0x0005E8, "Member 'UW_RaidResult_HitMapWidget_C::Bdr_HitMapModel' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_HitMapWidget_C, Img_HitMapModel) == 0x0005F0, "Member 'UW_RaidResult_HitMapWidget_C::Img_HitMapModel' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_HitMapWidget_C, IsDead) == 0x0005F8, "Member 'UW_RaidResult_HitMapWidget_C::IsDead' has a wrong offset!");

}

