#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidResult_DmgLogWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_RaidResult_DmgLogWidget.W_RaidResult_DmgLogWidget_C
// 0x0050 (0x02D8 - 0x0288)
class UW_RaidResult_DmgLogWidget_C final : public UP2RaidResultDamageLogWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SzB_FatalBlowLabel;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_DmgAmount;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_DmgArea;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Dmg_Area_Name;                                     // 0x02A8(0x0018)(Edit, BlueprintVisible)
	double                                        Dmg_Value;                                         // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Blk_Value;                                         // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Fatal_Blow;                                     // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetDmgLogInfo(const struct FGameplayTag& HitMapZoneTag, double DmgValue, double BlkValue, int32 HitDataCount, bool IsFatalBlow)	 // 0xae1e64;
	void RefreshDamageLogWidgetOnBP(const struct FP2RaidResultHitInfo& InData)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void GetAreaWithTag(const struct FGameplayTag& HitMapZoneTag, class FText* HitMapZoneText)	 // 0xae1e64;
	void ExecuteUbergraph_W_RaidResult_DmgLogWidget(int32 EntryPoint)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_RaidResult_DmgLogWidget_C">();
	}
	static class UW_RaidResult_DmgLogWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_RaidResult_DmgLogWidget_C>();
	}
};
static_assert(alignof(UW_RaidResult_DmgLogWidget_C) == 0x000008, "Wrong alignment on UW_RaidResult_DmgLogWidget_C");
static_assert(sizeof(UW_RaidResult_DmgLogWidget_C) == 0x0002D8, "Wrong size on UW_RaidResult_DmgLogWidget_C");
static_assert(offsetof(UW_RaidResult_DmgLogWidget_C, UberGraphFrame) == 0x000288, "Member 'UW_RaidResult_DmgLogWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_DmgLogWidget_C, SzB_FatalBlowLabel) == 0x000290, "Member 'UW_RaidResult_DmgLogWidget_C::SzB_FatalBlowLabel' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_DmgLogWidget_C, Txt_DmgAmount) == 0x000298, "Member 'UW_RaidResult_DmgLogWidget_C::Txt_DmgAmount' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_DmgLogWidget_C, Txt_DmgArea) == 0x0002A0, "Member 'UW_RaidResult_DmgLogWidget_C::Txt_DmgArea' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_DmgLogWidget_C, Dmg_Area_Name) == 0x0002A8, "Member 'UW_RaidResult_DmgLogWidget_C::Dmg_Area_Name' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_DmgLogWidget_C, Dmg_Value) == 0x0002C0, "Member 'UW_RaidResult_DmgLogWidget_C::Dmg_Value' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_DmgLogWidget_C, Blk_Value) == 0x0002C8, "Member 'UW_RaidResult_DmgLogWidget_C::Blk_Value' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_DmgLogWidget_C, Is_Fatal_Blow) == 0x0002D0, "Member 'UW_RaidResult_DmgLogWidget_C::Is_Fatal_Blow' has a wrong offset!");

}

