#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidReport_ItemWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_RaidReport_ItemWidget.W_RaidReport_ItemWidget_C
// 0x0118 (0x06A0 - 0x0588)
class UW_RaidReport_ItemWidget_C final : public UP2RaidReportItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0588(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_Normal;                                        // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_RaidReportItem;                                // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_Selected;                                      // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_TimeIcon;                                      // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_DateTime;                                      // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Mode;                                          // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_RaidReportItem;                                // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Result;                                        // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Date;                                          // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Mode;                                          // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Result;                                        // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Time;                                          // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         NormalFont;                                        // 0x05F0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         SelectedFont;                                      // 0x0648(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_RaidReport_ItemWidget(int32 EntryPoint)	 // 0xae1e64;
	void InitializeWidgetOnBP(const struct FP2RaidResultRecord& InResultRecord)	 // 0xae1e64;
	void OnSelected(bool bSelect)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_RaidReport_ItemWidget_C">();
	}
	static class UW_RaidReport_ItemWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_RaidReport_ItemWidget_C>();
	}
};
static_assert(alignof(UW_RaidReport_ItemWidget_C) == 0x000008, "Wrong alignment on UW_RaidReport_ItemWidget_C");
static_assert(sizeof(UW_RaidReport_ItemWidget_C) == 0x0006A0, "Wrong size on UW_RaidReport_ItemWidget_C");
static_assert(offsetof(UW_RaidReport_ItemWidget_C, UberGraphFrame) == 0x000588, "Member 'UW_RaidReport_ItemWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_RaidReport_ItemWidget_C, Bdr_Normal) == 0x000590, "Member 'UW_RaidReport_ItemWidget_C::Bdr_Normal' has a wrong offset!");
static_assert(offsetof(UW_RaidReport_ItemWidget_C, Bdr_RaidReportItem) == 0x000598, "Member 'UW_RaidReport_ItemWidget_C::Bdr_RaidReportItem' has a wrong offset!");
static_assert(offsetof(UW_RaidReport_ItemWidget_C, Bdr_Selected) == 0x0005A0, "Member 'UW_RaidReport_ItemWidget_C::Bdr_Selected' has a wrong offset!");
static_assert(offsetof(UW_RaidReport_ItemWidget_C, Img_TimeIcon) == 0x0005A8, "Member 'UW_RaidReport_ItemWidget_C::Img_TimeIcon' has a wrong offset!");
static_assert(offsetof(UW_RaidReport_ItemWidget_C, SzB_DateTime) == 0x0005B0, "Member 'UW_RaidReport_ItemWidget_C::SzB_DateTime' has a wrong offset!");
static_assert(offsetof(UW_RaidReport_ItemWidget_C, SzB_Mode) == 0x0005B8, "Member 'UW_RaidReport_ItemWidget_C::SzB_Mode' has a wrong offset!");
static_assert(offsetof(UW_RaidReport_ItemWidget_C, SzB_RaidReportItem) == 0x0005C0, "Member 'UW_RaidReport_ItemWidget_C::SzB_RaidReportItem' has a wrong offset!");
static_assert(offsetof(UW_RaidReport_ItemWidget_C, SzB_Result) == 0x0005C8, "Member 'UW_RaidReport_ItemWidget_C::SzB_Result' has a wrong offset!");
static_assert(offsetof(UW_RaidReport_ItemWidget_C, Txt_Date) == 0x0005D0, "Member 'UW_RaidReport_ItemWidget_C::Txt_Date' has a wrong offset!");
static_assert(offsetof(UW_RaidReport_ItemWidget_C, Txt_Mode) == 0x0005D8, "Member 'UW_RaidReport_ItemWidget_C::Txt_Mode' has a wrong offset!");
static_assert(offsetof(UW_RaidReport_ItemWidget_C, Txt_Result) == 0x0005E0, "Member 'UW_RaidReport_ItemWidget_C::Txt_Result' has a wrong offset!");
static_assert(offsetof(UW_RaidReport_ItemWidget_C, Txt_Time) == 0x0005E8, "Member 'UW_RaidReport_ItemWidget_C::Txt_Time' has a wrong offset!");
static_assert(offsetof(UW_RaidReport_ItemWidget_C, NormalFont) == 0x0005F0, "Member 'UW_RaidReport_ItemWidget_C::NormalFont' has a wrong offset!");
static_assert(offsetof(UW_RaidReport_ItemWidget_C, SelectedFont) == 0x000648, "Member 'UW_RaidReport_ItemWidget_C::SelectedFont' has a wrong offset!");

}

