#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidResult_PlayerInfoWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_RaidResult_PlayerInfoWidget.W_RaidResult_PlayerInfoWidget_C
// 0x0050 (0x03B0 - 0x0360)
class UW_RaidResult_PlayerInfoWidget_C final : public UP2RaidResultPlayerInfoWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_ProfilePic;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             ProfilePic;                                        // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   PlayerName;                                        // 0x0378(0x0018)(Edit, BlueprintVisible)
	int32                                         PlayerLevel;                                       // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CauseText;                                         // 0x0398(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetPlayerInfo(class UTexture2D* ProfilePic_0, const class FText& PlayerName_0, int32 PlayerLevel_0)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_RaidResult_PlayerInfoWidget(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_RaidResult_PlayerInfoWidget_C">();
	}
	static class UW_RaidResult_PlayerInfoWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_RaidResult_PlayerInfoWidget_C>();
	}
};
static_assert(alignof(UW_RaidResult_PlayerInfoWidget_C) == 0x000008, "Wrong alignment on UW_RaidResult_PlayerInfoWidget_C");
static_assert(sizeof(UW_RaidResult_PlayerInfoWidget_C) == 0x0003B0, "Wrong size on UW_RaidResult_PlayerInfoWidget_C");
static_assert(offsetof(UW_RaidResult_PlayerInfoWidget_C, UberGraphFrame) == 0x000360, "Member 'UW_RaidResult_PlayerInfoWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_PlayerInfoWidget_C, Img_ProfilePic) == 0x000368, "Member 'UW_RaidResult_PlayerInfoWidget_C::Img_ProfilePic' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_PlayerInfoWidget_C, ProfilePic) == 0x000370, "Member 'UW_RaidResult_PlayerInfoWidget_C::ProfilePic' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_PlayerInfoWidget_C, PlayerName) == 0x000378, "Member 'UW_RaidResult_PlayerInfoWidget_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_PlayerInfoWidget_C, PlayerLevel) == 0x000390, "Member 'UW_RaidResult_PlayerInfoWidget_C::PlayerLevel' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_PlayerInfoWidget_C, CauseText) == 0x000398, "Member 'UW_RaidResult_PlayerInfoWidget_C::CauseText' has a wrong offset!");

}

