#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidResult_RaidLog_StatWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_RaidResult_RaidLog_StatWidget.W_RaidResult_RaidLog_StatWidget_C
// 0x0190 (0x0420 - 0x0290)
class UW_RaidResult_RaidLog_StatWidget_C final : public UP2RaidResultRaidSummaryStatWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FText                                   Stat_Name;                                         // 0x0298(0x0018)(Edit, BlueprintVisible)
	bool                                          Is_Stat_Time;                                      // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Stat_Value;                                        // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         DefaultStatNameFont;                               // 0x02C0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         DefaultStatValueFont;                              // 0x0318(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         LogStatNameFont;                                   // 0x0370(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         LogStatValueFont;                                  // 0x03C8(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void SetStat(const class FText& StatName, bool IsStatTime, double StatValue)	 // 0xae1e64;
	void SetLogStyle(bool IsLogStyle)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_RaidResult_RaidLog_StatWidget(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_RaidResult_RaidLog_StatWidget_C">();
	}
	static class UW_RaidResult_RaidLog_StatWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_RaidResult_RaidLog_StatWidget_C>();
	}
};
static_assert(alignof(UW_RaidResult_RaidLog_StatWidget_C) == 0x000008, "Wrong alignment on UW_RaidResult_RaidLog_StatWidget_C");
static_assert(sizeof(UW_RaidResult_RaidLog_StatWidget_C) == 0x000420, "Wrong size on UW_RaidResult_RaidLog_StatWidget_C");
static_assert(offsetof(UW_RaidResult_RaidLog_StatWidget_C, UberGraphFrame) == 0x000290, "Member 'UW_RaidResult_RaidLog_StatWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_RaidLog_StatWidget_C, Stat_Name) == 0x000298, "Member 'UW_RaidResult_RaidLog_StatWidget_C::Stat_Name' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_RaidLog_StatWidget_C, Is_Stat_Time) == 0x0002B0, "Member 'UW_RaidResult_RaidLog_StatWidget_C::Is_Stat_Time' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_RaidLog_StatWidget_C, Stat_Value) == 0x0002B8, "Member 'UW_RaidResult_RaidLog_StatWidget_C::Stat_Value' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_RaidLog_StatWidget_C, DefaultStatNameFont) == 0x0002C0, "Member 'UW_RaidResult_RaidLog_StatWidget_C::DefaultStatNameFont' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_RaidLog_StatWidget_C, DefaultStatValueFont) == 0x000318, "Member 'UW_RaidResult_RaidLog_StatWidget_C::DefaultStatValueFont' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_RaidLog_StatWidget_C, LogStatNameFont) == 0x000370, "Member 'UW_RaidResult_RaidLog_StatWidget_C::LogStatNameFont' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_RaidLog_StatWidget_C, LogStatValueFont) == 0x0003C8, "Member 'UW_RaidResult_RaidLog_StatWidget_C::LogStatValueFont' has a wrong offset!");

}

