#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RadialUi_GroupIndicatorWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_RadialUi_GroupIndicatorWidget.W_RadialUi_GroupIndicatorWidget_C.ExecuteUbergraph_W_RadialUi_GroupIndicatorWidget
// 0x0030 (0x0030 - 0x0000)
struct W_RadialUi_GroupIndicatorWidget_C_ExecuteUbergraph_W_RadialUi_GroupIndicatorWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USizeBoxSlot*                           CallFunc_SlotAsSizeBoxSlot_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RadialUi_GroupIndicatorWidget_C_ExecuteUbergraph_W_RadialUi_GroupIndicatorWidget) == 0x000008, "Wrong alignment on W_RadialUi_GroupIndicatorWidget_C_ExecuteUbergraph_W_RadialUi_GroupIndicatorWidget");
static_assert(sizeof(W_RadialUi_GroupIndicatorWidget_C_ExecuteUbergraph_W_RadialUi_GroupIndicatorWidget) == 0x000030, "Wrong size on W_RadialUi_GroupIndicatorWidget_C_ExecuteUbergraph_W_RadialUi_GroupIndicatorWidget");
static_assert(offsetof(W_RadialUi_GroupIndicatorWidget_C_ExecuteUbergraph_W_RadialUi_GroupIndicatorWidget, EntryPoint) == 0x000000, "Member 'W_RadialUi_GroupIndicatorWidget_C_ExecuteUbergraph_W_RadialUi_GroupIndicatorWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_RadialUi_GroupIndicatorWidget_C_ExecuteUbergraph_W_RadialUi_GroupIndicatorWidget, K2Node_MakeStruct_Margin) == 0x000004, "Member 'W_RadialUi_GroupIndicatorWidget_C_ExecuteUbergraph_W_RadialUi_GroupIndicatorWidget::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_RadialUi_GroupIndicatorWidget_C_ExecuteUbergraph_W_RadialUi_GroupIndicatorWidget, K2Node_MakeStruct_Margin_1) == 0x000014, "Member 'W_RadialUi_GroupIndicatorWidget_C_ExecuteUbergraph_W_RadialUi_GroupIndicatorWidget::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(W_RadialUi_GroupIndicatorWidget_C_ExecuteUbergraph_W_RadialUi_GroupIndicatorWidget, K2Node_Event_IsDesignTime) == 0x000024, "Member 'W_RadialUi_GroupIndicatorWidget_C_ExecuteUbergraph_W_RadialUi_GroupIndicatorWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_RadialUi_GroupIndicatorWidget_C_ExecuteUbergraph_W_RadialUi_GroupIndicatorWidget, CallFunc_SlotAsSizeBoxSlot_ReturnValue) == 0x000028, "Member 'W_RadialUi_GroupIndicatorWidget_C_ExecuteUbergraph_W_RadialUi_GroupIndicatorWidget::CallFunc_SlotAsSizeBoxSlot_ReturnValue' has a wrong offset!");

// Function W_RadialUi_GroupIndicatorWidget.W_RadialUi_GroupIndicatorWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_RadialUi_GroupIndicatorWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RadialUi_GroupIndicatorWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_RadialUi_GroupIndicatorWidget_C_PreConstruct");
static_assert(sizeof(W_RadialUi_GroupIndicatorWidget_C_PreConstruct) == 0x000001, "Wrong size on W_RadialUi_GroupIndicatorWidget_C_PreConstruct");
static_assert(offsetof(W_RadialUi_GroupIndicatorWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_RadialUi_GroupIndicatorWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

