#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidTimerHud

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_RaidTimerHud.W_RaidTimerHud_C.ClearTimerHandle
// 0x0010 (0x0010 - 0x0000)
struct W_RaidTimerHud_C_ClearTimerHandle final
{
public:
	struct FTimerHandle                           InTimerHandle;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidTimerHud_C_ClearTimerHandle) == 0x000008, "Wrong alignment on W_RaidTimerHud_C_ClearTimerHandle");
static_assert(sizeof(W_RaidTimerHud_C_ClearTimerHandle) == 0x000010, "Wrong size on W_RaidTimerHud_C_ClearTimerHandle");
static_assert(offsetof(W_RaidTimerHud_C_ClearTimerHandle, InTimerHandle) == 0x000000, "Member 'W_RaidTimerHud_C_ClearTimerHandle::InTimerHandle' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_ClearTimerHandle, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000008, "Member 'W_RaidTimerHud_C_ClearTimerHandle::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");

// Function W_RaidTimerHud.W_RaidTimerHud_C.ExecuteUbergraph_W_RaidTimerHud
// 0x0080 (0x0080 - 0x0000)
struct W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue_1;              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetRaidRemainingTimeSec_OutTimeSec;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud) == 0x000008, "Wrong alignment on W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud");
static_assert(sizeof(W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud) == 0x000080, "Wrong size on W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud");
static_assert(offsetof(W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud, EntryPoint) == 0x000000, "Member 'W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud, K2Node_Event_MyGeometry) == 0x000008, "Member 'W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud, K2Node_Event_InDeltaTime) == 0x000040, "Member 'W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud, CallFunc_GetVisibility_ReturnValue) == 0x000044, "Member 'W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud, CallFunc_GetVisibility_ReturnValue_1) == 0x000045, "Member 'W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud::CallFunc_GetVisibility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud, K2Node_SwitchEnum_CmpSuccess) == 0x000046, "Member 'W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud, K2Node_SwitchEnum_CmpSuccess_1) == 0x000047, "Member 'W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud, CallFunc_GetRaidRemainingTimeSec_OutTimeSec) == 0x000048, "Member 'W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud::CallFunc_GetRaidRemainingTimeSec_OutTimeSec' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000050, "Member 'W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud, Temp_bool_Has_Been_Initd_Variable) == 0x000051, "Member 'W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud, CallFunc_GetOwningPlayer_ReturnValue) == 0x000058, "Member 'W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud, CallFunc_GetViewTarget_ReturnValue) == 0x000060, "Member 'W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000068, "Member 'W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud, K2Node_DynamicCast_AsP2Hero_Character) == 0x000070, "Member 'W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'W_RaidTimerHud_C_ExecuteUbergraph_W_RaidTimerHud::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function W_RaidTimerHud.W_RaidTimerHud_C.GetHrMinSec
// 0x0058 (0x0058 - 0x0000)
struct W_RaidTimerHud_C_GetHrMinSec final
{
public:
	double                                        InSec;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OutHr;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OutMin;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OutSec;                                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Sec;                                               // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Min;                                               // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Hr;                                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Percent_FloatFloat_ReturnValue_1;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidTimerHud_C_GetHrMinSec) == 0x000008, "Wrong alignment on W_RaidTimerHud_C_GetHrMinSec");
static_assert(sizeof(W_RaidTimerHud_C_GetHrMinSec) == 0x000058, "Wrong size on W_RaidTimerHud_C_GetHrMinSec");
static_assert(offsetof(W_RaidTimerHud_C_GetHrMinSec, InSec) == 0x000000, "Member 'W_RaidTimerHud_C_GetHrMinSec::InSec' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_GetHrMinSec, OutHr) == 0x000008, "Member 'W_RaidTimerHud_C_GetHrMinSec::OutHr' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_GetHrMinSec, OutMin) == 0x000010, "Member 'W_RaidTimerHud_C_GetHrMinSec::OutMin' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_GetHrMinSec, OutSec) == 0x000018, "Member 'W_RaidTimerHud_C_GetHrMinSec::OutSec' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_GetHrMinSec, Sec) == 0x000020, "Member 'W_RaidTimerHud_C_GetHrMinSec::Sec' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_GetHrMinSec, Min) == 0x000028, "Member 'W_RaidTimerHud_C_GetHrMinSec::Min' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_GetHrMinSec, Hr) == 0x000030, "Member 'W_RaidTimerHud_C_GetHrMinSec::Hr' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_GetHrMinSec, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000038, "Member 'W_RaidTimerHud_C_GetHrMinSec::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_GetHrMinSec, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000040, "Member 'W_RaidTimerHud_C_GetHrMinSec::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_GetHrMinSec, CallFunc_Percent_FloatFloat_ReturnValue_1) == 0x000048, "Member 'W_RaidTimerHud_C_GetHrMinSec::CallFunc_Percent_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_GetHrMinSec, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'W_RaidTimerHud_C_GetHrMinSec::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function W_RaidTimerHud.W_RaidTimerHud_C.GetRaidRemainingTimeSec
// 0x0020 (0x0020 - 0x0000)
struct W_RaidTimerHud_C_GetRaidRemainingTimeSec final
{
public:
	double                                        OutTimeSec;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TestTime;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRaidTimeRemainingSec_ReturnValue;      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_OutTimeSec_ImplicitCast;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidTimerHud_C_GetRaidRemainingTimeSec) == 0x000008, "Wrong alignment on W_RaidTimerHud_C_GetRaidRemainingTimeSec");
static_assert(sizeof(W_RaidTimerHud_C_GetRaidRemainingTimeSec) == 0x000020, "Wrong size on W_RaidTimerHud_C_GetRaidRemainingTimeSec");
static_assert(offsetof(W_RaidTimerHud_C_GetRaidRemainingTimeSec, OutTimeSec) == 0x000000, "Member 'W_RaidTimerHud_C_GetRaidRemainingTimeSec::OutTimeSec' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_GetRaidRemainingTimeSec, TestTime) == 0x000008, "Member 'W_RaidTimerHud_C_GetRaidRemainingTimeSec::TestTime' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_GetRaidRemainingTimeSec, CallFunc_GetRaidTimeRemainingSec_ReturnValue) == 0x000010, "Member 'W_RaidTimerHud_C_GetRaidRemainingTimeSec::CallFunc_GetRaidTimeRemainingSec_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_GetRaidRemainingTimeSec, K2Node_FunctionResult_OutTimeSec_ImplicitCast) == 0x000018, "Member 'W_RaidTimerHud_C_GetRaidRemainingTimeSec::K2Node_FunctionResult_OutTimeSec_ImplicitCast' has a wrong offset!");

// Function W_RaidTimerHud.W_RaidTimerHud_C.HoldShow
// 0x0002 (0x0002 - 0x0000)
struct W_RaidTimerHud_C_HoldShow final
{
public:
	bool                                          HoldShow_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidTimerHud_C_HoldShow) == 0x000001, "Wrong alignment on W_RaidTimerHud_C_HoldShow");
static_assert(sizeof(W_RaidTimerHud_C_HoldShow) == 0x000002, "Wrong size on W_RaidTimerHud_C_HoldShow");
static_assert(offsetof(W_RaidTimerHud_C_HoldShow, HoldShow_0) == 0x000000, "Member 'W_RaidTimerHud_C_HoldShow::HoldShow_0' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_HoldShow, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000001, "Member 'W_RaidTimerHud_C_HoldShow::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");

// Function W_RaidTimerHud.W_RaidTimerHud_C.InitRaidTimer
// 0x0030 (0x0030 - 0x0000)
struct W_RaidTimerHud_C_InitRaidTimer final
{
public:
	double                                        CallFunc_GetRaidRemainingTimeSec_OutTimeSec;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidTimerHud_C_InitRaidTimer) == 0x000008, "Wrong alignment on W_RaidTimerHud_C_InitRaidTimer");
static_assert(sizeof(W_RaidTimerHud_C_InitRaidTimer) == 0x000030, "Wrong size on W_RaidTimerHud_C_InitRaidTimer");
static_assert(offsetof(W_RaidTimerHud_C_InitRaidTimer, CallFunc_GetRaidRemainingTimeSec_OutTimeSec) == 0x000000, "Member 'W_RaidTimerHud_C_InitRaidTimer::CallFunc_GetRaidRemainingTimeSec_OutTimeSec' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_InitRaidTimer, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000008, "Member 'W_RaidTimerHud_C_InitRaidTimer::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_InitRaidTimer, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'W_RaidTimerHud_C_InitRaidTimer::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_InitRaidTimer, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000018, "Member 'W_RaidTimerHud_C_InitRaidTimer::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_InitRaidTimer, CallFunc_K2_SetTimer_ReturnValue) == 0x000020, "Member 'W_RaidTimerHud_C_InitRaidTimer::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_InitRaidTimer, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x000028, "Member 'W_RaidTimerHud_C_InitRaidTimer::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");

// Function W_RaidTimerHud.W_RaidTimerHud_C.PlayFadeInAnim
// 0x0030 (0x0030 - 0x0000)
struct W_RaidTimerHud_C_PlayFadeInAnim final
{
public:
	double                                        ShowTimeSec;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isUseFadoutTimer;                                  // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetRaidRemainingTimeSec_OutTimeSec;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetFadeOutTimer_Time_ImplicitCast;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidTimerHud_C_PlayFadeInAnim) == 0x000008, "Wrong alignment on W_RaidTimerHud_C_PlayFadeInAnim");
static_assert(sizeof(W_RaidTimerHud_C_PlayFadeInAnim) == 0x000030, "Wrong size on W_RaidTimerHud_C_PlayFadeInAnim");
static_assert(offsetof(W_RaidTimerHud_C_PlayFadeInAnim, ShowTimeSec) == 0x000000, "Member 'W_RaidTimerHud_C_PlayFadeInAnim::ShowTimeSec' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_PlayFadeInAnim, isUseFadoutTimer) == 0x000008, "Member 'W_RaidTimerHud_C_PlayFadeInAnim::isUseFadoutTimer' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_PlayFadeInAnim, CallFunc_GetRaidRemainingTimeSec_OutTimeSec) == 0x000010, "Member 'W_RaidTimerHud_C_PlayFadeInAnim::CallFunc_GetRaidRemainingTimeSec_OutTimeSec' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_PlayFadeInAnim, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000018, "Member 'W_RaidTimerHud_C_PlayFadeInAnim::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_PlayFadeInAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'W_RaidTimerHud_C_PlayFadeInAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_PlayFadeInAnim, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000028, "Member 'W_RaidTimerHud_C_PlayFadeInAnim::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_PlayFadeInAnim, CallFunc_SetFadeOutTimer_Time_ImplicitCast) == 0x00002C, "Member 'W_RaidTimerHud_C_PlayFadeInAnim::CallFunc_SetFadeOutTimer_Time_ImplicitCast' has a wrong offset!");

// Function W_RaidTimerHud.W_RaidTimerHud_C.PlayFadeOutAnim
// 0x0010 (0x0010 - 0x0000)
struct W_RaidTimerHud_C_PlayFadeOutAnim final
{
public:
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidTimerHud_C_PlayFadeOutAnim) == 0x000008, "Wrong alignment on W_RaidTimerHud_C_PlayFadeOutAnim");
static_assert(sizeof(W_RaidTimerHud_C_PlayFadeOutAnim) == 0x000010, "Wrong size on W_RaidTimerHud_C_PlayFadeOutAnim");
static_assert(offsetof(W_RaidTimerHud_C_PlayFadeOutAnim, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000000, "Member 'W_RaidTimerHud_C_PlayFadeOutAnim::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_PlayFadeOutAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'W_RaidTimerHud_C_PlayFadeOutAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function W_RaidTimerHud.W_RaidTimerHud_C.SetFadeOutTimer
// 0x0018 (0x0018 - 0x0000)
struct W_RaidTimerHud_C_SetFadeOutTimer final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NewLocalVar_0;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidTimerHud_C_SetFadeOutTimer) == 0x000008, "Wrong alignment on W_RaidTimerHud_C_SetFadeOutTimer");
static_assert(sizeof(W_RaidTimerHud_C_SetFadeOutTimer) == 0x000018, "Wrong size on W_RaidTimerHud_C_SetFadeOutTimer");
static_assert(offsetof(W_RaidTimerHud_C_SetFadeOutTimer, Time) == 0x000000, "Member 'W_RaidTimerHud_C_SetFadeOutTimer::Time' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_SetFadeOutTimer, NewLocalVar_0) == 0x000008, "Member 'W_RaidTimerHud_C_SetFadeOutTimer::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_SetFadeOutTimer, CallFunc_K2_SetTimer_ReturnValue) == 0x000010, "Member 'W_RaidTimerHud_C_SetFadeOutTimer::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function W_RaidTimerHud.W_RaidTimerHud_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_RaidTimerHud_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidTimerHud_C_Tick) == 0x000004, "Wrong alignment on W_RaidTimerHud_C_Tick");
static_assert(sizeof(W_RaidTimerHud_C_Tick) == 0x00003C, "Wrong size on W_RaidTimerHud_C_Tick");
static_assert(offsetof(W_RaidTimerHud_C_Tick, MyGeometry) == 0x000000, "Member 'W_RaidTimerHud_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_Tick, InDeltaTime) == 0x000038, "Member 'W_RaidTimerHud_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_RaidTimerHud.W_RaidTimerHud_C.UpdateRaidTime
// 0x0330 (0x0330 - 0x0000)
struct W_RaidTimerHud_C_UpdateRaidTime final
{
public:
	float                                         CallFunc_GetRaidTimeSec_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetRaidRemainingTimeSec_OutTimeSec;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0010(0x0018)()
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetHrMinSec_OutHr;                        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetHrMinSec_OutMin;                       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetHrMinSec_OutSec;                       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x00B0(0x0018)()
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D0(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0120(0x0018)()
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0140(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0190(0x0018)()
	int32                                         CallFunc_FFloor_ReturnValue_1;                     // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01B0(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0200(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0218(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0230(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0280(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x02D0(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x02E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02F0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0308(0x0018)()
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidTimerHud_C_UpdateRaidTime) == 0x000008, "Wrong alignment on W_RaidTimerHud_C_UpdateRaidTime");
static_assert(sizeof(W_RaidTimerHud_C_UpdateRaidTime) == 0x000330, "Wrong size on W_RaidTimerHud_C_UpdateRaidTime");
static_assert(offsetof(W_RaidTimerHud_C_UpdateRaidTime, CallFunc_GetRaidTimeSec_ReturnValue) == 0x000000, "Member 'W_RaidTimerHud_C_UpdateRaidTime::CallFunc_GetRaidTimeSec_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_UpdateRaidTime, CallFunc_GetRaidRemainingTimeSec_OutTimeSec) == 0x000008, "Member 'W_RaidTimerHud_C_UpdateRaidTime::CallFunc_GetRaidRemainingTimeSec_OutTimeSec' has a wrong offset!");
static_assert(offsetof(W_RaidTimerHud_C_UpdateRaidTime, CallFunc_MakeLiteralText_ReturnValue) == 0x000010, "Member 'W_RaidTimerHud_C_UpdateRaidTime::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
