#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidResult_PlayerSkillWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_RaidResult_PlayerSkillWidget.W_RaidResult_PlayerSkillWidget_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct W_RaidResult_PlayerSkillWidget_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_RaidResult_PlayerSkillWidget_C_OnMouseEnter) == 0x000008, "Wrong alignment on W_RaidResult_PlayerSkillWidget_C_OnMouseEnter");
static_assert(sizeof(W_RaidResult_PlayerSkillWidget_C_OnMouseEnter) == 0x0000B0, "Wrong size on W_RaidResult_PlayerSkillWidget_C_OnMouseEnter");
static_assert(offsetof(W_RaidResult_PlayerSkillWidget_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'W_RaidResult_PlayerSkillWidget_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerSkillWidget_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'W_RaidResult_PlayerSkillWidget_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function W_RaidResult_PlayerSkillWidget.W_RaidResult_PlayerSkillWidget_C.ExecuteUbergraph_W_RaidResult_PlayerSkillWidget
// 0x0228 (0x0228 - 0x0000)
struct W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00B8(0x0078)(ConstParm)
	TSoftObjectPtr<class UTexture2D>              K2Node_Event_InTexturePtr;                         // 0x0130(0x0030)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class FText                                   K2Node_Event_InSkillName;                          // 0x0160(0x0018)(ConstParm)
	int32                                         K2Node_Event_InPrevLevel;                          // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InCurLevel;                           // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0180(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0198(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01B0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0200(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0210(0x0018)()
};
static_assert(alignof(W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget) == 0x000008, "Wrong alignment on W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget");
static_assert(sizeof(W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget) == 0x000228, "Wrong size on W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget");
static_assert(offsetof(W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget, EntryPoint) == 0x000000, "Member 'W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget, K2Node_Event_MyGeometry) == 0x000008, "Member 'W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget, K2Node_Event_MouseEvent_1) == 0x000040, "Member 'W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget, K2Node_Event_MouseEvent) == 0x0000B8, "Member 'W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget, K2Node_Event_InTexturePtr) == 0x000130, "Member 'W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget::K2Node_Event_InTexturePtr' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget, K2Node_Event_InSkillName) == 0x000160, "Member 'W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget::K2Node_Event_InSkillName' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget, K2Node_Event_InPrevLevel) == 0x000178, "Member 'W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget::K2Node_Event_InPrevLevel' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget, K2Node_Event_InCurLevel) == 0x00017C, "Member 'W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget::K2Node_Event_InCurLevel' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget, CallFunc_Conv_IntToText_ReturnValue) == 0x000180, "Member 'W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000198, "Member 'W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget, K2Node_MakeStruct_FormatArgumentData) == 0x0001B0, "Member 'W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget, K2Node_MakeArray_Array) == 0x000200, "Member 'W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget, CallFunc_Format_ReturnValue) == 0x000210, "Member 'W_RaidResult_PlayerSkillWidget_C_ExecuteUbergraph_W_RaidResult_PlayerSkillWidget::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function W_RaidResult_PlayerSkillWidget.W_RaidResult_PlayerSkillWidget_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct W_RaidResult_PlayerSkillWidget_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_RaidResult_PlayerSkillWidget_C_OnMouseLeave) == 0x000008, "Wrong alignment on W_RaidResult_PlayerSkillWidget_C_OnMouseLeave");
static_assert(sizeof(W_RaidResult_PlayerSkillWidget_C_OnMouseLeave) == 0x000078, "Wrong size on W_RaidResult_PlayerSkillWidget_C_OnMouseLeave");
static_assert(offsetof(W_RaidResult_PlayerSkillWidget_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'W_RaidResult_PlayerSkillWidget_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function W_RaidResult_PlayerSkillWidget.W_RaidResult_PlayerSkillWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_RaidResult_PlayerSkillWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidResult_PlayerSkillWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_RaidResult_PlayerSkillWidget_C_PreConstruct");
static_assert(sizeof(W_RaidResult_PlayerSkillWidget_C_PreConstruct) == 0x000001, "Wrong size on W_RaidResult_PlayerSkillWidget_C_PreConstruct");
static_assert(offsetof(W_RaidResult_PlayerSkillWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_RaidResult_PlayerSkillWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_RaidResult_PlayerSkillWidget.W_RaidResult_PlayerSkillWidget_C.RefreshPlayerSkillWidgetOnBP
// 0x0050 (0x0050 - 0x0000)
struct W_RaidResult_PlayerSkillWidget_C_RefreshPlayerSkillWidgetOnBP final
{
public:
	TSoftObjectPtr<class UTexture2D>              InTexturePtr;                                      // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	class FText                                   InSkillName;                                       // 0x0030(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         InPrevLevel;                                       // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InCurLevel;                                        // 0x004C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidResult_PlayerSkillWidget_C_RefreshPlayerSkillWidgetOnBP) == 0x000008, "Wrong alignment on W_RaidResult_PlayerSkillWidget_C_RefreshPlayerSkillWidgetOnBP");
static_assert(sizeof(W_RaidResult_PlayerSkillWidget_C_RefreshPlayerSkillWidgetOnBP) == 0x000050, "Wrong size on W_RaidResult_PlayerSkillWidget_C_RefreshPlayerSkillWidgetOnBP");
static_assert(offsetof(W_RaidResult_PlayerSkillWidget_C_RefreshPlayerSkillWidgetOnBP, InTexturePtr) == 0x000000, "Member 'W_RaidResult_PlayerSkillWidget_C_RefreshPlayerSkillWidgetOnBP::InTexturePtr' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerSkillWidget_C_RefreshPlayerSkillWidgetOnBP, InSkillName) == 0x000030, "Member 'W_RaidResult_PlayerSkillWidget_C_RefreshPlayerSkillWidgetOnBP::InSkillName' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerSkillWidget_C_RefreshPlayerSkillWidgetOnBP, InPrevLevel) == 0x000048, "Member 'W_RaidResult_PlayerSkillWidget_C_RefreshPlayerSkillWidgetOnBP::InPrevLevel' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerSkillWidget_C_RefreshPlayerSkillWidgetOnBP, InCurLevel) == 0x00004C, "Member 'W_RaidResult_PlayerSkillWidget_C_RefreshPlayerSkillWidgetOnBP::InCurLevel' has a wrong offset!");

}

