#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidResult_RaidSummaryWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_RaidResult_RaidSummaryWidget.W_RaidResult_RaidSummaryWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_RaidResult_RaidSummaryWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidResult_RaidSummaryWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_RaidResult_RaidSummaryWidget_C_PreConstruct");
static_assert(sizeof(W_RaidResult_RaidSummaryWidget_C_PreConstruct) == 0x000001, "Wrong size on W_RaidResult_RaidSummaryWidget_C_PreConstruct");
static_assert(offsetof(W_RaidResult_RaidSummaryWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_RaidResult_RaidSummaryWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_RaidResult_RaidSummaryWidget.W_RaidResult_RaidSummaryWidget_C.PlayGaugeExpAnim
// 0x0010 (0x0010 - 0x0000)
struct W_RaidResult_RaidSummaryWidget_C_PlayGaugeExpAnim final
{
public:
	class UW_RaidResult_PlayerExpWidget_C*        K2Node_DynamicCast_AsW_Raid_Result_Player_Exp_Widget; // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidResult_RaidSummaryWidget_C_PlayGaugeExpAnim) == 0x000008, "Wrong alignment on W_RaidResult_RaidSummaryWidget_C_PlayGaugeExpAnim");
static_assert(sizeof(W_RaidResult_RaidSummaryWidget_C_PlayGaugeExpAnim) == 0x000010, "Wrong size on W_RaidResult_RaidSummaryWidget_C_PlayGaugeExpAnim");
static_assert(offsetof(W_RaidResult_RaidSummaryWidget_C_PlayGaugeExpAnim, K2Node_DynamicCast_AsW_Raid_Result_Player_Exp_Widget) == 0x000000, "Member 'W_RaidResult_RaidSummaryWidget_C_PlayGaugeExpAnim::K2Node_DynamicCast_AsW_Raid_Result_Player_Exp_Widget' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummaryWidget_C_PlayGaugeExpAnim, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'W_RaidResult_RaidSummaryWidget_C_PlayGaugeExpAnim::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function W_RaidResult_RaidSummaryWidget.W_RaidResult_RaidSummaryWidget_C.ExecuteUbergraph_W_RaidResult_RaidSummaryWidget
// 0x0008 (0x0008 - 0x0000)
struct W_RaidResult_RaidSummaryWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummaryWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidResult_RaidSummaryWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummaryWidget) == 0x000004, "Wrong alignment on W_RaidResult_RaidSummaryWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummaryWidget");
static_assert(sizeof(W_RaidResult_RaidSummaryWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummaryWidget) == 0x000008, "Wrong size on W_RaidResult_RaidSummaryWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummaryWidget");
static_assert(offsetof(W_RaidResult_RaidSummaryWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummaryWidget, EntryPoint) == 0x000000, "Member 'W_RaidResult_RaidSummaryWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummaryWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummaryWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummaryWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_RaidResult_RaidSummaryWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummaryWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

}

