#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidReport_SquadContract

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function W_RaidReport_SquadContract.W_RaidReport_SquadContract_C.ExecuteUbergraph_W_RaidReport_SquadContract
// 0x0048 (0x0048 - 0x0000)
struct W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2RaidResultChallenge                 K2Node_Event_InRaidResultChallenge;                // 0x0008(0x0018)(ConstParm, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_1;      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetReward_RewardValue_ImplicitCast;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetReward_RewardValue_ImplicitCast_1;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast_1;   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract) == 0x000008, "Wrong alignment on W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract");
static_assert(sizeof(W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract) == 0x000048, "Wrong size on W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract");
static_assert(offsetof(W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract, EntryPoint) == 0x000000, "Member 'W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract, K2Node_Event_InRaidResultChallenge) == 0x000008, "Member 'W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract::K2Node_Event_InRaidResultChallenge' has a wrong offset!");
static_assert(offsetof(W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000020, "Member 'W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000021, "Member 'W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract, CallFunc_NotEqual_DoubleDouble_ReturnValue_1) == 0x000022, "Member 'W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract::CallFunc_NotEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract, CallFunc_SetReward_RewardValue_ImplicitCast) == 0x000028, "Member 'W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract::CallFunc_SetReward_RewardValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract, CallFunc_NotEqual_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract::CallFunc_NotEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract, CallFunc_SetReward_RewardValue_ImplicitCast_1) == 0x000038, "Member 'W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract::CallFunc_SetReward_RewardValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract, CallFunc_NotEqual_DoubleDouble_A_ImplicitCast_1) == 0x000040, "Member 'W_RaidReport_SquadContract_C_ExecuteUbergraph_W_RaidReport_SquadContract::CallFunc_NotEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function W_RaidReport_SquadContract.W_RaidReport_SquadContract_C.OnInitWidget_ImplementableEvent
// 0x0018 (0x0018 - 0x0000)
struct W_RaidReport_SquadContract_C_OnInitWidget_ImplementableEvent final
{
public:
	struct FP2RaidResultChallenge                 InRaidResultChallenge;                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(W_RaidReport_SquadContract_C_OnInitWidget_ImplementableEvent) == 0x000008, "Wrong alignment on W_RaidReport_SquadContract_C_OnInitWidget_ImplementableEvent");
static_assert(sizeof(W_RaidReport_SquadContract_C_OnInitWidget_ImplementableEvent) == 0x000018, "Wrong size on W_RaidReport_SquadContract_C_OnInitWidget_ImplementableEvent");
static_assert(offsetof(W_RaidReport_SquadContract_C_OnInitWidget_ImplementableEvent, InRaidResultChallenge) == 0x000000, "Member 'W_RaidReport_SquadContract_C_OnInitWidget_ImplementableEvent::InRaidResultChallenge' has a wrong offset!");

// Function W_RaidReport_SquadContract.W_RaidReport_SquadContract_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_RaidReport_SquadContract_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidReport_SquadContract_C_PreConstruct) == 0x000001, "Wrong alignment on W_RaidReport_SquadContract_C_PreConstruct");
static_assert(sizeof(W_RaidReport_SquadContract_C_PreConstruct) == 0x000001, "Wrong size on W_RaidReport_SquadContract_C_PreConstruct");
static_assert(offsetof(W_RaidReport_SquadContract_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_RaidReport_SquadContract_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

