#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidDeployment_PlayerWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_RaidDeployment_PlayerWidget.W_RaidDeployment_PlayerWidget_C
// 0x0078 (0x02F8 - 0x0280)
class UW_RaidDeployment_PlayerWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_PlayerEmpty;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Btn_Player;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             GP_PlayerActive;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_EmptyProfile;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Leader;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_PlayerProfilePic;                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_PlayerInfo;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_PlayerLevel;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_PlayerName;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SquadNumberWidget_C*                 W_SquadNumberWidget;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsEmpty;                                           // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLeader;                                          // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DA[0x6];                                      // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PlayerName;                                        // 0x02E0(0x0018)(Edit, BlueprintVisible)

public:
	void BndEvt__W_RaidDeployment_PlayerWidget_Btn_Player_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_RaidDeployment_PlayerWidget_Btn_Player_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_RaidDeployment_PlayerWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetEmpty(bool InIsEmpty)	 // 0xae1e64;
	void SetLeader(bool InIsLeader, EP2MatchCountdownState InMatchCountdownState)	 // 0xae1e64;
	void SetPlayerName(const class FText& InText)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_RaidDeployment_PlayerWidget_C">();
	}
	static class UW_RaidDeployment_PlayerWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_RaidDeployment_PlayerWidget_C>();
	}
};
static_assert(alignof(UW_RaidDeployment_PlayerWidget_C) == 0x000008, "Wrong alignment on UW_RaidDeployment_PlayerWidget_C");
static_assert(sizeof(UW_RaidDeployment_PlayerWidget_C) == 0x0002F8, "Wrong size on UW_RaidDeployment_PlayerWidget_C");
static_assert(offsetof(UW_RaidDeployment_PlayerWidget_C, UberGraphFrame) == 0x000280, "Member 'UW_RaidDeployment_PlayerWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_RaidDeployment_PlayerWidget_C, Bdr_PlayerEmpty) == 0x000288, "Member 'UW_RaidDeployment_PlayerWidget_C::Bdr_PlayerEmpty' has a wrong offset!");
static_assert(offsetof(UW_RaidDeployment_PlayerWidget_C, Btn_Player) == 0x000290, "Member 'UW_RaidDeployment_PlayerWidget_C::Btn_Player' has a wrong offset!");
static_assert(offsetof(UW_RaidDeployment_PlayerWidget_C, GP_PlayerActive) == 0x000298, "Member 'UW_RaidDeployment_PlayerWidget_C::GP_PlayerActive' has a wrong offset!");
static_assert(offsetof(UW_RaidDeployment_PlayerWidget_C, Img_EmptyProfile) == 0x0002A0, "Member 'UW_RaidDeployment_PlayerWidget_C::Img_EmptyProfile' has a wrong offset!");
static_assert(offsetof(UW_RaidDeployment_PlayerWidget_C, Img_Leader) == 0x0002A8, "Member 'UW_RaidDeployment_PlayerWidget_C::Img_Leader' has a wrong offset!");
static_assert(offsetof(UW_RaidDeployment_PlayerWidget_C, Img_PlayerProfilePic) == 0x0002B0, "Member 'UW_RaidDeployment_PlayerWidget_C::Img_PlayerProfilePic' has a wrong offset!");
static_assert(offsetof(UW_RaidDeployment_PlayerWidget_C, SzB_PlayerInfo) == 0x0002B8, "Member 'UW_RaidDeployment_PlayerWidget_C::SzB_PlayerInfo' has a wrong offset!");
static_assert(offsetof(UW_RaidDeployment_PlayerWidget_C, Txt_PlayerLevel) == 0x0002C0, "Member 'UW_RaidDeployment_PlayerWidget_C::Txt_PlayerLevel' has a wrong offset!");
static_assert(offsetof(UW_RaidDeployment_PlayerWidget_C, Txt_PlayerName) == 0x0002C8, "Member 'UW_RaidDeployment_PlayerWidget_C::Txt_PlayerName' has a wrong offset!");
static_assert(offsetof(UW_RaidDeployment_PlayerWidget_C, W_SquadNumberWidget) == 0x0002D0, "Member 'UW_RaidDeployment_PlayerWidget_C::W_SquadNumberWidget' has a wrong offset!");
static_assert(offsetof(UW_RaidDeployment_PlayerWidget_C, IsEmpty) == 0x0002D8, "Member 'UW_RaidDeployment_PlayerWidget_C::IsEmpty' has a wrong offset!");
static_assert(offsetof(UW_RaidDeployment_PlayerWidget_C, IsLeader) == 0x0002D9, "Member 'UW_RaidDeployment_PlayerWidget_C::IsLeader' has a wrong offset!");
static_assert(offsetof(UW_RaidDeployment_PlayerWidget_C, PlayerName) == 0x0002E0, "Member 'UW_RaidDeployment_PlayerWidget_C::PlayerName' has a wrong offset!");

}

