#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidResult_EnemyInfoWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_RaidResult_EnemyInfoWidget.W_RaidResult_EnemyInfoWidget_C.ExecuteUbergraph_W_RaidResult_EnemyInfoWidget
// 0x0078 (0x0078 - 0x0000)
struct W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget) == 0x000008, "Wrong alignment on W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget");
static_assert(sizeof(W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget) == 0x000078, "Wrong size on W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget");
static_assert(offsetof(W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget, EntryPoint) == 0x000000, "Member 'W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000028, "Member 'W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000030, "Member 'W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000050, "Member 'W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000058, "Member 'W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result) == 0x000060, "Member 'W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result' has a wrong offset!");
static_assert(offsetof(W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue) == 0x000068, "Member 'W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget, CallFunc_IsValid_ReturnValue_2) == 0x000071, "Member 'W_RaidResult_EnemyInfoWidget_C_ExecuteUbergraph_W_RaidResult_EnemyInfoWidget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

}

