#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidResult_LootingLogWidget

#include "Basic.hpp"

#include "Hideout_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_RaidResult_LootingLogWidget.W_RaidResult_LootingLogWidget_C.SetItemLogInfo
// 0x01D0 (0x01D0 - 0x0000)
struct W_RaidResult_LootingLogWidget_C_SetItemLogInfo final
{
public:
	class FText                                   ItemName;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         ItemQuantity;                                      // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemValue;                                         // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Location_0;                                        // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	EFP2ItemLootState                             LootState;                                         // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x003C(0x0014)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0058(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x00C0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E8(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0138(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0150(0x0010)(ReferenceParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0160(0x0014)()
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0178(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0190(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x01A4(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x01B8(0x0014)()
};
static_assert(alignof(W_RaidResult_LootingLogWidget_C_SetItemLogInfo) == 0x000008, "Wrong alignment on W_RaidResult_LootingLogWidget_C_SetItemLogInfo");
static_assert(sizeof(W_RaidResult_LootingLogWidget_C_SetItemLogInfo) == 0x0001D0, "Wrong size on W_RaidResult_LootingLogWidget_C_SetItemLogInfo");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_SetItemLogInfo, ItemName) == 0x000000, "Member 'W_RaidResult_LootingLogWidget_C_SetItemLogInfo::ItemName' has a wrong offset!");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_SetItemLogInfo, ItemQuantity) == 0x000018, "Member 'W_RaidResult_LootingLogWidget_C_SetItemLogInfo::ItemQuantity' has a wrong offset!");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_SetItemLogInfo, ItemValue) == 0x00001C, "Member 'W_RaidResult_LootingLogWidget_C_SetItemLogInfo::ItemValue' has a wrong offset!");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_SetItemLogInfo, Location_0) == 0x000020, "Member 'W_RaidResult_LootingLogWidget_C_SetItemLogInfo::Location_0' has a wrong offset!");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_SetItemLogInfo, LootState) == 0x000038, "Member 'W_RaidResult_LootingLogWidget_C_SetItemLogInfo::LootState' has a wrong offset!");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_SetItemLogInfo, K2Node_MakeStruct_SlateColor) == 0x00003C, "Member 'W_RaidResult_LootingLogWidget_C_SetItemLogInfo::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_SetItemLogInfo, K2Node_SwitchEnum_CmpSuccess) == 0x000050, "Member 'W_RaidResult_LootingLogWidget_C_SetItemLogInfo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_SetItemLogInfo, CallFunc_Less_IntInt_ReturnValue) == 0x000051, "Member 'W_RaidResult_LootingLogWidget_C_SetItemLogInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_SetItemLogInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000058, "Member 'W_RaidResult_LootingLogWidget_C_SetItemLogInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_SetItemLogInfo, K2Node_MakeStruct_FormatArgumentData) == 0x000070, "Member 'W_RaidResult_LootingLogWidget_C_SetItemLogInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_SetItemLogInfo, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0000C0, "Member 'W_RaidResult_LootingLogWidget_C_SetItemLogInfo::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_SetItemLogInfo, K2Node_MakeArray_Array) == 0x0000D8, "Member 'W_RaidResult_LootingLogWidget_C_SetItemLogInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_SetItemLogInfo, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000E8, "Member 'W_RaidResult_LootingLogWidget_C_SetItemLogInfo::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_SetItemLogInfo, CallFunc_Format_ReturnValue) == 0x000138, "Member 'W_RaidResult_LootingLogWidget_C_SetItemLogInfo::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_SetItemLogInfo, K2Node_MakeArray_Array_1) == 0x000150, "Member 'W_RaidResult_LootingLogWidget_C_SetItemLogInfo::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_SetItemLogInfo, K2Node_MakeStruct_SlateColor_1) == 0x000160, "Member 'W_RaidResult_LootingLogWidget_C_SetItemLogInfo::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_SetItemLogInfo, CallFunc_Format_ReturnValue_1) == 0x000178, "Member 'W_RaidResult_LootingLogWidget_C_SetItemLogInfo::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_SetItemLogInfo, K2Node_MakeStruct_SlateColor_2) == 0x000190, "Member 'W_RaidResult_LootingLogWidget_C_SetItemLogInfo::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_SetItemLogInfo, K2Node_MakeStruct_SlateColor_3) == 0x0001A4, "Member 'W_RaidResult_LootingLogWidget_C_SetItemLogInfo::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_SetItemLogInfo, K2Node_MakeStruct_SlateColor_4) == 0x0001B8, "Member 'W_RaidResult_LootingLogWidget_C_SetItemLogInfo::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");

// Function W_RaidResult_LootingLogWidget.W_RaidResult_LootingLogWidget_C.SetArtifactLabel
// 0x0001 (0x0001 - 0x0000)
struct W_RaidResult_LootingLogWidget_C_SetArtifactLabel final
{
public:
	bool                                          IsArtifact;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidResult_LootingLogWidget_C_SetArtifactLabel) == 0x000001, "Wrong alignment on W_RaidResult_LootingLogWidget_C_SetArtifactLabel");
static_assert(sizeof(W_RaidResult_LootingLogWidget_C_SetArtifactLabel) == 0x000001, "Wrong size on W_RaidResult_LootingLogWidget_C_SetArtifactLabel");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_SetArtifactLabel, IsArtifact) == 0x000000, "Member 'W_RaidResult_LootingLogWidget_C_SetArtifactLabel::IsArtifact' has a wrong offset!");

// Function W_RaidResult_LootingLogWidget.W_RaidResult_LootingLogWidget_C.RefreshLootingLogWidgetOnBP
// 0x0030 (0x0030 - 0x0000)
struct W_RaidResult_LootingLogWidget_C_RefreshLootingLogWidgetOnBP final
{
public:
	struct FP2RaidResultLootingLogInfo            InData;                                            // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(W_RaidResult_LootingLogWidget_C_RefreshLootingLogWidgetOnBP) == 0x000008, "Wrong alignment on W_RaidResult_LootingLogWidget_C_RefreshLootingLogWidgetOnBP");
static_assert(sizeof(W_RaidResult_LootingLogWidget_C_RefreshLootingLogWidgetOnBP) == 0x000030, "Wrong size on W_RaidResult_LootingLogWidget_C_RefreshLootingLogWidgetOnBP");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_RefreshLootingLogWidgetOnBP, InData) == 0x000000, "Member 'W_RaidResult_LootingLogWidget_C_RefreshLootingLogWidgetOnBP::InData' has a wrong offset!");

// Function W_RaidResult_LootingLogWidget.W_RaidResult_LootingLogWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_RaidResult_LootingLogWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidResult_LootingLogWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_RaidResult_LootingLogWidget_C_PreConstruct");
static_assert(sizeof(W_RaidResult_LootingLogWidget_C_PreConstruct) == 0x000001, "Wrong size on W_RaidResult_LootingLogWidget_C_PreConstruct");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_RaidResult_LootingLogWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_RaidResult_LootingLogWidget.W_RaidResult_LootingLogWidget_C.ExecuteUbergraph_W_RaidResult_LootingLogWidget
// 0x0040 (0x0040 - 0x0000)
struct W_RaidResult_LootingLogWidget_C_ExecuteUbergraph_W_RaidResult_LootingLogWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2RaidResultLootingLogInfo            K2Node_Event_InData;                               // 0x0008(0x0030)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidResult_LootingLogWidget_C_ExecuteUbergraph_W_RaidResult_LootingLogWidget) == 0x000008, "Wrong alignment on W_RaidResult_LootingLogWidget_C_ExecuteUbergraph_W_RaidResult_LootingLogWidget");
static_assert(sizeof(W_RaidResult_LootingLogWidget_C_ExecuteUbergraph_W_RaidResult_LootingLogWidget) == 0x000040, "Wrong size on W_RaidResult_LootingLogWidget_C_ExecuteUbergraph_W_RaidResult_LootingLogWidget");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_ExecuteUbergraph_W_RaidResult_LootingLogWidget, EntryPoint) == 0x000000, "Member 'W_RaidResult_LootingLogWidget_C_ExecuteUbergraph_W_RaidResult_LootingLogWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_ExecuteUbergraph_W_RaidResult_LootingLogWidget, K2Node_Event_InData) == 0x000008, "Member 'W_RaidResult_LootingLogWidget_C_ExecuteUbergraph_W_RaidResult_LootingLogWidget::K2Node_Event_InData' has a wrong offset!");
static_assert(offsetof(W_RaidResult_LootingLogWidget_C_ExecuteUbergraph_W_RaidResult_LootingLogWidget, K2Node_Event_IsDesignTime) == 0x000038, "Member 'W_RaidResult_LootingLogWidget_C_ExecuteUbergraph_W_RaidResult_LootingLogWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

}

