#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RadialUiWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_RadialUiWidget.W_RadialUiWidget_C.ActiveInputAction_Implementable
// 0x0030 (0x0030 - 0x0000)
struct W_RadialUiWidget_C_ActiveInputAction_Implementable final
{
public:
	const class UInputAction*                     InInputAction;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           InInputTag;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      InputActionValue;                                  // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(W_RadialUiWidget_C_ActiveInputAction_Implementable) == 0x000008, "Wrong alignment on W_RadialUiWidget_C_ActiveInputAction_Implementable");
static_assert(sizeof(W_RadialUiWidget_C_ActiveInputAction_Implementable) == 0x000030, "Wrong size on W_RadialUiWidget_C_ActiveInputAction_Implementable");
static_assert(offsetof(W_RadialUiWidget_C_ActiveInputAction_Implementable, InInputAction) == 0x000000, "Member 'W_RadialUiWidget_C_ActiveInputAction_Implementable::InInputAction' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ActiveInputAction_Implementable, InInputTag) == 0x000008, "Member 'W_RadialUiWidget_C_ActiveInputAction_Implementable::InInputTag' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ActiveInputAction_Implementable, InputActionValue) == 0x000010, "Member 'W_RadialUiWidget_C_ActiveInputAction_Implementable::InputActionValue' has a wrong offset!");

// Function W_RadialUiWidget.W_RadialUiWidget_C.ExecuteUbergraph_W_RadialUiWidget
// 0x0108 (0x0108 - 0x0000)
struct W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	const class UInputAction*                     K2Node_Event_InInputAction;                        // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_InInputTag;                           // 0x0010(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_Event_InputActionValue;                     // 0x0018(0x0020)(ConstParm, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_1;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x003C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UP2AbilitySystemComponent*              K2Node_DynamicCast_AsP2Ability_System_Component;   // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget) == 0x000008, "Wrong alignment on W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget");
static_assert(sizeof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget) == 0x000108, "Wrong size on W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, EntryPoint) == 0x000000, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, K2Node_Event_IsDesignTime) == 0x000005, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, K2Node_Event_InInputAction) == 0x000008, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::K2Node_Event_InInputAction' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, K2Node_Event_InInputTag) == 0x000010, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::K2Node_Event_InInputTag' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, K2Node_Event_InputActionValue) == 0x000018, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::K2Node_Event_InputActionValue' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, CallFunc_MatchesTag_ReturnValue) == 0x000038, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, CallFunc_MatchesTag_ReturnValue_1) == 0x000039, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::CallFunc_MatchesTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, K2Node_Event_MyGeometry) == 0x00003C, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, K2Node_Event_InDeltaTime) == 0x000074, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, CallFunc_BooleanOR_ReturnValue) == 0x000078, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000080, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, CallFunc_GetViewportSize_ReturnValue) == 0x000088, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, CallFunc_BreakVector2D_X) == 0x000098, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, CallFunc_BreakVector2D_Y) == 0x0000A0, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0000B0, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, CallFunc_FTrunc_ReturnValue) == 0x0000B8, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, CallFunc_MakeVector2D_ReturnValue) == 0x0000C0, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, CallFunc_FTrunc_ReturnValue_1) == 0x0000D0, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, K2Node_CreateDelegate_OutputDelegate) == 0x0000D4, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x0000E8, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0000F0, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, K2Node_DynamicCast_AsP2Ability_System_Component) == 0x0000F8, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::K2Node_DynamicCast_AsP2Ability_System_Component' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'W_RadialUiWidget_C_ExecuteUbergraph_W_RadialUiWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function W_RadialUiWidget.W_RadialUiWidget_C.PlayFadeIn
// 0x0010 (0x0010 - 0x0000)
struct W_RadialUiWidget_C_PlayFadeIn final
{
public:
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RadialUiWidget_C_PlayFadeIn) == 0x000008, "Wrong alignment on W_RadialUiWidget_C_PlayFadeIn");
static_assert(sizeof(W_RadialUiWidget_C_PlayFadeIn) == 0x000010, "Wrong size on W_RadialUiWidget_C_PlayFadeIn");
static_assert(offsetof(W_RadialUiWidget_C_PlayFadeIn, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000000, "Member 'W_RadialUiWidget_C_PlayFadeIn::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_PlayFadeIn, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000001, "Member 'W_RadialUiWidget_C_PlayFadeIn::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_PlayFadeIn, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'W_RadialUiWidget_C_PlayFadeIn::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function W_RadialUiWidget.W_RadialUiWidget_C.PlayFadeOut
// 0x0010 (0x0010 - 0x0000)
struct W_RadialUiWidget_C_PlayFadeOut final
{
public:
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RadialUiWidget_C_PlayFadeOut) == 0x000008, "Wrong alignment on W_RadialUiWidget_C_PlayFadeOut");
static_assert(sizeof(W_RadialUiWidget_C_PlayFadeOut) == 0x000010, "Wrong size on W_RadialUiWidget_C_PlayFadeOut");
static_assert(offsetof(W_RadialUiWidget_C_PlayFadeOut, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000000, "Member 'W_RadialUiWidget_C_PlayFadeOut::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_PlayFadeOut, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000001, "Member 'W_RadialUiWidget_C_PlayFadeOut::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_PlayFadeOut, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'W_RadialUiWidget_C_PlayFadeOut::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function W_RadialUiWidget.W_RadialUiWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_RadialUiWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RadialUiWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_RadialUiWidget_C_PreConstruct");
static_assert(sizeof(W_RadialUiWidget_C_PreConstruct) == 0x000001, "Wrong size on W_RadialUiWidget_C_PreConstruct");
static_assert(offsetof(W_RadialUiWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_RadialUiWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_RadialUiWidget.W_RadialUiWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_RadialUiWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RadialUiWidget_C_Tick) == 0x000004, "Wrong alignment on W_RadialUiWidget_C_Tick");
static_assert(sizeof(W_RadialUiWidget_C_Tick) == 0x00003C, "Wrong size on W_RadialUiWidget_C_Tick");
static_assert(offsetof(W_RadialUiWidget_C_Tick, MyGeometry) == 0x000000, "Member 'W_RadialUiWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_RadialUiWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'W_RadialUiWidget_C_Tick::InDeltaTime' has a wrong offset!");

}

