#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidDeployment_DZWidget

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Game_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function W_RaidDeployment_DZWidget.W_RaidDeployment_DZWidget_C.Create Count Stepper
// 0x0038 (0x0038 - 0x0000)
struct W_RaidDeployment_DZWidget_C_Create_Count_Stepper final
{
public:
	int32                                         InTeamCount;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_CountStepperWidget_C*                CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidDeployment_DZWidget_C_Create_Count_Stepper) == 0x000008, "Wrong alignment on W_RaidDeployment_DZWidget_C_Create_Count_Stepper");
static_assert(sizeof(W_RaidDeployment_DZWidget_C_Create_Count_Stepper) == 0x000038, "Wrong size on W_RaidDeployment_DZWidget_C_Create_Count_Stepper");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_Create_Count_Stepper, InTeamCount) == 0x000000, "Member 'W_RaidDeployment_DZWidget_C_Create_Count_Stepper::InTeamCount' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_Create_Count_Stepper, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'W_RaidDeployment_DZWidget_C_Create_Count_Stepper::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_Create_Count_Stepper, Temp_int_Variable) == 0x000008, "Member 'W_RaidDeployment_DZWidget_C_Create_Count_Stepper::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_Create_Count_Stepper, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'W_RaidDeployment_DZWidget_C_Create_Count_Stepper::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_Create_Count_Stepper, CallFunc_Create_ReturnValue) == 0x000018, "Member 'W_RaidDeployment_DZWidget_C_Create_Count_Stepper::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_Create_Count_Stepper, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'W_RaidDeployment_DZWidget_C_Create_Count_Stepper::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_Create_Count_Stepper, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'W_RaidDeployment_DZWidget_C_Create_Count_Stepper::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_Create_Count_Stepper, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000028, "Member 'W_RaidDeployment_DZWidget_C_Create_Count_Stepper::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_Create_Count_Stepper, CallFunc_GetChildrenCount_ReturnValue) == 0x000030, "Member 'W_RaidDeployment_DZWidget_C_Create_Count_Stepper::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_Create_Count_Stepper, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000034, "Member 'W_RaidDeployment_DZWidget_C_Create_Count_Stepper::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function W_RaidDeployment_DZWidget.W_RaidDeployment_DZWidget_C.ExecuteUbergraph_W_RaidDeployment_DZWidget
// 0x00B0 (0x00B0 - 0x0000)
struct W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0048(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0068(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDeployZoneEnabled_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2PlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2MatchCountdownState                        CallFunc_GetMatchStartCountdownState_ReturnValue;  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerSquadleader_ReturnValue;          // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2PlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget) == 0x000008, "Wrong alignment on W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget");
static_assert(sizeof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget) == 0x0000B0, "Wrong size on W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, EntryPoint) == 0x000000, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, K2Node_Event_MyGeometry) == 0x000008, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, K2Node_Event_InDeltaTime) == 0x000040, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, CallFunc_Conv_IntToText_ReturnValue) == 0x000048, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000060, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, CallFunc_Clamp_ReturnValue) == 0x000064, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, Temp_delegate_Variable) == 0x000068, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, CallFunc_IsDeployZoneEnabled_ReturnValue) == 0x000078, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::CallFunc_IsDeployZoneEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, CallFunc_Not_PreBool_ReturnValue_1) == 0x000079, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000080, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, CallFunc_GetMatchStartCountdownState_ReturnValue) == 0x000088, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::CallFunc_GetMatchStartCountdownState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, CallFunc_IsValid_ReturnValue) == 0x000089, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00008A, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, CallFunc_IsPlayerSquadleader_ReturnValue) == 0x00008B, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::CallFunc_IsPlayerSquadleader_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000090, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, CallFunc_BooleanAND_ReturnValue) == 0x000098, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, CallFunc_IsValid_ReturnValue_1) == 0x000099, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, CallFunc_BooleanAND_ReturnValue_1) == 0x00009A, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, CallFunc_IsValid_ReturnValue_2) == 0x00009B, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, CallFunc_BooleanOR_ReturnValue) == 0x00009C, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, CallFunc_BooleanOR_ReturnValue_1) == 0x00009D, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000A0, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget, CallFunc_PostEvent_ReturnValue) == 0x0000A8, "Member 'W_RaidDeployment_DZWidget_C_ExecuteUbergraph_W_RaidDeployment_DZWidget::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

// Function W_RaidDeployment_DZWidget.W_RaidDeployment_DZWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_RaidDeployment_DZWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidDeployment_DZWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_RaidDeployment_DZWidget_C_PreConstruct");
static_assert(sizeof(W_RaidDeployment_DZWidget_C_PreConstruct) == 0x000001, "Wrong size on W_RaidDeployment_DZWidget_C_PreConstruct");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_RaidDeployment_DZWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_RaidDeployment_DZWidget.W_RaidDeployment_DZWidget_C.SetDeployCount
// 0x000C (0x000C - 0x0000)
struct W_RaidDeployment_DZWidget_C_SetDeployCount final
{
public:
	int32                                         InTeamCount;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InZoneSize;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidDeployment_DZWidget_C_SetDeployCount) == 0x000004, "Wrong alignment on W_RaidDeployment_DZWidget_C_SetDeployCount");
static_assert(sizeof(W_RaidDeployment_DZWidget_C_SetDeployCount) == 0x00000C, "Wrong size on W_RaidDeployment_DZWidget_C_SetDeployCount");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetDeployCount, InTeamCount) == 0x000000, "Member 'W_RaidDeployment_DZWidget_C_SetDeployCount::InTeamCount' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetDeployCount, InZoneSize) == 0x000004, "Member 'W_RaidDeployment_DZWidget_C_SetDeployCount::InZoneSize' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetDeployCount, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000008, "Member 'W_RaidDeployment_DZWidget_C_SetDeployCount::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetDeployCount, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'W_RaidDeployment_DZWidget_C_SetDeployCount::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetDeployCount, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'W_RaidDeployment_DZWidget_C_SetDeployCount::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function W_RaidDeployment_DZWidget.W_RaidDeployment_DZWidget_C.SetDisabledButtonStyle
// 0x0014 (0x0014 - 0x0000)
struct W_RaidDeployment_DZWidget_C_SetDisabledButtonStyle final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
};
static_assert(alignof(W_RaidDeployment_DZWidget_C_SetDisabledButtonStyle) == 0x000004, "Wrong alignment on W_RaidDeployment_DZWidget_C_SetDisabledButtonStyle");
static_assert(sizeof(W_RaidDeployment_DZWidget_C_SetDisabledButtonStyle) == 0x000014, "Wrong size on W_RaidDeployment_DZWidget_C_SetDisabledButtonStyle");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetDisabledButtonStyle, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'W_RaidDeployment_DZWidget_C_SetDisabledButtonStyle::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function W_RaidDeployment_DZWidget.W_RaidDeployment_DZWidget_C.SetMissingHaloJump
// 0x00B8 (0x00B8 - 0x0000)
struct W_RaidDeployment_DZWidget_C_SetMissingHaloJump final
{
public:
	struct FP2DeployZoneUnavailableReason         Reason;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Available;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FP2SquadMemberInfo>             CallFunc_GetSquadMembers_ReturnValue;              // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A0(0x0018)()
};
static_assert(alignof(W_RaidDeployment_DZWidget_C_SetMissingHaloJump) == 0x000008, "Wrong alignment on W_RaidDeployment_DZWidget_C_SetMissingHaloJump");
static_assert(sizeof(W_RaidDeployment_DZWidget_C_SetMissingHaloJump) == 0x0000B8, "Wrong size on W_RaidDeployment_DZWidget_C_SetMissingHaloJump");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetMissingHaloJump, Reason) == 0x000000, "Member 'W_RaidDeployment_DZWidget_C_SetMissingHaloJump::Reason' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetMissingHaloJump, Available) == 0x000018, "Member 'W_RaidDeployment_DZWidget_C_SetMissingHaloJump::Available' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetMissingHaloJump, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'W_RaidDeployment_DZWidget_C_SetMissingHaloJump::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetMissingHaloJump, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000020, "Member 'W_RaidDeployment_DZWidget_C_SetMissingHaloJump::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetMissingHaloJump, CallFunc_GetSquadMembers_ReturnValue) == 0x000028, "Member 'W_RaidDeployment_DZWidget_C_SetMissingHaloJump::CallFunc_GetSquadMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetMissingHaloJump, CallFunc_Array_Length_ReturnValue_1) == 0x000038, "Member 'W_RaidDeployment_DZWidget_C_SetMissingHaloJump::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetMissingHaloJump, CallFunc_Subtract_IntInt_ReturnValue) == 0x00003C, "Member 'W_RaidDeployment_DZWidget_C_SetMissingHaloJump::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetMissingHaloJump, CallFunc_Conv_IntToString_ReturnValue) == 0x000040, "Member 'W_RaidDeployment_DZWidget_C_SetMissingHaloJump::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetMissingHaloJump, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000050, "Member 'W_RaidDeployment_DZWidget_C_SetMissingHaloJump::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetMissingHaloJump, CallFunc_Concat_StrStr_ReturnValue) == 0x000060, "Member 'W_RaidDeployment_DZWidget_C_SetMissingHaloJump::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetMissingHaloJump, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000070, "Member 'W_RaidDeployment_DZWidget_C_SetMissingHaloJump::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetMissingHaloJump, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000080, "Member 'W_RaidDeployment_DZWidget_C_SetMissingHaloJump::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetMissingHaloJump, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000090, "Member 'W_RaidDeployment_DZWidget_C_SetMissingHaloJump::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetMissingHaloJump, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A0, "Member 'W_RaidDeployment_DZWidget_C_SetMissingHaloJump::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function W_RaidDeployment_DZWidget.W_RaidDeployment_DZWidget_C.SetSelected
// 0x002C (0x002C - 0x0000)
struct W_RaidDeployment_DZWidget_C_SetSelected final
{
public:
	bool                                          InIsSelected;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
};
static_assert(alignof(W_RaidDeployment_DZWidget_C_SetSelected) == 0x000004, "Wrong alignment on W_RaidDeployment_DZWidget_C_SetSelected");
static_assert(sizeof(W_RaidDeployment_DZWidget_C_SetSelected) == 0x00002C, "Wrong size on W_RaidDeployment_DZWidget_C_SetSelected");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetSelected, InIsSelected) == 0x000000, "Member 'W_RaidDeployment_DZWidget_C_SetSelected::InIsSelected' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetSelected, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_RaidDeployment_DZWidget_C_SetSelected::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetSelected, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_RaidDeployment_DZWidget_C_SetSelected::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function W_RaidDeployment_DZWidget.W_RaidDeployment_DZWidget_C.SetUnavailable
// 0x0018 (0x0018 - 0x0000)
struct W_RaidDeployment_DZWidget_C_SetUnavailable final
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1;      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidDeployment_DZWidget_C_SetUnavailable) == 0x000008, "Wrong alignment on W_RaidDeployment_DZWidget_C_SetUnavailable");
static_assert(sizeof(W_RaidDeployment_DZWidget_C_SetUnavailable) == 0x000018, "Wrong size on W_RaidDeployment_DZWidget_C_SetUnavailable");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetUnavailable, Condition) == 0x000000, "Member 'W_RaidDeployment_DZWidget_C_SetUnavailable::Condition' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetUnavailable, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000008, "Member 'W_RaidDeployment_DZWidget_C_SetUnavailable::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_SetUnavailable, CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1) == 0x000010, "Member 'W_RaidDeployment_DZWidget_C_SetUnavailable::CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1' has a wrong offset!");

// Function W_RaidDeployment_DZWidget.W_RaidDeployment_DZWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_RaidDeployment_DZWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidDeployment_DZWidget_C_Tick) == 0x000004, "Wrong alignment on W_RaidDeployment_DZWidget_C_Tick");
static_assert(sizeof(W_RaidDeployment_DZWidget_C_Tick) == 0x00003C, "Wrong size on W_RaidDeployment_DZWidget_C_Tick");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_Tick, MyGeometry) == 0x000000, "Member 'W_RaidDeployment_DZWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'W_RaidDeployment_DZWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_RaidDeployment_DZWidget.W_RaidDeployment_DZWidget_C.UpdateDeployZoneInfo
// 0x0060 (0x0060 - 0x0000)
struct W_RaidDeployment_DZWidget_C_UpdateDeployZoneInfo final
{
public:
	struct FP2DeployZoneInfo                      InZoneInfo;                                        // 0x0000(0x001C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	EP2MatchCountdownState                        CallFunc_GetMatchStartCountdownState_ReturnValue;  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2PlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetSelectedZone_ReturnValue;              // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDeployZoneLocationsNum_ReturnValue;    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDeployZoneEnabled_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2DeployZoneUnavailableReason         CallFunc_CanSelectZone_OutReason;                  // 0x0040(0x0018)()
	bool                                          CallFunc_CanSelectZone_ReturnValue;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_1;                 // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidDeployment_DZWidget_C_UpdateDeployZoneInfo) == 0x000008, "Wrong alignment on W_RaidDeployment_DZWidget_C_UpdateDeployZoneInfo");
static_assert(sizeof(W_RaidDeployment_DZWidget_C_UpdateDeployZoneInfo) == 0x000060, "Wrong size on W_RaidDeployment_DZWidget_C_UpdateDeployZoneInfo");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_UpdateDeployZoneInfo, InZoneInfo) == 0x000000, "Member 'W_RaidDeployment_DZWidget_C_UpdateDeployZoneInfo::InZoneInfo' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_DZWidget_C_UpdateDeployZoneInfo, CallFunc_GetMatchStartCountdownState_ReturnValue) == 0x00001C, "Member 'W_RaidDeployment_DZWidget_C_UpdateDeployZoneInfo::CallFunc_GetMatchStartCountdownState_ReturnValue' has a wrong offset!");
