#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidReport

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_RaidReport.W_RaidReport_C.ExecuteUbergraph_W_RaidReport
// 0x0320 (0x0320 - 0x0000)
struct W_RaidReport_C_ExecuteUbergraph_W_RaidReport final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_hasNoData;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2RaidResultRecord                    K2Node_Event_InCurrentRecord;                      // 0x0020(0x02F8)(ConstParm)
	int32                                         CallFunc_GetSquadContractsExp_ReturnValue;         // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidReport_C_ExecuteUbergraph_W_RaidReport) == 0x000008, "Wrong alignment on W_RaidReport_C_ExecuteUbergraph_W_RaidReport");
static_assert(sizeof(W_RaidReport_C_ExecuteUbergraph_W_RaidReport) == 0x000320, "Wrong size on W_RaidReport_C_ExecuteUbergraph_W_RaidReport");
static_assert(offsetof(W_RaidReport_C_ExecuteUbergraph_W_RaidReport, EntryPoint) == 0x000000, "Member 'W_RaidReport_C_ExecuteUbergraph_W_RaidReport::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_ExecuteUbergraph_W_RaidReport, K2Node_Event_hasNoData) == 0x000004, "Member 'W_RaidReport_C_ExecuteUbergraph_W_RaidReport::K2Node_Event_hasNoData' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_ExecuteUbergraph_W_RaidReport, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'W_RaidReport_C_ExecuteUbergraph_W_RaidReport::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_ExecuteUbergraph_W_RaidReport, K2Node_Event_IsDesignTime) == 0x00001C, "Member 'W_RaidReport_C_ExecuteUbergraph_W_RaidReport::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_ExecuteUbergraph_W_RaidReport, K2Node_Event_InCurrentRecord) == 0x000020, "Member 'W_RaidReport_C_ExecuteUbergraph_W_RaidReport::K2Node_Event_InCurrentRecord' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_ExecuteUbergraph_W_RaidReport, CallFunc_GetSquadContractsExp_ReturnValue) == 0x000318, "Member 'W_RaidReport_C_ExecuteUbergraph_W_RaidReport::CallFunc_GetSquadContractsExp_ReturnValue' has a wrong offset!");

// Function W_RaidReport.W_RaidReport_C.GetFinalLevel
// 0x02D8 (0x02D8 - 0x0000)
struct W_RaidReport_C_GetFinalLevel final
{
public:
	struct FP2RaidResultStateSnapshot             BaseSnapshot;                                      // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FP2RaidResultStateSnapshot             FinalSnapshot;                                     // 0x0048(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FP2RaidResultStatistics                RaidResultStat;                                    // 0x0090(0x0240)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         FinalLevel;                                        // 0x02D0(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x02D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidReport_C_GetFinalLevel) == 0x000008, "Wrong alignment on W_RaidReport_C_GetFinalLevel");
static_assert(sizeof(W_RaidReport_C_GetFinalLevel) == 0x0002D8, "Wrong size on W_RaidReport_C_GetFinalLevel");
static_assert(offsetof(W_RaidReport_C_GetFinalLevel, BaseSnapshot) == 0x000000, "Member 'W_RaidReport_C_GetFinalLevel::BaseSnapshot' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_GetFinalLevel, FinalSnapshot) == 0x000048, "Member 'W_RaidReport_C_GetFinalLevel::FinalSnapshot' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_GetFinalLevel, RaidResultStat) == 0x000090, "Member 'W_RaidReport_C_GetFinalLevel::RaidResultStat' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_GetFinalLevel, FinalLevel) == 0x0002D0, "Member 'W_RaidReport_C_GetFinalLevel::FinalLevel' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_GetFinalLevel, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0002D4, "Member 'W_RaidReport_C_GetFinalLevel::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_GetFinalLevel, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x0002D5, "Member 'W_RaidReport_C_GetFinalLevel::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function W_RaidReport.W_RaidReport_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_RaidReport_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidReport_C_PreConstruct) == 0x000001, "Wrong alignment on W_RaidReport_C_PreConstruct");
static_assert(sizeof(W_RaidReport_C_PreConstruct) == 0x000001, "Wrong size on W_RaidReport_C_PreConstruct");
static_assert(offsetof(W_RaidReport_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_RaidReport_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_RaidReport.W_RaidReport_C.RefreshDetailResultOnBP
// 0x02F8 (0x02F8 - 0x0000)
struct W_RaidReport_C_RefreshDetailResultOnBP final
{
public:
	struct FP2RaidResultRecord                    InCurrentRecord;                                   // 0x0000(0x02F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_RaidReport_C_RefreshDetailResultOnBP) == 0x000008, "Wrong alignment on W_RaidReport_C_RefreshDetailResultOnBP");
static_assert(sizeof(W_RaidReport_C_RefreshDetailResultOnBP) == 0x0002F8, "Wrong size on W_RaidReport_C_RefreshDetailResultOnBP");
static_assert(offsetof(W_RaidReport_C_RefreshDetailResultOnBP, InCurrentRecord) == 0x000000, "Member 'W_RaidReport_C_RefreshDetailResultOnBP::InCurrentRecord' has a wrong offset!");

// Function W_RaidReport.W_RaidReport_C.RefreshRaidReportNoDataOnBP
// 0x0001 (0x0001 - 0x0000)
struct W_RaidReport_C_RefreshRaidReportNoDataOnBP final
{
public:
	bool                                          hasNoData;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidReport_C_RefreshRaidReportNoDataOnBP) == 0x000001, "Wrong alignment on W_RaidReport_C_RefreshRaidReportNoDataOnBP");
static_assert(sizeof(W_RaidReport_C_RefreshRaidReportNoDataOnBP) == 0x000001, "Wrong size on W_RaidReport_C_RefreshRaidReportNoDataOnBP");
static_assert(offsetof(W_RaidReport_C_RefreshRaidReportNoDataOnBP, hasNoData) == 0x000000, "Member 'W_RaidReport_C_RefreshRaidReportNoDataOnBP::hasNoData' has a wrong offset!");

// Function W_RaidReport.W_RaidReport_C.Set Battle Log Show NPCKill Info
// 0x0238 (0x0238 - 0x0000)
struct W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info final
{
public:
	TArray<class FString>                         StringArray;                                       // 0x0000(0x0010)(Edit, BlueprintVisible)
	TMap<class FString, int32>                    TempNPCMap;                                        // 0x0010(0x0050)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0078(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FP2RaidResultNPCKillInfo               CallFunc_Array_Get_Item;                           // 0x0080(0x0040)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x00F8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0118(0x0018)()
	int32                                         CallFunc_Map_Find_Value;                           // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0138(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0190(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01E8(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0200(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value_1;                         // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info) == 0x000008, "Wrong alignment on W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info");
static_assert(sizeof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info) == 0x000238, "Wrong size on W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, StringArray) == 0x000000, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::StringArray' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, TempNPCMap) == 0x000010, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::TempNPCMap' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, Temp_int_Array_Index_Variable) == 0x000060, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, Temp_int_Loop_Counter_Variable_1) == 0x000068, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, CallFunc_Add_IntInt_ReturnValue_1) == 0x000070, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, Temp_int_Array_Index_Variable_1) == 0x000074, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, Temp_int_Variable) == 0x000078, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, Temp_int_Variable_1) == 0x00007C, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, CallFunc_Array_Get_Item) == 0x000080, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, CallFunc_Less_IntInt_ReturnValue) == 0x0000C4, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, CallFunc_Conv_TextToString_ReturnValue) == 0x0000C8, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0000D8, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0000E8, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, CallFunc_Map_Keys_Keys) == 0x0000F8, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, CallFunc_Array_Get_Item_1) == 0x000108, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, CallFunc_Conv_StringToText_ReturnValue) == 0x000118, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, CallFunc_Map_Find_Value) == 0x000130, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, CallFunc_Map_Find_ReturnValue) == 0x000134, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, K2Node_MakeStruct_FormatArgumentData) == 0x000138, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000188, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, K2Node_MakeStruct_FormatArgumentData_1) == 0x000190, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, CallFunc_Array_Length_ReturnValue_1) == 0x0001E0, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, K2Node_MakeArray_Array) == 0x0001E8, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001F8, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, CallFunc_Format_ReturnValue) == 0x000200, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, CallFunc_Conv_TextToString_ReturnValue_3) == 0x000218, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, CallFunc_Array_Add_ReturnValue) == 0x000228, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, CallFunc_Map_Find_Value_1) == 0x00022C, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, CallFunc_Map_Find_ReturnValue_1) == 0x000230, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info, CallFunc_Add_IntInt_ReturnValue_2) == 0x000234, "Member 'W_RaidReport_C_Set_Battle_Log_Show_NPCKill_Info::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function W_RaidReport.W_RaidReport_C.Set Report Date
// 0x02C8 (0x02C8 - 0x0000)
struct W_RaidReport_C_Set_Report_Date final
{
public:
	struct FDateTime                              InDateTime;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2RaidResultStatistics                InStats;                                           // 0x0008(0x0240)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   MeridiemString;                                    // 0x0248(0x0018)(Edit, BlueprintVisible)
	class FText                                   MonthString;                                       // 0x0260(0x0018)(Edit, BlueprintVisible)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0278(0x0014)()
	bool                                          CallFunc_IsAfternoon_ReturnValue;                  // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextFromStringTable_ReturnValue;          // 0x0290(0x0018)()
	int32                                         CallFunc_GetMonth_ReturnValue;                     // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x02AC(0x0014)()
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidReport_C_Set_Report_Date) == 0x000008, "Wrong alignment on W_RaidReport_C_Set_Report_Date");
static_assert(sizeof(W_RaidReport_C_Set_Report_Date) == 0x0002C8, "Wrong size on W_RaidReport_C_Set_Report_Date");
static_assert(offsetof(W_RaidReport_C_Set_Report_Date, InDateTime) == 0x000000, "Member 'W_RaidReport_C_Set_Report_Date::InDateTime' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Report_Date, InStats) == 0x000008, "Member 'W_RaidReport_C_Set_Report_Date::InStats' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Report_Date, MeridiemString) == 0x000248, "Member 'W_RaidReport_C_Set_Report_Date::MeridiemString' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Report_Date, MonthString) == 0x000260, "Member 'W_RaidReport_C_Set_Report_Date::MonthString' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Report_Date, K2Node_MakeStruct_SlateColor) == 0x000278, "Member 'W_RaidReport_C_Set_Report_Date::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Report_Date, CallFunc_IsAfternoon_ReturnValue) == 0x00028C, "Member 'W_RaidReport_C_Set_Report_Date::CallFunc_IsAfternoon_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Report_Date, CallFunc_TextFromStringTable_ReturnValue) == 0x000290, "Member 'W_RaidReport_C_Set_Report_Date::CallFunc_TextFromStringTable_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Report_Date, CallFunc_GetMonth_ReturnValue) == 0x0002A8, "Member 'W_RaidReport_C_Set_Report_Date::CallFunc_GetMonth_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Report_Date, K2Node_MakeStruct_SlateColor_1) == 0x0002AC, "Member 'W_RaidReport_C_Set_Report_Date::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_Set_Report_Date, K2Node_SwitchInteger_CmpSuccess) == 0x0002C0, "Member 'W_RaidReport_C_Set_Report_Date::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function W_RaidReport.W_RaidReport_C.SetBattleLog
// 0x03D0 (0x03D0 - 0x0000)
struct W_RaidReport_C_SetBattleLog final
{
public:
	struct FP2RaidResultStatistics                RecordStats;                                       // 0x0000(0x0240)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   AmmoName_KilledBy;                                 // 0x0240(0x0018)(Edit, BlueprintVisible)
	class FText                                   WeaponName_Killedby;                               // 0x0258(0x0018)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  TempTagContainer_KilledBy;                         // 0x0270(0x0020)(Edit, BlueprintVisible)
	TMap<class FString, int32>                    TempNPCMap;                                        // 0x0290(0x0050)(Edit, BlueprintVisible)
	class FText                                   CallFunc_GetInstigatorName_ReturnValue;            // 0x02E0(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x02F8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0320(0x0018)()
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0340(0x0018)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x0358(0x0018)()
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0378(0x0018)()
	bool                                          CallFunc_Array_IsEmpty_ReturnValue_1;              // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0398(0x0018)()
	TDelegate<void(const TArray<class UP2ItemData*>& InItemsData)> K2Node_CreateDelegate_OutputDelegate; // 0x03B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast_1;   // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidReport_C_SetBattleLog) == 0x000008, "Wrong alignment on W_RaidReport_C_SetBattleLog");
static_assert(sizeof(W_RaidReport_C_SetBattleLog) == 0x0003D0, "Wrong size on W_RaidReport_C_SetBattleLog");
static_assert(offsetof(W_RaidReport_C_SetBattleLog, RecordStats) == 0x000000, "Member 'W_RaidReport_C_SetBattleLog::RecordStats' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog, AmmoName_KilledBy) == 0x000240, "Member 'W_RaidReport_C_SetBattleLog::AmmoName_KilledBy' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog, WeaponName_Killedby) == 0x000258, "Member 'W_RaidReport_C_SetBattleLog::WeaponName_Killedby' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog, TempTagContainer_KilledBy) == 0x000270, "Member 'W_RaidReport_C_SetBattleLog::TempTagContainer_KilledBy' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog, TempNPCMap) == 0x000290, "Member 'W_RaidReport_C_SetBattleLog::TempNPCMap' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog, CallFunc_GetInstigatorName_ReturnValue) == 0x0002E0, "Member 'W_RaidReport_C_SetBattleLog::CallFunc_GetInstigatorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog, CallFunc_Conv_IntToText_ReturnValue) == 0x0002F8, "Member 'W_RaidReport_C_SetBattleLog::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog, CallFunc_Conv_TextToString_ReturnValue) == 0x000310, "Member 'W_RaidReport_C_SetBattleLog::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000320, "Member 'W_RaidReport_C_SetBattleLog::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog, CallFunc_IsEmpty_ReturnValue) == 0x000338, "Member 'W_RaidReport_C_SetBattleLog::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000340, "Member 'W_RaidReport_C_SetBattleLog::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x000358, "Member 'W_RaidReport_C_SetBattleLog::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog, CallFunc_Array_IsEmpty_ReturnValue) == 0x000370, "Member 'W_RaidReport_C_SetBattleLog::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000378, "Member 'W_RaidReport_C_SetBattleLog::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog, CallFunc_Array_IsEmpty_ReturnValue_1) == 0x000390, "Member 'W_RaidReport_C_SetBattleLog::CallFunc_Array_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog, CallFunc_Add_IntInt_ReturnValue) == 0x000394, "Member 'W_RaidReport_C_SetBattleLog::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog, CallFunc_Conv_IntToText_ReturnValue_3) == 0x000398, "Member 'W_RaidReport_C_SetBattleLog::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog, K2Node_CreateDelegate_OutputDelegate) == 0x0003B0, "Member 'W_RaidReport_C_SetBattleLog::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x0003C0, "Member 'W_RaidReport_C_SetBattleLog::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog, CallFunc_Conv_DoubleToText_Value_ImplicitCast_1) == 0x0003C8, "Member 'W_RaidReport_C_SetBattleLog::CallFunc_Conv_DoubleToText_Value_ImplicitCast_1' has a wrong offset!");

// Function W_RaidReport.W_RaidReport_C.SetBattleLog_ShowInstigatorInfo
// 0x02C8 (0x02C8 - 0x0000)
struct W_RaidReport_C_SetBattleLog_ShowInstigatorInfo final
{
public:
	TArray<class UP2ItemData*>                    ItemdataList;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         TotalMyHitPointCount;                              // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, int32>              TempHitPointMap;                                   // 0x0018(0x0050)(Edit, BlueprintVisible)
	TArray<class FString>                         StringArray;                                       // 0x0068(0x0010)(Edit, BlueprintVisible)
	class FText                                   AmmoName_KilledBy;                                 // 0x0078(0x0018)(Edit, BlueprintVisible)
	class FText                                   WeaponName_Killedby;                               // 0x0090(0x0018)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2ItemData*                            CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameTagDisplayText_ReturnValue;        // 0x00D0(0x0018)()
	class FText                                   CallFunc_GetGameTagDisplayText_ReturnValue_1;      // 0x00E8(0x0018)()
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   CallFunc_Map_Keys_Keys;                            // 0x0108(0x0010)(ReferenceParm)
	struct FGameplayTag                           CallFunc_Array_Get_Item_1;                         // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameTagDisplayText_ReturnValue_2;      // 0x0130(0x0018)()
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0150(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01B8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0208(0x0050)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0260(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0270(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FP2RaidResultHitPointInfo              CallFunc_Array_Get_Item_2;                         // 0x02A8(0x000C)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo) == 0x000008, "Wrong alignment on W_RaidReport_C_SetBattleLog_ShowInstigatorInfo");
static_assert(sizeof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo) == 0x0002C8, "Wrong size on W_RaidReport_C_SetBattleLog_ShowInstigatorInfo");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, ItemdataList) == 0x000000, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::ItemdataList' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, TotalMyHitPointCount) == 0x000010, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::TotalMyHitPointCount' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, TempHitPointMap) == 0x000018, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::TempHitPointMap' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, StringArray) == 0x000068, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::StringArray' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, AmmoName_KilledBy) == 0x000078, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::AmmoName_KilledBy' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, WeaponName_Killedby) == 0x000090, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::WeaponName_Killedby' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, Temp_int_Array_Index_Variable) == 0x0000AC, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, Temp_int_Array_Index_Variable_1) == 0x0000B0, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, Temp_int_Loop_Counter_Variable) == 0x0000B4, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Add_IntInt_ReturnValue) == 0x0000BC, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, Temp_int_Array_Index_Variable_2) == 0x0000C0, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_GetGameTagDisplayText_ReturnValue) == 0x0000D0, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_GetGameTagDisplayText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_GetGameTagDisplayText_ReturnValue_1) == 0x0000E8, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_GetGameTagDisplayText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000100, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Map_Keys_Keys) == 0x000108, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Array_Get_Item_1) == 0x000118, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Array_Length_ReturnValue_1) == 0x000120, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Map_Find_Value) == 0x000124, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Map_Find_ReturnValue) == 0x000128, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_GetGameTagDisplayText_ReturnValue_2) == 0x000130, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_GetGameTagDisplayText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Multiply_IntInt_ReturnValue) == 0x000148, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, K2Node_MakeStruct_FormatArgumentData) == 0x000150, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Divide_IntInt_ReturnValue) == 0x0001A0, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0001A8, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0001B0, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001B8, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, K2Node_MakeStruct_FormatArgumentData_2) == 0x000208, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, Temp_int_Loop_Counter_Variable_1) == 0x000258, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, K2Node_MakeArray_Array) == 0x000260, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Format_ReturnValue) == 0x000270, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Add_IntInt_ReturnValue_1) == 0x000288, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Conv_TextToString_ReturnValue) == 0x000290, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Array_Add_ReturnValue) == 0x0002A0, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, Temp_int_Loop_Counter_Variable_2) == 0x0002A4, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Array_Get_Item_2) == 0x0002A8, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002B4, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Add_IntInt_ReturnValue_2) == 0x0002B8, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Add_IntInt_ReturnValue_3) == 0x0002BC, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Array_Length_ReturnValue_2) == 0x0002C0, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_RaidReport_C_SetBattleLog_ShowInstigatorInfo, CallFunc_Less_IntInt_ReturnValue_2) == 0x0002C4, "Member 'W_RaidReport_C_SetBattleLog_ShowInstigatorInfo::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function W_RaidReport.W_RaidReport_C.SetBattleLog_ShowPMCKillInfo
// 0x0388 (0x0388 - 0x0000)
struct W_RaidReport_C_SetBattleLog_ShowPMCKillInfo final
{
public:
	TArray<class FString>                         StringArray_HitMap;                                // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         TotalPMCHitPointCount;                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         StringArray;                                       // 0x0018(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FP2RaidResultHitPointInfo              CallFunc_Array_Get_Item;                           // 0x0044(0x000C)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameTagDisplayText_ReturnValue;        // 0x0058(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0050)(HasGetValueTypeHash)
	struct FP2RaidResultHitPointInfo              CallFunc_Array_Get_Item_1;                         // 0x00C0(0x000C)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2RaidResultKillInfo                  CallFunc_Array_Get_Item_2;                         // 0x00D8(0x0100)()
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameTagDisplayText_ReturnValue_1;      // 0x01E0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01F8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0248(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0298(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02A8(0x0018)()
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x02E0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0330(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0348(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0360(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
