#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidResult_PlayerInfoWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_RaidResult_PlayerInfoWidget.W_RaidResult_PlayerInfoWidget_C.SetPlayerInfo
// 0x00B8 (0x00B8 - 0x0000)
struct W_RaidResult_PlayerInfoWidget_C_SetPlayerInfo final
{
public:
	class UTexture2D*                             ProfilePic_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   PlayerName_0;                                      // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         PlayerLevel_0;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A0(0x0018)()
};
static_assert(alignof(W_RaidResult_PlayerInfoWidget_C_SetPlayerInfo) == 0x000008, "Wrong alignment on W_RaidResult_PlayerInfoWidget_C_SetPlayerInfo");
static_assert(sizeof(W_RaidResult_PlayerInfoWidget_C_SetPlayerInfo) == 0x0000B8, "Wrong size on W_RaidResult_PlayerInfoWidget_C_SetPlayerInfo");
static_assert(offsetof(W_RaidResult_PlayerInfoWidget_C_SetPlayerInfo, ProfilePic_0) == 0x000000, "Member 'W_RaidResult_PlayerInfoWidget_C_SetPlayerInfo::ProfilePic_0' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerInfoWidget_C_SetPlayerInfo, PlayerName_0) == 0x000008, "Member 'W_RaidResult_PlayerInfoWidget_C_SetPlayerInfo::PlayerName_0' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerInfoWidget_C_SetPlayerInfo, PlayerLevel_0) == 0x000020, "Member 'W_RaidResult_PlayerInfoWidget_C_SetPlayerInfo::PlayerLevel_0' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerInfoWidget_C_SetPlayerInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'W_RaidResult_PlayerInfoWidget_C_SetPlayerInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerInfoWidget_C_SetPlayerInfo, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'W_RaidResult_PlayerInfoWidget_C_SetPlayerInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerInfoWidget_C_SetPlayerInfo, K2Node_MakeArray_Array) == 0x000090, "Member 'W_RaidResult_PlayerInfoWidget_C_SetPlayerInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerInfoWidget_C_SetPlayerInfo, CallFunc_Format_ReturnValue) == 0x0000A0, "Member 'W_RaidResult_PlayerInfoWidget_C_SetPlayerInfo::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function W_RaidResult_PlayerInfoWidget.W_RaidResult_PlayerInfoWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_RaidResult_PlayerInfoWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidResult_PlayerInfoWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_RaidResult_PlayerInfoWidget_C_PreConstruct");
static_assert(sizeof(W_RaidResult_PlayerInfoWidget_C_PreConstruct) == 0x000001, "Wrong size on W_RaidResult_PlayerInfoWidget_C_PreConstruct");
static_assert(offsetof(W_RaidResult_PlayerInfoWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_RaidResult_PlayerInfoWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_RaidResult_PlayerInfoWidget.W_RaidResult_PlayerInfoWidget_C.ExecuteUbergraph_W_RaidResult_PlayerInfoWidget
// 0x0008 (0x0008 - 0x0000)
struct W_RaidResult_PlayerInfoWidget_C_ExecuteUbergraph_W_RaidResult_PlayerInfoWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidResult_PlayerInfoWidget_C_ExecuteUbergraph_W_RaidResult_PlayerInfoWidget) == 0x000004, "Wrong alignment on W_RaidResult_PlayerInfoWidget_C_ExecuteUbergraph_W_RaidResult_PlayerInfoWidget");
static_assert(sizeof(W_RaidResult_PlayerInfoWidget_C_ExecuteUbergraph_W_RaidResult_PlayerInfoWidget) == 0x000008, "Wrong size on W_RaidResult_PlayerInfoWidget_C_ExecuteUbergraph_W_RaidResult_PlayerInfoWidget");
static_assert(offsetof(W_RaidResult_PlayerInfoWidget_C_ExecuteUbergraph_W_RaidResult_PlayerInfoWidget, EntryPoint) == 0x000000, "Member 'W_RaidResult_PlayerInfoWidget_C_ExecuteUbergraph_W_RaidResult_PlayerInfoWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_RaidResult_PlayerInfoWidget_C_ExecuteUbergraph_W_RaidResult_PlayerInfoWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_RaidResult_PlayerInfoWidget_C_ExecuteUbergraph_W_RaidResult_PlayerInfoWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

}

