#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RestockTooltipWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_RestockTooltipWidget.W_RestockTooltipWidget_C.ExecuteUbergraph_W_RestockTooltipWidget
// 0x0040 (0x0040 - 0x0000)
struct W_RestockTooltipWidget_C_ExecuteUbergraph_W_RestockTooltipWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RestockTooltipWidget_C_ExecuteUbergraph_W_RestockTooltipWidget) == 0x000004, "Wrong alignment on W_RestockTooltipWidget_C_ExecuteUbergraph_W_RestockTooltipWidget");
static_assert(sizeof(W_RestockTooltipWidget_C_ExecuteUbergraph_W_RestockTooltipWidget) == 0x000040, "Wrong size on W_RestockTooltipWidget_C_ExecuteUbergraph_W_RestockTooltipWidget");
static_assert(offsetof(W_RestockTooltipWidget_C_ExecuteUbergraph_W_RestockTooltipWidget, EntryPoint) == 0x000000, "Member 'W_RestockTooltipWidget_C_ExecuteUbergraph_W_RestockTooltipWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_RestockTooltipWidget_C_ExecuteUbergraph_W_RestockTooltipWidget, K2Node_Event_MyGeometry) == 0x000004, "Member 'W_RestockTooltipWidget_C_ExecuteUbergraph_W_RestockTooltipWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_RestockTooltipWidget_C_ExecuteUbergraph_W_RestockTooltipWidget, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'W_RestockTooltipWidget_C_ExecuteUbergraph_W_RestockTooltipWidget::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function W_RestockTooltipWidget.W_RestockTooltipWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_RestockTooltipWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RestockTooltipWidget_C_Tick) == 0x000004, "Wrong alignment on W_RestockTooltipWidget_C_Tick");
static_assert(sizeof(W_RestockTooltipWidget_C_Tick) == 0x00003C, "Wrong size on W_RestockTooltipWidget_C_Tick");
static_assert(offsetof(W_RestockTooltipWidget_C_Tick, MyGeometry) == 0x000000, "Member 'W_RestockTooltipWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_RestockTooltipWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'W_RestockTooltipWidget_C_Tick::InDeltaTime' has a wrong offset!");

}

