#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Research_RewardClaimedWidget

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Hideout_structs.hpp"


namespace SDK::Params
{

// Function W_Research_RewardClaimedWidget.W_Research_RewardClaimedWidget_C.SetRewardTypeBP
// 0x0001 (0x0001 - 0x0000)
struct W_Research_RewardClaimedWidget_C_SetRewardTypeBP final
{
public:
	EP2ResearchRewardType                         InRewardType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_RewardClaimedWidget_C_SetRewardTypeBP) == 0x000001, "Wrong alignment on W_Research_RewardClaimedWidget_C_SetRewardTypeBP");
static_assert(sizeof(W_Research_RewardClaimedWidget_C_SetRewardTypeBP) == 0x000001, "Wrong size on W_Research_RewardClaimedWidget_C_SetRewardTypeBP");
static_assert(offsetof(W_Research_RewardClaimedWidget_C_SetRewardTypeBP, InRewardType) == 0x000000, "Member 'W_Research_RewardClaimedWidget_C_SetRewardTypeBP::InRewardType' has a wrong offset!");

// Function W_Research_RewardClaimedWidget.W_Research_RewardClaimedWidget_C.SetRewardBaseBP
// 0x0008 (0x0008 - 0x0000)
struct W_Research_RewardClaimedWidget_C_SetRewardBaseBP final
{
public:
	class UP2ResearchNodeRewardBase*              InRewardBase;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_RewardClaimedWidget_C_SetRewardBaseBP) == 0x000008, "Wrong alignment on W_Research_RewardClaimedWidget_C_SetRewardBaseBP");
static_assert(sizeof(W_Research_RewardClaimedWidget_C_SetRewardBaseBP) == 0x000008, "Wrong size on W_Research_RewardClaimedWidget_C_SetRewardBaseBP");
static_assert(offsetof(W_Research_RewardClaimedWidget_C_SetRewardBaseBP, InRewardBase) == 0x000000, "Member 'W_Research_RewardClaimedWidget_C_SetRewardBaseBP::InRewardBase' has a wrong offset!");

// Function W_Research_RewardClaimedWidget.W_Research_RewardClaimedWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Research_RewardClaimedWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_RewardClaimedWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Research_RewardClaimedWidget_C_PreConstruct");
static_assert(sizeof(W_Research_RewardClaimedWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Research_RewardClaimedWidget_C_PreConstruct");
static_assert(offsetof(W_Research_RewardClaimedWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Research_RewardClaimedWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Research_RewardClaimedWidget.W_Research_RewardClaimedWidget_C.ExecuteUbergraph_W_Research_RewardClaimedWidget
// 0x00A0 (0x00A0 - 0x0000)
struct W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ResearchRewardType                         K2Node_Event_InRewardType;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2ResearchNodeRewardBase*              K2Node_Event_InRewardBase;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ResearchReward_SalvageRecipies_C*   K2Node_DynamicCast_AsBP_Research_Reward_Salvage_Recipies; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ResearchReward_CraftRecipies_C*     K2Node_DynamicCast_AsBP_Research_Reward_Craft_Recipies; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController_Hideout*            K2Node_DynamicCast_AsP2Player_Controller_Hideout;  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2PlayerController_Hideout*            K2Node_DynamicCast_AsP2Player_Controller_Hideout_1; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FP2ExchangeDataInfo>            CallFunc_GetProductionRecipesById_OutProductionRecipes; // 0x0068(0x0010)(ReferenceParm)
	TArray<struct FP2ExchangeDataInfo>            CallFunc_GetProductionRecipesById_OutProductionRecipes_1; // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_GetRewardTypeTextBP_ReturnValue;          // 0x0088(0x0018)()
};
static_assert(alignof(W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget) == 0x000008, "Wrong alignment on W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget");
static_assert(sizeof(W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget) == 0x0000A0, "Wrong size on W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget");
static_assert(offsetof(W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget, EntryPoint) == 0x000000, "Member 'W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget, K2Node_Event_InRewardType) == 0x000004, "Member 'W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget::K2Node_Event_InRewardType' has a wrong offset!");
static_assert(offsetof(W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget, K2Node_Event_InRewardBase) == 0x000008, "Member 'W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget::K2Node_Event_InRewardBase' has a wrong offset!");
static_assert(offsetof(W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget, K2Node_DynamicCast_AsBP_Research_Reward_Salvage_Recipies) == 0x000018, "Member 'W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget::K2Node_DynamicCast_AsBP_Research_Reward_Salvage_Recipies' has a wrong offset!");
static_assert(offsetof(W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget, K2Node_DynamicCast_AsBP_Research_Reward_Craft_Recipies) == 0x000028, "Member 'W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget::K2Node_DynamicCast_AsBP_Research_Reward_Craft_Recipies' has a wrong offset!");
static_assert(offsetof(W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget, K2Node_Event_IsDesignTime) == 0x000031, "Member 'W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget, K2Node_SwitchEnum_CmpSuccess_1) == 0x000032, "Member 'W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000040, "Member 'W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget, K2Node_DynamicCast_AsP2Player_Controller_Hideout) == 0x000048, "Member 'W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget::K2Node_DynamicCast_AsP2Player_Controller_Hideout' has a wrong offset!");
static_assert(offsetof(W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget, K2Node_DynamicCast_AsP2Player_Controller_Hideout_1) == 0x000058, "Member 'W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget::K2Node_DynamicCast_AsP2Player_Controller_Hideout_1' has a wrong offset!");
static_assert(offsetof(W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget, K2Node_DynamicCast_bSuccess_3) == 0x000060, "Member 'W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget, CallFunc_GetProductionRecipesById_OutProductionRecipes) == 0x000068, "Member 'W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget::CallFunc_GetProductionRecipesById_OutProductionRecipes' has a wrong offset!");
static_assert(offsetof(W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget, CallFunc_GetProductionRecipesById_OutProductionRecipes_1) == 0x000078, "Member 'W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget::CallFunc_GetProductionRecipesById_OutProductionRecipes_1' has a wrong offset!");
static_assert(offsetof(W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget, CallFunc_GetRewardTypeTextBP_ReturnValue) == 0x000088, "Member 'W_Research_RewardClaimedWidget_C_ExecuteUbergraph_W_Research_RewardClaimedWidget::CallFunc_GetRewardTypeTextBP_ReturnValue' has a wrong offset!");

}

