#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Research_ObjectiveWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Research_ObjectiveWidget.W_Research_ObjectiveWidget_C
// 0x00D8 (0x03B8 - 0x02E0)
class UW_Research_ObjectiveWidget_C final : public UP2ResearchObjectiveWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_ProgressWipe;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_TitleWipe;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Percent;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_RemainingTime;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         InProgressTimerFont;                               // 0x0308(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         CompleteTimerFont;                                 // 0x0360(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void SetResearchStepBP(const class UP2ResearchStep* InResearchStep)	 // 0xae1e64;
	void SetProgressTime(float InRemainingTime, float InProgressRatio)	 // 0xae1e64;
	void SetEstimatedTime(float InTime)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_Research_ObjectiveWidget(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Research_ObjectiveWidget_C">();
	}
	static class UW_Research_ObjectiveWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Research_ObjectiveWidget_C>();
	}
};
static_assert(alignof(UW_Research_ObjectiveWidget_C) == 0x000008, "Wrong alignment on UW_Research_ObjectiveWidget_C");
static_assert(sizeof(UW_Research_ObjectiveWidget_C) == 0x0003B8, "Wrong size on UW_Research_ObjectiveWidget_C");
static_assert(offsetof(UW_Research_ObjectiveWidget_C, UberGraphFrame) == 0x0002E0, "Member 'UW_Research_ObjectiveWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Research_ObjectiveWidget_C, Img_ProgressWipe) == 0x0002E8, "Member 'UW_Research_ObjectiveWidget_C::Img_ProgressWipe' has a wrong offset!");
static_assert(offsetof(UW_Research_ObjectiveWidget_C, Img_TitleWipe) == 0x0002F0, "Member 'UW_Research_ObjectiveWidget_C::Img_TitleWipe' has a wrong offset!");
static_assert(offsetof(UW_Research_ObjectiveWidget_C, Txt_Percent) == 0x0002F8, "Member 'UW_Research_ObjectiveWidget_C::Txt_Percent' has a wrong offset!");
static_assert(offsetof(UW_Research_ObjectiveWidget_C, Txt_RemainingTime) == 0x000300, "Member 'UW_Research_ObjectiveWidget_C::Txt_RemainingTime' has a wrong offset!");
static_assert(offsetof(UW_Research_ObjectiveWidget_C, InProgressTimerFont) == 0x000308, "Member 'UW_Research_ObjectiveWidget_C::InProgressTimerFont' has a wrong offset!");
static_assert(offsetof(UW_Research_ObjectiveWidget_C, CompleteTimerFont) == 0x000360, "Member 'UW_Research_ObjectiveWidget_C::CompleteTimerFont' has a wrong offset!");

}

