#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Research_SlotWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Research_SlotWidget.W_Research_SlotWidget_C
// 0x0038 (0x02E8 - 0x02B0)
class UW_Research_SlotWidget_C final : public UP2ResearchSlotWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CompleteLoopAnim;                                  // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Bdr_LockedPattern;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_ResearchSlotOutline;                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Empty;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_InProgressIcon;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetSlotStateBP(const EP2ResearchSlotState InState)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_Research_SlotWidget(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Research_SlotWidget_C">();
	}
	static class UW_Research_SlotWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Research_SlotWidget_C>();
	}
};
static_assert(alignof(UW_Research_SlotWidget_C) == 0x000008, "Wrong alignment on UW_Research_SlotWidget_C");
static_assert(sizeof(UW_Research_SlotWidget_C) == 0x0002E8, "Wrong size on UW_Research_SlotWidget_C");
static_assert(offsetof(UW_Research_SlotWidget_C, UberGraphFrame) == 0x0002B0, "Member 'UW_Research_SlotWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Research_SlotWidget_C, CompleteLoopAnim) == 0x0002B8, "Member 'UW_Research_SlotWidget_C::CompleteLoopAnim' has a wrong offset!");
static_assert(offsetof(UW_Research_SlotWidget_C, FadeInAnim) == 0x0002C0, "Member 'UW_Research_SlotWidget_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UW_Research_SlotWidget_C, Bdr_LockedPattern) == 0x0002C8, "Member 'UW_Research_SlotWidget_C::Bdr_LockedPattern' has a wrong offset!");
static_assert(offsetof(UW_Research_SlotWidget_C, Bdr_ResearchSlotOutline) == 0x0002D0, "Member 'UW_Research_SlotWidget_C::Bdr_ResearchSlotOutline' has a wrong offset!");
static_assert(offsetof(UW_Research_SlotWidget_C, Img_Empty) == 0x0002D8, "Member 'UW_Research_SlotWidget_C::Img_Empty' has a wrong offset!");
static_assert(offsetof(UW_Research_SlotWidget_C, Img_InProgressIcon) == 0x0002E0, "Member 'UW_Research_SlotWidget_C::Img_InProgressIcon' has a wrong offset!");

}

