#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Research_NodeWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Research_NodeWidget.W_Research_NodeWidget_C
// 0x0030 (0x0710 - 0x06E0)
class UW_Research_NodeWidget_C final : public UP2ResearchNodeWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_UnlockedState;                                 // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_RewardWidget_C*             W_Research_RewardWidget;                           // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_RewardWidget_C*             W_Research_RewardWidget_1;                         // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_RewardWidget_C*             W_Research_RewardWidget_2;                         // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_RewardWidget_C*             W_Research_RewardWidget_3;                         // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetSelectedBP(bool bInSelected)	 // 0xae1e64;
	void SetNodeWidgetStateBP(EP2ResearchNodeWidgetState InNodeWidgetState)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_Research_NodeWidget(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Research_NodeWidget_C">();
	}
	static class UW_Research_NodeWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Research_NodeWidget_C>();
	}
};
static_assert(alignof(UW_Research_NodeWidget_C) == 0x000008, "Wrong alignment on UW_Research_NodeWidget_C");
static_assert(sizeof(UW_Research_NodeWidget_C) == 0x000710, "Wrong size on UW_Research_NodeWidget_C");
static_assert(offsetof(UW_Research_NodeWidget_C, UberGraphFrame) == 0x0006E0, "Member 'UW_Research_NodeWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Research_NodeWidget_C, Img_UnlockedState) == 0x0006E8, "Member 'UW_Research_NodeWidget_C::Img_UnlockedState' has a wrong offset!");
static_assert(offsetof(UW_Research_NodeWidget_C, W_Research_RewardWidget) == 0x0006F0, "Member 'UW_Research_NodeWidget_C::W_Research_RewardWidget' has a wrong offset!");
static_assert(offsetof(UW_Research_NodeWidget_C, W_Research_RewardWidget_1) == 0x0006F8, "Member 'UW_Research_NodeWidget_C::W_Research_RewardWidget_1' has a wrong offset!");
static_assert(offsetof(UW_Research_NodeWidget_C, W_Research_RewardWidget_2) == 0x000700, "Member 'UW_Research_NodeWidget_C::W_Research_RewardWidget_2' has a wrong offset!");
static_assert(offsetof(UW_Research_NodeWidget_C, W_Research_RewardWidget_3) == 0x000708, "Member 'UW_Research_NodeWidget_C::W_Research_RewardWidget_3' has a wrong offset!");

}

