#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Research_SlotWidget

#include "Basic.hpp"

#include "Hideout_structs.hpp"


namespace SDK::Params
{

// Function W_Research_SlotWidget.W_Research_SlotWidget_C.SetSlotStateBP
// 0x0001 (0x0001 - 0x0000)
struct W_Research_SlotWidget_C_SetSlotStateBP final
{
public:
	EP2ResearchSlotState                          InState;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_SlotWidget_C_SetSlotStateBP) == 0x000001, "Wrong alignment on W_Research_SlotWidget_C_SetSlotStateBP");
static_assert(sizeof(W_Research_SlotWidget_C_SetSlotStateBP) == 0x000001, "Wrong size on W_Research_SlotWidget_C_SetSlotStateBP");
static_assert(offsetof(W_Research_SlotWidget_C_SetSlotStateBP, InState) == 0x000000, "Member 'W_Research_SlotWidget_C_SetSlotStateBP::InState' has a wrong offset!");

// Function W_Research_SlotWidget.W_Research_SlotWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Research_SlotWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_SlotWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Research_SlotWidget_C_PreConstruct");
static_assert(sizeof(W_Research_SlotWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Research_SlotWidget_C_PreConstruct");
static_assert(offsetof(W_Research_SlotWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Research_SlotWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Research_SlotWidget.W_Research_SlotWidget_C.ExecuteUbergraph_W_Research_SlotWidget
// 0x0008 (0x0008 - 0x0000)
struct W_Research_SlotWidget_C_ExecuteUbergraph_W_Research_SlotWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ResearchSlotState                          K2Node_Event_InState;                              // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_SlotWidget_C_ExecuteUbergraph_W_Research_SlotWidget) == 0x000004, "Wrong alignment on W_Research_SlotWidget_C_ExecuteUbergraph_W_Research_SlotWidget");
static_assert(sizeof(W_Research_SlotWidget_C_ExecuteUbergraph_W_Research_SlotWidget) == 0x000008, "Wrong size on W_Research_SlotWidget_C_ExecuteUbergraph_W_Research_SlotWidget");
static_assert(offsetof(W_Research_SlotWidget_C_ExecuteUbergraph_W_Research_SlotWidget, EntryPoint) == 0x000000, "Member 'W_Research_SlotWidget_C_ExecuteUbergraph_W_Research_SlotWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Research_SlotWidget_C_ExecuteUbergraph_W_Research_SlotWidget, K2Node_Event_InState) == 0x000004, "Member 'W_Research_SlotWidget_C_ExecuteUbergraph_W_Research_SlotWidget::K2Node_Event_InState' has a wrong offset!");
static_assert(offsetof(W_Research_SlotWidget_C_ExecuteUbergraph_W_Research_SlotWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'W_Research_SlotWidget_C_ExecuteUbergraph_W_Research_SlotWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_Research_SlotWidget_C_ExecuteUbergraph_W_Research_SlotWidget, K2Node_Event_IsDesignTime) == 0x000006, "Member 'W_Research_SlotWidget_C_ExecuteUbergraph_W_Research_SlotWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

}

