#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RestockTooltipWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_RestockTooltipWidget.W_RestockTooltipWidget_C
// 0x0040 (0x0338 - 0x02F8)
class UW_RestockTooltipWidget_C final : public UP2RestockTooltipWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Divider;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_GradeColorGradient;                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ItemGrade;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_RemainingTime;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Restock;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_WishlistIcon;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    KeyguideWidget;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_RestockTooltipWidget(int32 EntryPoint)	 // 0xae1e64;
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_RestockTooltipWidget_C">();
	}
	static class UW_RestockTooltipWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_RestockTooltipWidget_C>();
	}
};
static_assert(alignof(UW_RestockTooltipWidget_C) == 0x000008, "Wrong alignment on UW_RestockTooltipWidget_C");
static_assert(sizeof(UW_RestockTooltipWidget_C) == 0x000338, "Wrong size on UW_RestockTooltipWidget_C");
static_assert(offsetof(UW_RestockTooltipWidget_C, UberGraphFrame) == 0x0002F8, "Member 'UW_RestockTooltipWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_RestockTooltipWidget_C, Img_Divider) == 0x000300, "Member 'UW_RestockTooltipWidget_C::Img_Divider' has a wrong offset!");
static_assert(offsetof(UW_RestockTooltipWidget_C, Img_GradeColorGradient) == 0x000308, "Member 'UW_RestockTooltipWidget_C::Img_GradeColorGradient' has a wrong offset!");
static_assert(offsetof(UW_RestockTooltipWidget_C, Img_ItemGrade) == 0x000310, "Member 'UW_RestockTooltipWidget_C::Img_ItemGrade' has a wrong offset!");
static_assert(offsetof(UW_RestockTooltipWidget_C, Img_RemainingTime) == 0x000318, "Member 'UW_RestockTooltipWidget_C::Img_RemainingTime' has a wrong offset!");
static_assert(offsetof(UW_RestockTooltipWidget_C, Img_Restock) == 0x000320, "Member 'UW_RestockTooltipWidget_C::Img_Restock' has a wrong offset!");
static_assert(offsetof(UW_RestockTooltipWidget_C, Img_WishlistIcon) == 0x000328, "Member 'UW_RestockTooltipWidget_C::Img_WishlistIcon' has a wrong offset!");
static_assert(offsetof(UW_RestockTooltipWidget_C, KeyguideWidget) == 0x000330, "Member 'UW_RestockTooltipWidget_C::KeyguideWidget' has a wrong offset!");

}

