#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Research_DetailWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Research_DetailWidget.W_Research_DetailWidget_C
// 0x0058 (0x0440 - 0x03E8)
class UW_Research_DetailWidget_C final : public UP2ResearchDetailWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_CompletedWipe;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Rep_FactionIcon;                               // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_FindNodeBtn;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_LockedMsg;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_RepValue;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_XpValue;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_RewardClaimedWidget_C*      W_Research_RewardClaimedWidget;                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_RewardClaimedWidget_C*      W_Research_RewardClaimedWidget_1;                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_RewardClaimedWidget_C*      W_Research_RewardClaimedWidget_2;                  // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_RewardClaimedWidget_C*      W_Research_RewardClaimedWidget_3;                  // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime)	 // 0xae1e64;
	void SetXpReward(int32 InXpValue)	 // 0xae1e64;
	void SetFactionRepReward(const struct FGameplayTag& InFactionTag, int32 InRepValue)	 // 0xae1e64;
	void RefreshDimedMessage(bool bFullLocked)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_Research_DetailWidget(int32 EntryPoint)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void BndEvt__W_Research_DetailWidget_Btn_RewardToggleBtn_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_Research_DetailWidget_Btn_RewardToggleBtn_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Research_DetailWidget_C">();
	}
	static class UW_Research_DetailWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Research_DetailWidget_C>();
	}
};
static_assert(alignof(UW_Research_DetailWidget_C) == 0x000008, "Wrong alignment on UW_Research_DetailWidget_C");
static_assert(sizeof(UW_Research_DetailWidget_C) == 0x000440, "Wrong size on UW_Research_DetailWidget_C");
static_assert(offsetof(UW_Research_DetailWidget_C, UberGraphFrame) == 0x0003E8, "Member 'UW_Research_DetailWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Research_DetailWidget_C, Img_CompletedWipe) == 0x0003F0, "Member 'UW_Research_DetailWidget_C::Img_CompletedWipe' has a wrong offset!");
static_assert(offsetof(UW_Research_DetailWidget_C, Img_Rep_FactionIcon) == 0x0003F8, "Member 'UW_Research_DetailWidget_C::Img_Rep_FactionIcon' has a wrong offset!");
static_assert(offsetof(UW_Research_DetailWidget_C, Txt_FindNodeBtn) == 0x000400, "Member 'UW_Research_DetailWidget_C::Txt_FindNodeBtn' has a wrong offset!");
static_assert(offsetof(UW_Research_DetailWidget_C, Txt_LockedMsg) == 0x000408, "Member 'UW_Research_DetailWidget_C::Txt_LockedMsg' has a wrong offset!");
static_assert(offsetof(UW_Research_DetailWidget_C, Txt_RepValue) == 0x000410, "Member 'UW_Research_DetailWidget_C::Txt_RepValue' has a wrong offset!");
static_assert(offsetof(UW_Research_DetailWidget_C, Txt_XpValue) == 0x000418, "Member 'UW_Research_DetailWidget_C::Txt_XpValue' has a wrong offset!");
static_assert(offsetof(UW_Research_DetailWidget_C, W_Research_RewardClaimedWidget) == 0x000420, "Member 'UW_Research_DetailWidget_C::W_Research_RewardClaimedWidget' has a wrong offset!");
static_assert(offsetof(UW_Research_DetailWidget_C, W_Research_RewardClaimedWidget_1) == 0x000428, "Member 'UW_Research_DetailWidget_C::W_Research_RewardClaimedWidget_1' has a wrong offset!");
static_assert(offsetof(UW_Research_DetailWidget_C, W_Research_RewardClaimedWidget_2) == 0x000430, "Member 'UW_Research_DetailWidget_C::W_Research_RewardClaimedWidget_2' has a wrong offset!");
static_assert(offsetof(UW_Research_DetailWidget_C, W_Research_RewardClaimedWidget_3) == 0x000438, "Member 'UW_Research_DetailWidget_C::W_Research_RewardClaimedWidget_3' has a wrong offset!");

}

