#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Research_MainWidget

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Research_MainWidget.W_Research_MainWidget_C
// 0x00F8 (0x0718 - 0x0620)
class UW_Research_MainWidget_C final : public UP2ResearchMainWidget
{
public:
	class UImage*                                 Img_Title_Line;                                    // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_FacilityTitle;                                 // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Botany_Bot_C*       W_Research_Cluster_Botany_Bot;                     // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Botany_Plants_C*    W_Research_Cluster_Botany_Plants;                  // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Engineering_Electronics_C* W_Research_Cluster_Engineering_Electronics; // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Engineering_Energy_C* W_Research_Cluster_Engineering_Energy;           // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Engineering_Hydraulics_C* W_Research_Cluster_Engineering_Hydraulics;   // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Imm_Immunology_C*   W_Research_Cluster_Imm_Immunology;                 // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Imm_Phys_C*         W_Research_Cluster_Imm_Phys;                       // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Imm_Recovery_C*     W_Research_Cluster_Imm_Recovery;                   // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Imm_Trauma_C*       W_Research_Cluster_Imm_Trauma;                     // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Materials_Engineering_C* W_Research_Cluster_Materials_Engineering;     // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Materials_Exotic_C* W_Research_Cluster_Materials_Exotic;               // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Military_Optics_C*  W_Research_Cluster_Military_Optics;                // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Npc_Brutes_C*       W_Research_Cluster_Npc_Brutes;                     // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Npc_Bugs_C*         W_Research_Cluster_Npc_Bugs;                       // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Npc_Cats_C*         W_Research_Cluster_Npc_Cats;                       // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Npc_Crocs_C*        W_Research_Cluster_Npc_Crocs;                      // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Npc_Jacs_C*         W_Research_Cluster_Npc_Jacs;                       // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Npc_Psyches_C*      W_Research_Cluster_Npc_Psyches;                    // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Npc_Rasslers_C*     W_Research_Cluster_Npc_Rasslers;                   // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_SapiensProjects_BeamRifle_C* W_Research_Cluster_SapiensProjects_BeamRifle; // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_SapiensProjects_Bioarmor_C* W_Research_Cluster_SapiensProjects_Bioarmor; // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_SapiensProjects_LAPS_C* W_Research_Cluster_SapiensProjects_LAPS;       // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_SapiensProjects_WaveGrenade_C* W_Research_Cluster_SapiensProjects_WaveGrenade; // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Utilities_Drone_C*  W_Research_Cluster_Utilities_Drone;                // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Utilities_Security_C* W_Research_Cluster_Utilities_Security;           // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Weapons_Ballistics_C* W_Research_Cluster_Weapons_Ballistics;           // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Weapons_Ergonomics_C* W_Research_Cluster_Weapons_Ergonomics;           // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Weapons_Protection_C* W_Research_Cluster_Weapons_Protection;           // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_Cluster_Weapons_WeaponControl_C* W_Research_Cluster_Weapons_WeaponControl;     // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Research_MainWidget_C">();
	}
	static class UW_Research_MainWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Research_MainWidget_C>();
	}
};
static_assert(alignof(UW_Research_MainWidget_C) == 0x000008, "Wrong alignment on UW_Research_MainWidget_C");
static_assert(sizeof(UW_Research_MainWidget_C) == 0x000718, "Wrong size on UW_Research_MainWidget_C");
static_assert(offsetof(UW_Research_MainWidget_C, Img_Title_Line) == 0x000620, "Member 'UW_Research_MainWidget_C::Img_Title_Line' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, Txt_FacilityTitle) == 0x000628, "Member 'UW_Research_MainWidget_C::Txt_FacilityTitle' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Botany_Bot) == 0x000630, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Botany_Bot' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Botany_Plants) == 0x000638, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Botany_Plants' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Engineering_Electronics) == 0x000640, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Engineering_Electronics' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Engineering_Energy) == 0x000648, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Engineering_Energy' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Engineering_Hydraulics) == 0x000650, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Engineering_Hydraulics' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Imm_Immunology) == 0x000658, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Imm_Immunology' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Imm_Phys) == 0x000660, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Imm_Phys' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Imm_Recovery) == 0x000668, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Imm_Recovery' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Imm_Trauma) == 0x000670, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Imm_Trauma' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Materials_Engineering) == 0x000678, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Materials_Engineering' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Materials_Exotic) == 0x000680, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Materials_Exotic' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Military_Optics) == 0x000688, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Military_Optics' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Npc_Brutes) == 0x000690, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Npc_Brutes' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Npc_Bugs) == 0x000698, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Npc_Bugs' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Npc_Cats) == 0x0006A0, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Npc_Cats' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Npc_Crocs) == 0x0006A8, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Npc_Crocs' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Npc_Jacs) == 0x0006B0, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Npc_Jacs' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Npc_Psyches) == 0x0006B8, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Npc_Psyches' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Npc_Rasslers) == 0x0006C0, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Npc_Rasslers' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_SapiensProjects_BeamRifle) == 0x0006C8, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_SapiensProjects_BeamRifle' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_SapiensProjects_Bioarmor) == 0x0006D0, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_SapiensProjects_Bioarmor' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_SapiensProjects_LAPS) == 0x0006D8, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_SapiensProjects_LAPS' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_SapiensProjects_WaveGrenade) == 0x0006E0, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_SapiensProjects_WaveGrenade' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Utilities_Drone) == 0x0006E8, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Utilities_Drone' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Utilities_Security) == 0x0006F0, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Utilities_Security' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Weapons_Ballistics) == 0x0006F8, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Weapons_Ballistics' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Weapons_Ergonomics) == 0x000700, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Weapons_Ergonomics' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Weapons_Protection) == 0x000708, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Weapons_Protection' has a wrong offset!");
static_assert(offsetof(UW_Research_MainWidget_C, W_Research_Cluster_Weapons_WeaponControl) == 0x000710, "Member 'UW_Research_MainWidget_C::W_Research_Cluster_Weapons_WeaponControl' has a wrong offset!");

}

