#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Research_RewardWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"
#include "Game_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Research_RewardWidget.W_Research_RewardWidget_C
// 0x0188 (0x05A0 - 0x0418)
class UW_Research_RewardWidget_C final : public UP2ResearchRewardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_GradientOverlay;                               // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_RewardGroupBg;                                 // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SkinIcon;                                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              SclB_RewardUnlock;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         GroupCountFontSmall;                               // 0x0440(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         GroupCountFontNormal;                              // 0x0498(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         OutfittingLvlFontSmall;                            // 0x04F0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         OutfittingLvlFontNormal;                           // 0x0548(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void SetSelected(bool bInIsSelected)	 // 0xae1e64;
	void SetRewardTypeBP(class UP2ResearchNodeRewardBase* InRewardBase)	 // 0xae1e64;
	void SetRewardSize(bool bInSmallSize)	 // 0xae1e64;
	void SetCompleted(bool bInIsCompleted)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void MakeRewardTooltipTextsCraftingRecipeBP(EP2ResearchRewardType InRewardType, const class FText& InFacilityName, const class FText& InRecipeName, int32 InRequiredLevel)	 // 0xae1e64;
	void MakeRewardTooltipTextsClothingUpgradeBP(const struct FP2ResearchClothingUpgradeDisplayInfo& InUpgradeInfo)	 // 0xae1e64;
	void MakeRewardTooltipTextsBP(class UP2ResearchNodeRewardBase* InRewardBase)	 // 0xae1e64;
	class FText GetRewardTypeTextBP(EP2ResearchRewardType InRewardType)	 // 0xae1e64;
	void ExecuteUbergraph_W_Research_RewardWidget(int32 EntryPoint)	 // 0xae1e64;
	void AdjustRewardLayout(EP2ResearchRewardType InRewardType)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Research_RewardWidget_C">();
	}
	static class UW_Research_RewardWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Research_RewardWidget_C>();
	}
};
static_assert(alignof(UW_Research_RewardWidget_C) == 0x000008, "Wrong alignment on UW_Research_RewardWidget_C");
static_assert(sizeof(UW_Research_RewardWidget_C) == 0x0005A0, "Wrong size on UW_Research_RewardWidget_C");
static_assert(offsetof(UW_Research_RewardWidget_C, UberGraphFrame) == 0x000418, "Member 'UW_Research_RewardWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Research_RewardWidget_C, Img_GradientOverlay) == 0x000420, "Member 'UW_Research_RewardWidget_C::Img_GradientOverlay' has a wrong offset!");
static_assert(offsetof(UW_Research_RewardWidget_C, Img_RewardGroupBg) == 0x000428, "Member 'UW_Research_RewardWidget_C::Img_RewardGroupBg' has a wrong offset!");
static_assert(offsetof(UW_Research_RewardWidget_C, Img_SkinIcon) == 0x000430, "Member 'UW_Research_RewardWidget_C::Img_SkinIcon' has a wrong offset!");
static_assert(offsetof(UW_Research_RewardWidget_C, SclB_RewardUnlock) == 0x000438, "Member 'UW_Research_RewardWidget_C::SclB_RewardUnlock' has a wrong offset!");
static_assert(offsetof(UW_Research_RewardWidget_C, GroupCountFontSmall) == 0x000440, "Member 'UW_Research_RewardWidget_C::GroupCountFontSmall' has a wrong offset!");
static_assert(offsetof(UW_Research_RewardWidget_C, GroupCountFontNormal) == 0x000498, "Member 'UW_Research_RewardWidget_C::GroupCountFontNormal' has a wrong offset!");
static_assert(offsetof(UW_Research_RewardWidget_C, OutfittingLvlFontSmall) == 0x0004F0, "Member 'UW_Research_RewardWidget_C::OutfittingLvlFontSmall' has a wrong offset!");
static_assert(offsetof(UW_Research_RewardWidget_C, OutfittingLvlFontNormal) == 0x000548, "Member 'UW_Research_RewardWidget_C::OutfittingLvlFontNormal' has a wrong offset!");

}

