#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Research_RewardWidget

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Hideout_structs.hpp"


namespace SDK::Params
{

// Function W_Research_RewardWidget.W_Research_RewardWidget_C.SetSelected
// 0x0001 (0x0001 - 0x0000)
struct W_Research_RewardWidget_C_SetSelected final
{
public:
	bool                                          bInIsSelected;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_RewardWidget_C_SetSelected) == 0x000001, "Wrong alignment on W_Research_RewardWidget_C_SetSelected");
static_assert(sizeof(W_Research_RewardWidget_C_SetSelected) == 0x000001, "Wrong size on W_Research_RewardWidget_C_SetSelected");
static_assert(offsetof(W_Research_RewardWidget_C_SetSelected, bInIsSelected) == 0x000000, "Member 'W_Research_RewardWidget_C_SetSelected::bInIsSelected' has a wrong offset!");

// Function W_Research_RewardWidget.W_Research_RewardWidget_C.SetRewardTypeBP
// 0x0008 (0x0008 - 0x0000)
struct W_Research_RewardWidget_C_SetRewardTypeBP final
{
public:
	class UP2ResearchNodeRewardBase*              InRewardBase;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_RewardWidget_C_SetRewardTypeBP) == 0x000008, "Wrong alignment on W_Research_RewardWidget_C_SetRewardTypeBP");
static_assert(sizeof(W_Research_RewardWidget_C_SetRewardTypeBP) == 0x000008, "Wrong size on W_Research_RewardWidget_C_SetRewardTypeBP");
static_assert(offsetof(W_Research_RewardWidget_C_SetRewardTypeBP, InRewardBase) == 0x000000, "Member 'W_Research_RewardWidget_C_SetRewardTypeBP::InRewardBase' has a wrong offset!");

// Function W_Research_RewardWidget.W_Research_RewardWidget_C.SetRewardSize
// 0x0001 (0x0001 - 0x0000)
struct W_Research_RewardWidget_C_SetRewardSize final
{
public:
	bool                                          bInSmallSize;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_RewardWidget_C_SetRewardSize) == 0x000001, "Wrong alignment on W_Research_RewardWidget_C_SetRewardSize");
static_assert(sizeof(W_Research_RewardWidget_C_SetRewardSize) == 0x000001, "Wrong size on W_Research_RewardWidget_C_SetRewardSize");
static_assert(offsetof(W_Research_RewardWidget_C_SetRewardSize, bInSmallSize) == 0x000000, "Member 'W_Research_RewardWidget_C_SetRewardSize::bInSmallSize' has a wrong offset!");

// Function W_Research_RewardWidget.W_Research_RewardWidget_C.SetCompleted
// 0x0001 (0x0001 - 0x0000)
struct W_Research_RewardWidget_C_SetCompleted final
{
public:
	bool                                          bInIsCompleted;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_RewardWidget_C_SetCompleted) == 0x000001, "Wrong alignment on W_Research_RewardWidget_C_SetCompleted");
static_assert(sizeof(W_Research_RewardWidget_C_SetCompleted) == 0x000001, "Wrong size on W_Research_RewardWidget_C_SetCompleted");
static_assert(offsetof(W_Research_RewardWidget_C_SetCompleted, bInIsCompleted) == 0x000000, "Member 'W_Research_RewardWidget_C_SetCompleted::bInIsCompleted' has a wrong offset!");

// Function W_Research_RewardWidget.W_Research_RewardWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Research_RewardWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_RewardWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Research_RewardWidget_C_PreConstruct");
static_assert(sizeof(W_Research_RewardWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Research_RewardWidget_C_PreConstruct");
static_assert(offsetof(W_Research_RewardWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Research_RewardWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Research_RewardWidget.W_Research_RewardWidget_C.MakeRewardTooltipTextsCraftingRecipeBP
// 0x0040 (0x0040 - 0x0000)
struct W_Research_RewardWidget_C_MakeRewardTooltipTextsCraftingRecipeBP final
{
public:
	EP2ResearchRewardType                         InRewardType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   InFacilityName;                                    // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   InRecipeName;                                      // 0x0020(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         InRequiredLevel;                                   // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_RewardWidget_C_MakeRewardTooltipTextsCraftingRecipeBP) == 0x000008, "Wrong alignment on W_Research_RewardWidget_C_MakeRewardTooltipTextsCraftingRecipeBP");
static_assert(sizeof(W_Research_RewardWidget_C_MakeRewardTooltipTextsCraftingRecipeBP) == 0x000040, "Wrong size on W_Research_RewardWidget_C_MakeRewardTooltipTextsCraftingRecipeBP");
static_assert(offsetof(W_Research_RewardWidget_C_MakeRewardTooltipTextsCraftingRecipeBP, InRewardType) == 0x000000, "Member 'W_Research_RewardWidget_C_MakeRewardTooltipTextsCraftingRecipeBP::InRewardType' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_MakeRewardTooltipTextsCraftingRecipeBP, InFacilityName) == 0x000008, "Member 'W_Research_RewardWidget_C_MakeRewardTooltipTextsCraftingRecipeBP::InFacilityName' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_MakeRewardTooltipTextsCraftingRecipeBP, InRecipeName) == 0x000020, "Member 'W_Research_RewardWidget_C_MakeRewardTooltipTextsCraftingRecipeBP::InRecipeName' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_MakeRewardTooltipTextsCraftingRecipeBP, InRequiredLevel) == 0x000038, "Member 'W_Research_RewardWidget_C_MakeRewardTooltipTextsCraftingRecipeBP::InRequiredLevel' has a wrong offset!");

// Function W_Research_RewardWidget.W_Research_RewardWidget_C.MakeRewardTooltipTextsClothingUpgradeBP
// 0x0050 (0x0050 - 0x0000)
struct W_Research_RewardWidget_C_MakeRewardTooltipTextsClothingUpgradeBP final
{
public:
	struct FP2ResearchClothingUpgradeDisplayInfo  InUpgradeInfo;                                     // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_Research_RewardWidget_C_MakeRewardTooltipTextsClothingUpgradeBP) == 0x000008, "Wrong alignment on W_Research_RewardWidget_C_MakeRewardTooltipTextsClothingUpgradeBP");
static_assert(sizeof(W_Research_RewardWidget_C_MakeRewardTooltipTextsClothingUpgradeBP) == 0x000050, "Wrong size on W_Research_RewardWidget_C_MakeRewardTooltipTextsClothingUpgradeBP");
static_assert(offsetof(W_Research_RewardWidget_C_MakeRewardTooltipTextsClothingUpgradeBP, InUpgradeInfo) == 0x000000, "Member 'W_Research_RewardWidget_C_MakeRewardTooltipTextsClothingUpgradeBP::InUpgradeInfo' has a wrong offset!");

// Function W_Research_RewardWidget.W_Research_RewardWidget_C.MakeRewardTooltipTextsBP
// 0x0008 (0x0008 - 0x0000)
struct W_Research_RewardWidget_C_MakeRewardTooltipTextsBP final
{
public:
	class UP2ResearchNodeRewardBase*              InRewardBase;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_RewardWidget_C_MakeRewardTooltipTextsBP) == 0x000008, "Wrong alignment on W_Research_RewardWidget_C_MakeRewardTooltipTextsBP");
static_assert(sizeof(W_Research_RewardWidget_C_MakeRewardTooltipTextsBP) == 0x000008, "Wrong size on W_Research_RewardWidget_C_MakeRewardTooltipTextsBP");
static_assert(offsetof(W_Research_RewardWidget_C_MakeRewardTooltipTextsBP, InRewardBase) == 0x000000, "Member 'W_Research_RewardWidget_C_MakeRewardTooltipTextsBP::InRewardBase' has a wrong offset!");

// Function W_Research_RewardWidget.W_Research_RewardWidget_C.GetRewardTypeTextBP
// 0x0160 (0x0160 - 0x0000)
struct W_Research_RewardWidget_C_GetRewardTypeTextBP final
{
public:
	EP2ResearchRewardType                         InRewardType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
	EP2ResearchRewardType                         NewLocalVar;                                       // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ResearchRewardType                         Temp_byte_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0028(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0040(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0058(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0070(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0088(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x00A0(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x00B8(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x00D0(0x0018)()
	class FText                                   Temp_text_Variable_8;                              // 0x00E8(0x0018)()
	class FText                                   Temp_text_Variable_9;                              // 0x0100(0x0018)()
	class FText                                   Temp_text_Variable_10;                             // 0x0118(0x0018)()
	class FText                                   Temp_text_Variable_11;                             // 0x0130(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0148(0x0018)()
};
static_assert(alignof(W_Research_RewardWidget_C_GetRewardTypeTextBP) == 0x000008, "Wrong alignment on W_Research_RewardWidget_C_GetRewardTypeTextBP");
static_assert(sizeof(W_Research_RewardWidget_C_GetRewardTypeTextBP) == 0x000160, "Wrong size on W_Research_RewardWidget_C_GetRewardTypeTextBP");
static_assert(offsetof(W_Research_RewardWidget_C_GetRewardTypeTextBP, InRewardType) == 0x000000, "Member 'W_Research_RewardWidget_C_GetRewardTypeTextBP::InRewardType' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_GetRewardTypeTextBP, ReturnValue) == 0x000008, "Member 'W_Research_RewardWidget_C_GetRewardTypeTextBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_GetRewardTypeTextBP, NewLocalVar) == 0x000020, "Member 'W_Research_RewardWidget_C_GetRewardTypeTextBP::NewLocalVar' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_GetRewardTypeTextBP, Temp_byte_Variable) == 0x000021, "Member 'W_Research_RewardWidget_C_GetRewardTypeTextBP::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_GetRewardTypeTextBP, Temp_text_Variable) == 0x000028, "Member 'W_Research_RewardWidget_C_GetRewardTypeTextBP::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_GetRewardTypeTextBP, Temp_text_Variable_1) == 0x000040, "Member 'W_Research_RewardWidget_C_GetRewardTypeTextBP::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_GetRewardTypeTextBP, Temp_text_Variable_2) == 0x000058, "Member 'W_Research_RewardWidget_C_GetRewardTypeTextBP::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_GetRewardTypeTextBP, Temp_text_Variable_3) == 0x000070, "Member 'W_Research_RewardWidget_C_GetRewardTypeTextBP::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_GetRewardTypeTextBP, Temp_text_Variable_4) == 0x000088, "Member 'W_Research_RewardWidget_C_GetRewardTypeTextBP::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_GetRewardTypeTextBP, Temp_text_Variable_5) == 0x0000A0, "Member 'W_Research_RewardWidget_C_GetRewardTypeTextBP::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_GetRewardTypeTextBP, Temp_text_Variable_6) == 0x0000B8, "Member 'W_Research_RewardWidget_C_GetRewardTypeTextBP::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_GetRewardTypeTextBP, Temp_text_Variable_7) == 0x0000D0, "Member 'W_Research_RewardWidget_C_GetRewardTypeTextBP::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_GetRewardTypeTextBP, Temp_text_Variable_8) == 0x0000E8, "Member 'W_Research_RewardWidget_C_GetRewardTypeTextBP::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_GetRewardTypeTextBP, Temp_text_Variable_9) == 0x000100, "Member 'W_Research_RewardWidget_C_GetRewardTypeTextBP::Temp_text_Variable_9' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_GetRewardTypeTextBP, Temp_text_Variable_10) == 0x000118, "Member 'W_Research_RewardWidget_C_GetRewardTypeTextBP::Temp_text_Variable_10' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_GetRewardTypeTextBP, Temp_text_Variable_11) == 0x000130, "Member 'W_Research_RewardWidget_C_GetRewardTypeTextBP::Temp_text_Variable_11' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_GetRewardTypeTextBP, K2Node_Select_Default) == 0x000148, "Member 'W_Research_RewardWidget_C_GetRewardTypeTextBP::K2Node_Select_Default' has a wrong offset!");

// Function W_Research_RewardWidget.W_Research_RewardWidget_C.ExecuteUbergraph_W_Research_RewardWidget
// 0x09A0 (0x09A0 - 0x0000)
struct W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0030(0x0018)()
	EP2ResearchRewardType                         Temp_byte_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0080(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0098(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x00B0(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x00C8(0x0018)()
	class FText                                   Temp_text_Variable_8;                              // 0x00E0(0x0018)()
	class FText                                   Temp_text_Variable_9;                              // 0x00F8(0x0018)()
	class FText                                   Temp_text_Variable_10;                             // 0x0110(0x0018)()
	class FText                                   Temp_text_Variable_11;                             // 0x0128(0x0018)()
	class FText                                   Temp_text_Variable_12;                             // 0x0140(0x0018)()
	class FText                                   Temp_text_Variable_13;                             // 0x0158(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2ResearchClothingUpgradeDisplayInfo  K2Node_Event_InUpgradeInfo;                        // 0x0178(0x0050)(ConstParm)
	EP2ResearchRewardType                         K2Node_Event_InRewardType_1;                       // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InFacilityName;                       // 0x01D0(0x0018)(ConstParm)
	class FText                                   K2Node_Event_InRecipeName;                         // 0x01E8(0x0018)(ConstParm)
	int32                                         K2Node_Event_InRequiredLevel;                      // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0208(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0258(0x0010)(ReferenceParm)
	class FText                                   K2Node_Select_Default;                             // 0x0268(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0280(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0298(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x02E8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0338(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0388(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x03D8(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x03E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x03F8(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0410(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0428(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0478(0x0018)()
	class FText                                   CallFunc_GetRewardTypeTextBP_ReturnValue;          // 0x0490(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x04A8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x04F8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0548(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0558(0x0018)()
	class UP2ResearchNodeRewardBase*              K2Node_Event_InRewardBase_1;                       // 0x0570(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579[0x7];                                      // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetRewardTypeTextBP_ReturnValue_1;        // 0x0580(0x0018)()
	bool                                          K2Node_Event_bInSmallSize;                         // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_599[0x7];                                      // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x05A0(0x0050)(HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x05F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsCompleted;                       // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsSelected;                        // 0x05F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ResearchRewardType                         K2Node_Event_InRewardType;                         // 0x05FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x05FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x05FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FD[0x3];                                      // 0x05FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0600(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UP2ResearchNodeRewardBase*              K2Node_Event_InRewardBase;                         // 0x0610(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ResearchReward_SalvageRecipies_C*   K2Node_DynamicCast_AsBP_Research_Reward_Salvage_Recipies; // 0x0618(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ResearchReward_CraftRecipies_C*     K2Node_DynamicCast_AsBP_Research_Reward_Craft_Recipies; // 0x0628(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0631(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0632(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGroupRecipies_IsGroupRecipies;          // 0x0633(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGroupRecipies_IsGroupRecipies_1;        // 0x0634(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_635[0x3];                                      // 0x0635(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ResearchReward_Contract_C*          K2Node_DynamicCast_AsBP_Research_Reward_Contract;  // 0x0638(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0641(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_642[0x6];                                      // 0x0642(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ResearchReward_Items_C*             K2Node_DynamicCast_AsBP_Research_Reward_Items;     // 0x0648(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0650(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0651(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0652(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_653[0x5];                                      // 0x0653(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0658(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0660(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController_Hideout*            K2Node_DynamicCast_AsP2Player_Controller_Hideout;  // 0x0668(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_671[0x7];                                      // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2PlayerController_Hideout*            K2Node_DynamicCast_AsP2Player_Controller_Hideout_1; // 0x0678(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_681[0x7];                                      // 0x0681(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FP2ExchangeDataInfo>            CallFunc_GetProductionRecipesById_OutProductionRecipes; // 0x0688(0x0010)(ReferenceParm)
	TArray<struct FP2ExchangeDataInfo>            CallFunc_GetProductionRecipesById_OutProductionRecipes_1; // 0x0698(0x0010)(ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x06A8(0x0020)()
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags;   // 0x06C8(0x0010)(ReferenceParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x06D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetFormattedText_ReturnValue;             // 0x06E0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_9;            // 0x06F8(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetRequiredLevelText_ReturnValue;         // 0x0748(0x0018)()
	class FText                                   CallFunc_GetAccessFacilityText_ReturnValue;        // 0x0760(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_10;           // 0x0778(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_11;           // 0x07C8(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetRewardTypeTextBP_ReturnValue_2;        // 0x0818(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x0830(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_12;           // 0x0840(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x0890(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x08A8(0x0018)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x08C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C4[0x4];                                      // 0x08C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_13;           // 0x08C8(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0918(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91C[0x4];                                      // 0x091C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_14;           // 0x0920(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x0970(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_5;                     // 0x0980(0x0018)()
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0998(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget) == 0x000008, "Wrong alignment on W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget");
static_assert(sizeof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget) == 0x0009A0, "Wrong size on W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, EntryPoint) == 0x000000, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_MakeStruct_Margin) == 0x000004, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, Temp_bool_Variable) == 0x000014, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, Temp_text_Variable) == 0x000018, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, Temp_text_Variable_1) == 0x000030, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, Temp_byte_Variable) == 0x000048, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, Temp_text_Variable_2) == 0x000050, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, Temp_text_Variable_3) == 0x000068, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, Temp_text_Variable_4) == 0x000080, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, Temp_text_Variable_5) == 0x000098, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, Temp_text_Variable_6) == 0x0000B0, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, Temp_text_Variable_7) == 0x0000C8, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, Temp_text_Variable_8) == 0x0000E0, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, Temp_text_Variable_9) == 0x0000F8, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::Temp_text_Variable_9' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, Temp_text_Variable_10) == 0x000110, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::Temp_text_Variable_10' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, Temp_text_Variable_11) == 0x000128, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::Temp_text_Variable_11' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, Temp_text_Variable_12) == 0x000140, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::Temp_text_Variable_12' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, Temp_text_Variable_13) == 0x000158, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::Temp_text_Variable_13' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_Event_IsDesignTime) == 0x000170, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_Event_InUpgradeInfo) == 0x000178, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_Event_InUpgradeInfo' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_Event_InRewardType_1) == 0x0001C8, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_Event_InRewardType_1' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_Event_InFacilityName) == 0x0001D0, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_Event_InFacilityName' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_Event_InRecipeName) == 0x0001E8, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_Event_InRecipeName' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_Event_InRequiredLevel) == 0x000200, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_Event_InRequiredLevel' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000204, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_MakeStruct_FormatArgumentData) == 0x000208, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_MakeArray_Array) == 0x000258, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_Select_Default) == 0x000268, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_Format_ReturnValue) == 0x000280, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_MakeStruct_FormatArgumentData_1) == 0x000298, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_MakeStruct_FormatArgumentData_2) == 0x0002E8, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_MakeStruct_FormatArgumentData_3) == 0x000338, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_MakeStruct_FormatArgumentData_4) == 0x000388, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_MakeArray_Array_1) == 0x0003D8, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_MakeArray_Array_2) == 0x0003E8, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_Format_ReturnValue_1) == 0x0003F8, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_Select_Default_1) == 0x000410, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_MakeStruct_FormatArgumentData_5) == 0x000428, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_Format_ReturnValue_2) == 0x000478, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_GetRewardTypeTextBP_ReturnValue) == 0x000490, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_GetRewardTypeTextBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_MakeStruct_FormatArgumentData_6) == 0x0004A8, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_MakeStruct_FormatArgumentData_7) == 0x0004F8, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_MakeStruct_FormatArgumentData_7' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_MakeArray_Array_3) == 0x000548, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_Format_ReturnValue_3) == 0x000558, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_Event_InRewardBase_1) == 0x000570, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_Event_InRewardBase_1' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_IsValid_ReturnValue) == 0x000578, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_GetRewardTypeTextBP_ReturnValue_1) == 0x000580, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_GetRewardTypeTextBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_Event_bInSmallSize) == 0x000598, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_Event_bInSmallSize' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_MakeStruct_FormatArgumentData_8) == 0x0005A0, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_MakeStruct_FormatArgumentData_8' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x0005F0, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_Event_bInIsCompleted) == 0x0005F8, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_Event_bInIsCompleted' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_Event_bInIsSelected) == 0x0005F9, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_Event_bInIsSelected' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_Event_InRewardType) == 0x0005FA, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_Event_InRewardType' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0005FB, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_SwitchEnum_CmpSuccess) == 0x0005FC, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_MakeStruct_Margin_1) == 0x000600, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_Event_InRewardBase) == 0x000610, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_Event_InRewardBase' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_DynamicCast_AsBP_Research_Reward_Salvage_Recipies) == 0x000618, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_DynamicCast_AsBP_Research_Reward_Salvage_Recipies' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_DynamicCast_bSuccess) == 0x000620, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_DynamicCast_AsBP_Research_Reward_Craft_Recipies) == 0x000628, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_DynamicCast_AsBP_Research_Reward_Craft_Recipies' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_DynamicCast_bSuccess_1) == 0x000630, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_IsValid_ReturnValue_1) == 0x000631, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_IsValid_ReturnValue_2) == 0x000632, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_IsGroupRecipies_IsGroupRecipies) == 0x000633, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_IsGroupRecipies_IsGroupRecipies' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_IsGroupRecipies_IsGroupRecipies_1) == 0x000634, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_IsGroupRecipies_IsGroupRecipies_1' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_DynamicCast_AsBP_Research_Reward_Contract) == 0x000638, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_DynamicCast_AsBP_Research_Reward_Contract' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_DynamicCast_bSuccess_2) == 0x000640, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_IsValid_ReturnValue_3) == 0x000641, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_DynamicCast_AsBP_Research_Reward_Items) == 0x000648, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_DynamicCast_AsBP_Research_Reward_Items' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_DynamicCast_bSuccess_3) == 0x000650, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_IsValid_ReturnValue_4) == 0x000651, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_SwitchEnum_CmpSuccess_1) == 0x000652, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000658, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000660, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_DynamicCast_AsP2Player_Controller_Hideout) == 0x000668, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_DynamicCast_AsP2Player_Controller_Hideout' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_DynamicCast_bSuccess_4) == 0x000670, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_DynamicCast_AsP2Player_Controller_Hideout_1) == 0x000678, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_DynamicCast_AsP2Player_Controller_Hideout_1' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_DynamicCast_bSuccess_5) == 0x000680, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_GetProductionRecipesById_OutProductionRecipes) == 0x000688, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_GetProductionRecipesById_OutProductionRecipes' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_GetProductionRecipesById_OutProductionRecipes_1) == 0x000698, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_GetProductionRecipesById_OutProductionRecipes_1' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x0006A8, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_BreakGameplayTagContainer_GameplayTags) == 0x0006C8, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_BreakGameplayTagContainer_GameplayTags' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x0006D8, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_GetFormattedText_ReturnValue) == 0x0006E0, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_GetFormattedText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_MakeStruct_FormatArgumentData_9) == 0x0006F8, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_MakeStruct_FormatArgumentData_9' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_GetRequiredLevelText_ReturnValue) == 0x000748, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_GetRequiredLevelText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_GetAccessFacilityText_ReturnValue) == 0x000760, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_GetAccessFacilityText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_MakeStruct_FormatArgumentData_10) == 0x000778, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_MakeStruct_FormatArgumentData_10' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_MakeStruct_FormatArgumentData_11) == 0x0007C8, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_MakeStruct_FormatArgumentData_11' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_GetRewardTypeTextBP_ReturnValue_2) == 0x000818, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_GetRewardTypeTextBP_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_MakeArray_Array_4) == 0x000830, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_MakeStruct_FormatArgumentData_12) == 0x000840, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_MakeStruct_FormatArgumentData_12' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_Format_ReturnValue_4) == 0x000890, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_Format_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_MakeLiteralText_ReturnValue) == 0x0008A8, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, CallFunc_Array_Add_ReturnValue) == 0x0008C0, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget, K2Node_MakeStruct_FormatArgumentData_13) == 0x0008C8, "Member 'W_Research_RewardWidget_C_ExecuteUbergraph_W_Research_RewardWidget::K2Node_MakeStruct_FormatArgumentData_13' has a wrong offset!");
