#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Research_DetailRewardsWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Research_DetailRewardsWidget.W_Research_DetailRewardsWidget_C
// 0x0028 (0x02C8 - 0x02A0)
class UW_Research_DetailRewardsWidget_C final : public UP2ResearchDetailRewardsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_Research_RewardWidget_C*             W_Research_RewardWidget;                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_RewardWidget_C*             W_Research_RewardWidget_1;                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_RewardWidget_C*             W_Research_RewardWidget_2;                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Research_RewardWidget_C*             W_Research_RewardWidget_3;                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Research_DetailRewardsWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Research_DetailRewardsWidget_C">();
	}
	static class UW_Research_DetailRewardsWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Research_DetailRewardsWidget_C>();
	}
};
static_assert(alignof(UW_Research_DetailRewardsWidget_C) == 0x000008, "Wrong alignment on UW_Research_DetailRewardsWidget_C");
static_assert(sizeof(UW_Research_DetailRewardsWidget_C) == 0x0002C8, "Wrong size on UW_Research_DetailRewardsWidget_C");
static_assert(offsetof(UW_Research_DetailRewardsWidget_C, UberGraphFrame) == 0x0002A0, "Member 'UW_Research_DetailRewardsWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Research_DetailRewardsWidget_C, W_Research_RewardWidget) == 0x0002A8, "Member 'UW_Research_DetailRewardsWidget_C::W_Research_RewardWidget' has a wrong offset!");
static_assert(offsetof(UW_Research_DetailRewardsWidget_C, W_Research_RewardWidget_1) == 0x0002B0, "Member 'UW_Research_DetailRewardsWidget_C::W_Research_RewardWidget_1' has a wrong offset!");
static_assert(offsetof(UW_Research_DetailRewardsWidget_C, W_Research_RewardWidget_2) == 0x0002B8, "Member 'UW_Research_DetailRewardsWidget_C::W_Research_RewardWidget_2' has a wrong offset!");
static_assert(offsetof(UW_Research_DetailRewardsWidget_C, W_Research_RewardWidget_3) == 0x0002C0, "Member 'UW_Research_DetailRewardsWidget_C::W_Research_RewardWidget_3' has a wrong offset!");

}

