#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Research_ObjectiveWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_Research_ObjectiveWidget.W_Research_ObjectiveWidget_C.SetResearchStepBP
// 0x0008 (0x0008 - 0x0000)
struct W_Research_ObjectiveWidget_C_SetResearchStepBP final
{
public:
	const class UP2ResearchStep*                  InResearchStep;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_ObjectiveWidget_C_SetResearchStepBP) == 0x000008, "Wrong alignment on W_Research_ObjectiveWidget_C_SetResearchStepBP");
static_assert(sizeof(W_Research_ObjectiveWidget_C_SetResearchStepBP) == 0x000008, "Wrong size on W_Research_ObjectiveWidget_C_SetResearchStepBP");
static_assert(offsetof(W_Research_ObjectiveWidget_C_SetResearchStepBP, InResearchStep) == 0x000000, "Member 'W_Research_ObjectiveWidget_C_SetResearchStepBP::InResearchStep' has a wrong offset!");

// Function W_Research_ObjectiveWidget.W_Research_ObjectiveWidget_C.SetProgressTime
// 0x0008 (0x0008 - 0x0000)
struct W_Research_ObjectiveWidget_C_SetProgressTime final
{
public:
	float                                         InRemainingTime;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InProgressRatio;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_ObjectiveWidget_C_SetProgressTime) == 0x000004, "Wrong alignment on W_Research_ObjectiveWidget_C_SetProgressTime");
static_assert(sizeof(W_Research_ObjectiveWidget_C_SetProgressTime) == 0x000008, "Wrong size on W_Research_ObjectiveWidget_C_SetProgressTime");
static_assert(offsetof(W_Research_ObjectiveWidget_C_SetProgressTime, InRemainingTime) == 0x000000, "Member 'W_Research_ObjectiveWidget_C_SetProgressTime::InRemainingTime' has a wrong offset!");
static_assert(offsetof(W_Research_ObjectiveWidget_C_SetProgressTime, InProgressRatio) == 0x000004, "Member 'W_Research_ObjectiveWidget_C_SetProgressTime::InProgressRatio' has a wrong offset!");

// Function W_Research_ObjectiveWidget.W_Research_ObjectiveWidget_C.SetEstimatedTime
// 0x0004 (0x0004 - 0x0000)
struct W_Research_ObjectiveWidget_C_SetEstimatedTime final
{
public:
	float                                         InTime;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_ObjectiveWidget_C_SetEstimatedTime) == 0x000004, "Wrong alignment on W_Research_ObjectiveWidget_C_SetEstimatedTime");
static_assert(sizeof(W_Research_ObjectiveWidget_C_SetEstimatedTime) == 0x000004, "Wrong size on W_Research_ObjectiveWidget_C_SetEstimatedTime");
static_assert(offsetof(W_Research_ObjectiveWidget_C_SetEstimatedTime, InTime) == 0x000000, "Member 'W_Research_ObjectiveWidget_C_SetEstimatedTime::InTime' has a wrong offset!");

// Function W_Research_ObjectiveWidget.W_Research_ObjectiveWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Research_ObjectiveWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_ObjectiveWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Research_ObjectiveWidget_C_PreConstruct");
static_assert(sizeof(W_Research_ObjectiveWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Research_ObjectiveWidget_C_PreConstruct");
static_assert(offsetof(W_Research_ObjectiveWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Research_ObjectiveWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Research_ObjectiveWidget.W_Research_ObjectiveWidget_C.ExecuteUbergraph_W_Research_ObjectiveWidget
// 0x0488 (0x0488 - 0x0000)
struct W_Research_ObjectiveWidget_C_ExecuteUbergraph_W_Research_ObjectiveWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x001C(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InTime;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SecondToTimer_OutHour;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SecondToTimer_OutMinute;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SecondToTimer_OutSecond;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UP2ResearchStep*                  K2Node_Event_InResearchStep;                       // 0x0048(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UP2ResearchNodeRequirement*             CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0060(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRequiredCompletionCount_ReturnValue;   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0088(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A0(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentCompletionCount_ReturnValue;    // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x00F8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0110(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0160(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0178(0x0010)(ReferenceParm)
	class FText                                   K2Node_Select_Default;                             // 0x0188(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01B8(0x0050)(HasGetValueTypeHash)
	float                                         K2Node_Event_InRemainingTime;                      // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InProgressRatio;                      // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0210(0x0010)(ReferenceParm)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0228(0x0018)()
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0250(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_SecondToTimer_OutHour_1;                  // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SecondToTimer_OutMinute_1;                // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SecondToTimer_OutSecond_1;                // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x02B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x02C0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x02D8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x02F0(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_5;             // 0x0340(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_6;             // 0x0358(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0370(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x03C0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0410(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0420(0x0018)()
	class FText                                   Temp_text_Variable;                                // 0x0438(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0458(0x0018)()
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_ObjectiveWidget_C_ExecuteUbergraph_W_Research_ObjectiveWidget) == 0x000008, "Wrong alignment on W_Research_ObjectiveWidget_C_ExecuteUbergraph_W_Research_ObjectiveWidget");
static_assert(sizeof(W_Research_ObjectiveWidget_C_ExecuteUbergraph_W_Research_ObjectiveWidget) == 0x000488, "Wrong size on W_Research_ObjectiveWidget_C_ExecuteUbergraph_W_Research_ObjectiveWidget");
static_assert(offsetof(W_Research_ObjectiveWidget_C_ExecuteUbergraph_W_Research_ObjectiveWidget, EntryPoint) == 0x000000, "Member 'W_Research_ObjectiveWidget_C_ExecuteUbergraph_W_Research_ObjectiveWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Research_ObjectiveWidget_C_ExecuteUbergraph_W_Research_ObjectiveWidget, Temp_bool_Variable) == 0x000004, "Member 'W_Research_ObjectiveWidget_C_ExecuteUbergraph_W_Research_ObjectiveWidget::Temp_bool_Variable' has a wrong offset!");
