#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Research_NodeListWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Research_NodeListWidget.W_Research_NodeListWidget_C
// 0x0270 (0x0570 - 0x0300)
class UW_Research_NodeListWidget_C final : public UP2ResearchNodeListWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_AlertMark;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_CompleteMark;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_CompleteMarkOutline;                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_InProgressMark;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_NodeListBg;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_NodeListOutline;                               // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_ProgressBarBg;                                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_ProgressBarLines;                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_AlertMark;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_CategoryTag_BracketL;                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_CategoryTag_BracketR;                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         NodeNameSelectedFontStyle;                         // 0x0360(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSlateFontInfo                         NodeNameNormalFontStyle;                           // 0x03B8(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSlateFontInfo                         RemainingTimeSelectedFontStyle;                    // 0x0410(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSlateFontInfo                         RemainingTimeNormalFontStyle;                      // 0x0468(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSlateFontInfo                         PercentSelectedFontStyle;                          // 0x04C0(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSlateFontInfo                         PercentNormalFontStyle;                            // 0x0518(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void SetSelected(bool InIsSelected)	 // 0xae1e64;
	void SetProgressTime(float InRemainingTime, float InProgressRatio)	 // 0xae1e64;
	void SetEstimatedTime(float InTime)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_Research_NodeListWidget(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Research_NodeListWidget_C">();
	}
	static class UW_Research_NodeListWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Research_NodeListWidget_C>();
	}
};
static_assert(alignof(UW_Research_NodeListWidget_C) == 0x000008, "Wrong alignment on UW_Research_NodeListWidget_C");
static_assert(sizeof(UW_Research_NodeListWidget_C) == 0x000570, "Wrong size on UW_Research_NodeListWidget_C");
static_assert(offsetof(UW_Research_NodeListWidget_C, UberGraphFrame) == 0x000300, "Member 'UW_Research_NodeListWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Research_NodeListWidget_C, Bdr_AlertMark) == 0x000308, "Member 'UW_Research_NodeListWidget_C::Bdr_AlertMark' has a wrong offset!");
static_assert(offsetof(UW_Research_NodeListWidget_C, Bdr_CompleteMark) == 0x000310, "Member 'UW_Research_NodeListWidget_C::Bdr_CompleteMark' has a wrong offset!");
static_assert(offsetof(UW_Research_NodeListWidget_C, Bdr_CompleteMarkOutline) == 0x000318, "Member 'UW_Research_NodeListWidget_C::Bdr_CompleteMarkOutline' has a wrong offset!");
static_assert(offsetof(UW_Research_NodeListWidget_C, Bdr_InProgressMark) == 0x000320, "Member 'UW_Research_NodeListWidget_C::Bdr_InProgressMark' has a wrong offset!");
static_assert(offsetof(UW_Research_NodeListWidget_C, Bdr_NodeListBg) == 0x000328, "Member 'UW_Research_NodeListWidget_C::Bdr_NodeListBg' has a wrong offset!");
static_assert(offsetof(UW_Research_NodeListWidget_C, Bdr_NodeListOutline) == 0x000330, "Member 'UW_Research_NodeListWidget_C::Bdr_NodeListOutline' has a wrong offset!");
static_assert(offsetof(UW_Research_NodeListWidget_C, Bdr_ProgressBarBg) == 0x000338, "Member 'UW_Research_NodeListWidget_C::Bdr_ProgressBarBg' has a wrong offset!");
static_assert(offsetof(UW_Research_NodeListWidget_C, Bdr_ProgressBarLines) == 0x000340, "Member 'UW_Research_NodeListWidget_C::Bdr_ProgressBarLines' has a wrong offset!");
static_assert(offsetof(UW_Research_NodeListWidget_C, Img_AlertMark) == 0x000348, "Member 'UW_Research_NodeListWidget_C::Img_AlertMark' has a wrong offset!");
static_assert(offsetof(UW_Research_NodeListWidget_C, Txt_CategoryTag_BracketL) == 0x000350, "Member 'UW_Research_NodeListWidget_C::Txt_CategoryTag_BracketL' has a wrong offset!");
static_assert(offsetof(UW_Research_NodeListWidget_C, Txt_CategoryTag_BracketR) == 0x000358, "Member 'UW_Research_NodeListWidget_C::Txt_CategoryTag_BracketR' has a wrong offset!");
static_assert(offsetof(UW_Research_NodeListWidget_C, NodeNameSelectedFontStyle) == 0x000360, "Member 'UW_Research_NodeListWidget_C::NodeNameSelectedFontStyle' has a wrong offset!");
static_assert(offsetof(UW_Research_NodeListWidget_C, NodeNameNormalFontStyle) == 0x0003B8, "Member 'UW_Research_NodeListWidget_C::NodeNameNormalFontStyle' has a wrong offset!");
static_assert(offsetof(UW_Research_NodeListWidget_C, RemainingTimeSelectedFontStyle) == 0x000410, "Member 'UW_Research_NodeListWidget_C::RemainingTimeSelectedFontStyle' has a wrong offset!");
static_assert(offsetof(UW_Research_NodeListWidget_C, RemainingTimeNormalFontStyle) == 0x000468, "Member 'UW_Research_NodeListWidget_C::RemainingTimeNormalFontStyle' has a wrong offset!");
static_assert(offsetof(UW_Research_NodeListWidget_C, PercentSelectedFontStyle) == 0x0004C0, "Member 'UW_Research_NodeListWidget_C::PercentSelectedFontStyle' has a wrong offset!");
static_assert(offsetof(UW_Research_NodeListWidget_C, PercentNormalFontStyle) == 0x000518, "Member 'UW_Research_NodeListWidget_C::PercentNormalFontStyle' has a wrong offset!");

}

