#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Research_Available_LNB

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Research_Available_LNB.W_Research_Available_LNB_C.UpdateUnlockedDesign
// 0x0001 (0x0001 - 0x0000)
struct W_Research_Available_LNB_C_UpdateUnlockedDesign final
{
public:
	bool                                          InbUnlocked;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_Available_LNB_C_UpdateUnlockedDesign) == 0x000001, "Wrong alignment on W_Research_Available_LNB_C_UpdateUnlockedDesign");
static_assert(sizeof(W_Research_Available_LNB_C_UpdateUnlockedDesign) == 0x000001, "Wrong size on W_Research_Available_LNB_C_UpdateUnlockedDesign");
static_assert(offsetof(W_Research_Available_LNB_C_UpdateUnlockedDesign, InbUnlocked) == 0x000000, "Member 'W_Research_Available_LNB_C_UpdateUnlockedDesign::InbUnlocked' has a wrong offset!");

// Function W_Research_Available_LNB.W_Research_Available_LNB_C.UpdateSelectedDesign
// 0x0001 (0x0001 - 0x0000)
struct W_Research_Available_LNB_C_UpdateSelectedDesign final
{
public:
	bool                                          InbSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_Available_LNB_C_UpdateSelectedDesign) == 0x000001, "Wrong alignment on W_Research_Available_LNB_C_UpdateSelectedDesign");
static_assert(sizeof(W_Research_Available_LNB_C_UpdateSelectedDesign) == 0x000001, "Wrong size on W_Research_Available_LNB_C_UpdateSelectedDesign");
static_assert(offsetof(W_Research_Available_LNB_C_UpdateSelectedDesign, InbSelected) == 0x000000, "Member 'W_Research_Available_LNB_C_UpdateSelectedDesign::InbSelected' has a wrong offset!");

// Function W_Research_Available_LNB.W_Research_Available_LNB_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Research_Available_LNB_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_Available_LNB_C_PreConstruct) == 0x000001, "Wrong alignment on W_Research_Available_LNB_C_PreConstruct");
static_assert(sizeof(W_Research_Available_LNB_C_PreConstruct) == 0x000001, "Wrong size on W_Research_Available_LNB_C_PreConstruct");
static_assert(offsetof(W_Research_Available_LNB_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Research_Available_LNB_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Research_Available_LNB.W_Research_Available_LNB_C.OnNotiActive_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_Research_Available_LNB_C_OnNotiActive_ImplementableEvent final
{
public:
	bool                                          InIsActive;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_Available_LNB_C_OnNotiActive_ImplementableEvent) == 0x000001, "Wrong alignment on W_Research_Available_LNB_C_OnNotiActive_ImplementableEvent");
static_assert(sizeof(W_Research_Available_LNB_C_OnNotiActive_ImplementableEvent) == 0x000001, "Wrong size on W_Research_Available_LNB_C_OnNotiActive_ImplementableEvent");
static_assert(offsetof(W_Research_Available_LNB_C_OnNotiActive_ImplementableEvent, InIsActive) == 0x000000, "Member 'W_Research_Available_LNB_C_OnNotiActive_ImplementableEvent::InIsActive' has a wrong offset!");

// Function W_Research_Available_LNB.W_Research_Available_LNB_C.ExecuteUbergraph_W_Research_Available_LNB
// 0x0044 (0x0044 - 0x0000)
struct W_Research_Available_LNB_C_ExecuteUbergraph_W_Research_Available_LNB final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x002C(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InbSelected;                          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsActive;                           // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InbUnlocked;                          // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Research_Available_LNB_C_ExecuteUbergraph_W_Research_Available_LNB) == 0x000004, "Wrong alignment on W_Research_Available_LNB_C_ExecuteUbergraph_W_Research_Available_LNB");
static_assert(sizeof(W_Research_Available_LNB_C_ExecuteUbergraph_W_Research_Available_LNB) == 0x000044, "Wrong size on W_Research_Available_LNB_C_ExecuteUbergraph_W_Research_Available_LNB");
static_assert(offsetof(W_Research_Available_LNB_C_ExecuteUbergraph_W_Research_Available_LNB, EntryPoint) == 0x000000, "Member 'W_Research_Available_LNB_C_ExecuteUbergraph_W_Research_Available_LNB::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Research_Available_LNB_C_ExecuteUbergraph_W_Research_Available_LNB, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_Research_Available_LNB_C_ExecuteUbergraph_W_Research_Available_LNB::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Research_Available_LNB_C_ExecuteUbergraph_W_Research_Available_LNB, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_Research_Available_LNB_C_ExecuteUbergraph_W_Research_Available_LNB::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Research_Available_LNB_C_ExecuteUbergraph_W_Research_Available_LNB, K2Node_MakeStruct_SlateColor_2) == 0x00002C, "Member 'W_Research_Available_LNB_C_ExecuteUbergraph_W_Research_Available_LNB::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_Research_Available_LNB_C_ExecuteUbergraph_W_Research_Available_LNB, K2Node_Event_IsDesignTime) == 0x000040, "Member 'W_Research_Available_LNB_C_ExecuteUbergraph_W_Research_Available_LNB::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Research_Available_LNB_C_ExecuteUbergraph_W_Research_Available_LNB, K2Node_Event_InbSelected) == 0x000041, "Member 'W_Research_Available_LNB_C_ExecuteUbergraph_W_Research_Available_LNB::K2Node_Event_InbSelected' has a wrong offset!");
static_assert(offsetof(W_Research_Available_LNB_C_ExecuteUbergraph_W_Research_Available_LNB, K2Node_Event_InIsActive) == 0x000042, "Member 'W_Research_Available_LNB_C_ExecuteUbergraph_W_Research_Available_LNB::K2Node_Event_InIsActive' has a wrong offset!");
static_assert(offsetof(W_Research_Available_LNB_C_ExecuteUbergraph_W_Research_Available_LNB, K2Node_Event_InbUnlocked) == 0x000043, "Member 'W_Research_Available_LNB_C_ExecuteUbergraph_W_Research_Available_LNB::K2Node_Event_InbUnlocked' has a wrong offset!");

}

