#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Salvage_DetailWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Salvage_DetailWidget.W_Salvage_DetailWidget_C
// 0x0058 (0x0378 - 0x0320)
class UW_Salvage_DetailWidget_C final : public UP2SalvageDetailWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SzB_StackCount;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_StackCount;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_Details;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Salvage_OutcomeWidget_C*             W_Salvage_OutcomeWidget;                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Salvage_OutcomeWidget_C*             W_Salvage_OutcomeWidget_1;                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Salvage_OutcomeWidget_C*             W_Salvage_OutcomeWidget_2;                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Salvage_OutcomeWidget_C*             W_Salvage_OutcomeWidget_3;                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_UnlockRequirementWidget_C*           W_UnlockRequirementWidget;                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_UnlockRequirementWidget_C*           W_UnlockRequirementWidget_1;                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_UnlockRequirementWidget_C*           W_UnlockRequirementWidget_2;                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_Salvage_DetailWidget(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Salvage_DetailWidget_C">();
	}
	static class UW_Salvage_DetailWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Salvage_DetailWidget_C>();
	}
};
static_assert(alignof(UW_Salvage_DetailWidget_C) == 0x000008, "Wrong alignment on UW_Salvage_DetailWidget_C");
static_assert(sizeof(UW_Salvage_DetailWidget_C) == 0x000378, "Wrong size on UW_Salvage_DetailWidget_C");
static_assert(offsetof(UW_Salvage_DetailWidget_C, UberGraphFrame) == 0x000320, "Member 'UW_Salvage_DetailWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Salvage_DetailWidget_C, SzB_StackCount) == 0x000328, "Member 'UW_Salvage_DetailWidget_C::SzB_StackCount' has a wrong offset!");
static_assert(offsetof(UW_Salvage_DetailWidget_C, Txt_StackCount) == 0x000330, "Member 'UW_Salvage_DetailWidget_C::Txt_StackCount' has a wrong offset!");
static_assert(offsetof(UW_Salvage_DetailWidget_C, VB_Details) == 0x000338, "Member 'UW_Salvage_DetailWidget_C::VB_Details' has a wrong offset!");
static_assert(offsetof(UW_Salvage_DetailWidget_C, W_Salvage_OutcomeWidget) == 0x000340, "Member 'UW_Salvage_DetailWidget_C::W_Salvage_OutcomeWidget' has a wrong offset!");
static_assert(offsetof(UW_Salvage_DetailWidget_C, W_Salvage_OutcomeWidget_1) == 0x000348, "Member 'UW_Salvage_DetailWidget_C::W_Salvage_OutcomeWidget_1' has a wrong offset!");
static_assert(offsetof(UW_Salvage_DetailWidget_C, W_Salvage_OutcomeWidget_2) == 0x000350, "Member 'UW_Salvage_DetailWidget_C::W_Salvage_OutcomeWidget_2' has a wrong offset!");
static_assert(offsetof(UW_Salvage_DetailWidget_C, W_Salvage_OutcomeWidget_3) == 0x000358, "Member 'UW_Salvage_DetailWidget_C::W_Salvage_OutcomeWidget_3' has a wrong offset!");
static_assert(offsetof(UW_Salvage_DetailWidget_C, W_UnlockRequirementWidget) == 0x000360, "Member 'UW_Salvage_DetailWidget_C::W_UnlockRequirementWidget' has a wrong offset!");
static_assert(offsetof(UW_Salvage_DetailWidget_C, W_UnlockRequirementWidget_1) == 0x000368, "Member 'UW_Salvage_DetailWidget_C::W_UnlockRequirementWidget_1' has a wrong offset!");
static_assert(offsetof(UW_Salvage_DetailWidget_C, W_UnlockRequirementWidget_2) == 0x000370, "Member 'UW_Salvage_DetailWidget_C::W_UnlockRequirementWidget_2' has a wrong offset!");

}

