#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Salvage_MainWidget

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Salvage_MainWidget.W_Salvage_MainWidget_C
// 0x0020 (0x06E0 - 0x06C0)
class UW_Salvage_MainWidget_C final : public UP2SalvageWidget
{
public:
	class UW_OutgameCommonButtonWidget_C*         CommonButton_Disabled;                             // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Title_Line;                                    // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    Keyguide_Back;                                     // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_FacilityTitle;                                 // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Salvage_MainWidget_C">();
	}
	static class UW_Salvage_MainWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Salvage_MainWidget_C>();
	}
};
static_assert(alignof(UW_Salvage_MainWidget_C) == 0x000008, "Wrong alignment on UW_Salvage_MainWidget_C");
static_assert(sizeof(UW_Salvage_MainWidget_C) == 0x0006E0, "Wrong size on UW_Salvage_MainWidget_C");
static_assert(offsetof(UW_Salvage_MainWidget_C, CommonButton_Disabled) == 0x0006C0, "Member 'UW_Salvage_MainWidget_C::CommonButton_Disabled' has a wrong offset!");
static_assert(offsetof(UW_Salvage_MainWidget_C, Img_Title_Line) == 0x0006C8, "Member 'UW_Salvage_MainWidget_C::Img_Title_Line' has a wrong offset!");
static_assert(offsetof(UW_Salvage_MainWidget_C, Keyguide_Back) == 0x0006D0, "Member 'UW_Salvage_MainWidget_C::Keyguide_Back' has a wrong offset!");
static_assert(offsetof(UW_Salvage_MainWidget_C, Txt_FacilityTitle) == 0x0006D8, "Member 'UW_Salvage_MainWidget_C::Txt_FacilityTitle' has a wrong offset!");

}

