#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Salvage_DetailWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Salvage_DetailWidget.W_Salvage_DetailWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_Salvage_DetailWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Salvage_DetailWidget_C_Tick) == 0x000004, "Wrong alignment on W_Salvage_DetailWidget_C_Tick");
static_assert(sizeof(W_Salvage_DetailWidget_C_Tick) == 0x00003C, "Wrong size on W_Salvage_DetailWidget_C_Tick");
static_assert(offsetof(W_Salvage_DetailWidget_C_Tick, MyGeometry) == 0x000000, "Member 'W_Salvage_DetailWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Salvage_DetailWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'W_Salvage_DetailWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_Salvage_DetailWidget.W_Salvage_DetailWidget_C.ExecuteUbergraph_W_Salvage_DetailWidget
// 0x0040 (0x0040 - 0x0000)
struct W_Salvage_DetailWidget_C_ExecuteUbergraph_W_Salvage_DetailWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Salvage_DetailWidget_C_ExecuteUbergraph_W_Salvage_DetailWidget) == 0x000004, "Wrong alignment on W_Salvage_DetailWidget_C_ExecuteUbergraph_W_Salvage_DetailWidget");
static_assert(sizeof(W_Salvage_DetailWidget_C_ExecuteUbergraph_W_Salvage_DetailWidget) == 0x000040, "Wrong size on W_Salvage_DetailWidget_C_ExecuteUbergraph_W_Salvage_DetailWidget");
static_assert(offsetof(W_Salvage_DetailWidget_C_ExecuteUbergraph_W_Salvage_DetailWidget, EntryPoint) == 0x000000, "Member 'W_Salvage_DetailWidget_C_ExecuteUbergraph_W_Salvage_DetailWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Salvage_DetailWidget_C_ExecuteUbergraph_W_Salvage_DetailWidget, K2Node_Event_MyGeometry) == 0x000004, "Member 'W_Salvage_DetailWidget_C_ExecuteUbergraph_W_Salvage_DetailWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Salvage_DetailWidget_C_ExecuteUbergraph_W_Salvage_DetailWidget, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'W_Salvage_DetailWidget_C_ExecuteUbergraph_W_Salvage_DetailWidget::K2Node_Event_InDeltaTime' has a wrong offset!");

}

