#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SquadManagement_PlayerWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SquadManagement_PlayerWidget.W_SquadManagement_PlayerWidget_C
// 0x0018 (0x0758 - 0x0740)
class UW_SquadManagement_PlayerWidget_C final : public UP2SquadManagementPlayerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0740(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_EmptyProfile;                                  // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsDisabled;                                        // 0x0750(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_SquadManagement_PlayerWidget_Btn_SquadManageEmpty_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_SquadManagement_PlayerWidget_Btn_SquadManageEmpty_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_SquadManagement_PlayerWidget_Btn_SquadManagePlayer_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_SquadManagement_PlayerWidget_Btn_SquadManagePlayer_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_SquadManagement_PlayerWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetReadyIcon()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_SquadManagement_PlayerWidget_C">();
	}
	static class UW_SquadManagement_PlayerWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_SquadManagement_PlayerWidget_C>();
	}
};
static_assert(alignof(UW_SquadManagement_PlayerWidget_C) == 0x000008, "Wrong alignment on UW_SquadManagement_PlayerWidget_C");
static_assert(sizeof(UW_SquadManagement_PlayerWidget_C) == 0x000758, "Wrong size on UW_SquadManagement_PlayerWidget_C");
static_assert(offsetof(UW_SquadManagement_PlayerWidget_C, UberGraphFrame) == 0x000740, "Member 'UW_SquadManagement_PlayerWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_PlayerWidget_C, Img_EmptyProfile) == 0x000748, "Member 'UW_SquadManagement_PlayerWidget_C::Img_EmptyProfile' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_PlayerWidget_C, IsDisabled) == 0x000750, "Member 'UW_SquadManagement_PlayerWidget_C::IsDisabled' has a wrong offset!");

}

