#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SquadManagementWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SquadManagementWidget.W_SquadManagementWidget_C
// 0x0068 (0x0688 - 0x0620)
class UW_SquadManagementWidget_C final : public UP2SquadManagementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0620(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UP2Button*                              Btn_Close;                                         // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Divider;                                       // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_InviteIcon;                                    // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_InviteIcon02;                                  // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_NoInvites;                                     // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_InviteList;                                     // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SquadManagement_InviteWidget_C*      W_SquadManagement_InviteWidget;                    // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SquadManagement_InviteWidget_C*      W_SquadManagement_InviteWidget_1;                  // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SquadManagement_InviteWidget_C*      W_SquadManagement_InviteWidget_2;                  // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SquadManagement_InviteWidget_C*      W_SquadManagement_InviteWidget_3;                  // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SquadManagement_InviteWidget_C*      W_SquadManagement_InviteWidget_4;                  // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WS_Content;                                        // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__W_SquadManagementWidget_Btn_InviteBtn_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_SquadManagementWidget_Btn_InviteBtn_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_SquadManagementWidget_Btn_SquadBtn_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_SquadManagementWidget_Btn_SquadBtn_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void Destruct()	 // 0xae1e64;
	void ExecuteUbergraph_W_SquadManagementWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_SquadManagementWidget_C">();
	}
	static class UW_SquadManagementWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_SquadManagementWidget_C>();
	}
};
static_assert(alignof(UW_SquadManagementWidget_C) == 0x000008, "Wrong alignment on UW_SquadManagementWidget_C");
static_assert(sizeof(UW_SquadManagementWidget_C) == 0x000688, "Wrong size on UW_SquadManagementWidget_C");
static_assert(offsetof(UW_SquadManagementWidget_C, UberGraphFrame) == 0x000620, "Member 'UW_SquadManagementWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SquadManagementWidget_C, Btn_Close) == 0x000628, "Member 'UW_SquadManagementWidget_C::Btn_Close' has a wrong offset!");
static_assert(offsetof(UW_SquadManagementWidget_C, Img_Divider) == 0x000630, "Member 'UW_SquadManagementWidget_C::Img_Divider' has a wrong offset!");
static_assert(offsetof(UW_SquadManagementWidget_C, Img_InviteIcon) == 0x000638, "Member 'UW_SquadManagementWidget_C::Img_InviteIcon' has a wrong offset!");
static_assert(offsetof(UW_SquadManagementWidget_C, Img_InviteIcon02) == 0x000640, "Member 'UW_SquadManagementWidget_C::Img_InviteIcon02' has a wrong offset!");
static_assert(offsetof(UW_SquadManagementWidget_C, SzB_NoInvites) == 0x000648, "Member 'UW_SquadManagementWidget_C::SzB_NoInvites' has a wrong offset!");
static_assert(offsetof(UW_SquadManagementWidget_C, VB_InviteList) == 0x000650, "Member 'UW_SquadManagementWidget_C::VB_InviteList' has a wrong offset!");
static_assert(offsetof(UW_SquadManagementWidget_C, W_SquadManagement_InviteWidget) == 0x000658, "Member 'UW_SquadManagementWidget_C::W_SquadManagement_InviteWidget' has a wrong offset!");
static_assert(offsetof(UW_SquadManagementWidget_C, W_SquadManagement_InviteWidget_1) == 0x000660, "Member 'UW_SquadManagementWidget_C::W_SquadManagement_InviteWidget_1' has a wrong offset!");
static_assert(offsetof(UW_SquadManagementWidget_C, W_SquadManagement_InviteWidget_2) == 0x000668, "Member 'UW_SquadManagementWidget_C::W_SquadManagement_InviteWidget_2' has a wrong offset!");
static_assert(offsetof(UW_SquadManagementWidget_C, W_SquadManagement_InviteWidget_3) == 0x000670, "Member 'UW_SquadManagementWidget_C::W_SquadManagement_InviteWidget_3' has a wrong offset!");
static_assert(offsetof(UW_SquadManagementWidget_C, W_SquadManagement_InviteWidget_4) == 0x000678, "Member 'UW_SquadManagementWidget_C::W_SquadManagement_InviteWidget_4' has a wrong offset!");
static_assert(offsetof(UW_SquadManagementWidget_C, WS_Content) == 0x000680, "Member 'UW_SquadManagementWidget_C::WS_Content' has a wrong offset!");

}

