#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SquadManagement_InviteWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SquadManagement_InviteWidget.W_SquadManagement_InviteWidget_C
// 0x0048 (0x0338 - 0x02F0)
class UW_SquadManagement_InviteWidget_C final : public UP2SquadManagementInviteWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_Status;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UP2Button*                              Btn_SquadManageInvite;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_StatusDot;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Status;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_PlayerLevel;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Status;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SquadManagement_Button_C*            W_SquadManagement_Button_68;                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        RemainingTime;                                     // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void Destruct()	 // 0xae1e64;
	void ExecuteUbergraph_W_SquadManagement_InviteWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetState(int32 InStateNum)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_SquadManagement_InviteWidget_C">();
	}
	static class UW_SquadManagement_InviteWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_SquadManagement_InviteWidget_C>();
	}
};
static_assert(alignof(UW_SquadManagement_InviteWidget_C) == 0x000008, "Wrong alignment on UW_SquadManagement_InviteWidget_C");
static_assert(sizeof(UW_SquadManagement_InviteWidget_C) == 0x000338, "Wrong size on UW_SquadManagement_InviteWidget_C");
static_assert(offsetof(UW_SquadManagement_InviteWidget_C, UberGraphFrame) == 0x0002F0, "Member 'UW_SquadManagement_InviteWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InviteWidget_C, Bdr_Status) == 0x0002F8, "Member 'UW_SquadManagement_InviteWidget_C::Bdr_Status' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InviteWidget_C, Btn_SquadManageInvite) == 0x000300, "Member 'UW_SquadManagement_InviteWidget_C::Btn_SquadManageInvite' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InviteWidget_C, Img_StatusDot) == 0x000308, "Member 'UW_SquadManagement_InviteWidget_C::Img_StatusDot' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InviteWidget_C, SzB_Status) == 0x000310, "Member 'UW_SquadManagement_InviteWidget_C::SzB_Status' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InviteWidget_C, Txt_PlayerLevel) == 0x000318, "Member 'UW_SquadManagement_InviteWidget_C::Txt_PlayerLevel' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InviteWidget_C, Txt_Status) == 0x000320, "Member 'UW_SquadManagement_InviteWidget_C::Txt_Status' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InviteWidget_C, W_SquadManagement_Button_68) == 0x000328, "Member 'UW_SquadManagement_InviteWidget_C::W_SquadManagement_Button_68' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InviteWidget_C, RemainingTime) == 0x000330, "Member 'UW_SquadManagement_InviteWidget_C::RemainingTime' has a wrong offset!");

}

