#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SquadManagement_InviteWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_SquadManagement_InviteWidget.W_SquadManagement_InviteWidget_C.ExecuteUbergraph_W_SquadManagement_InviteWidget
// 0x000C (0x000C - 0x0000)
struct W_SquadManagement_InviteWidget_C_ExecuteUbergraph_W_SquadManagement_InviteWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InStateNum;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SquadManagement_InviteWidget_C_ExecuteUbergraph_W_SquadManagement_InviteWidget) == 0x000004, "Wrong alignment on W_SquadManagement_InviteWidget_C_ExecuteUbergraph_W_SquadManagement_InviteWidget");
static_assert(sizeof(W_SquadManagement_InviteWidget_C_ExecuteUbergraph_W_SquadManagement_InviteWidget) == 0x00000C, "Wrong size on W_SquadManagement_InviteWidget_C_ExecuteUbergraph_W_SquadManagement_InviteWidget");
static_assert(offsetof(W_SquadManagement_InviteWidget_C_ExecuteUbergraph_W_SquadManagement_InviteWidget, EntryPoint) == 0x000000, "Member 'W_SquadManagement_InviteWidget_C_ExecuteUbergraph_W_SquadManagement_InviteWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_SquadManagement_InviteWidget_C_ExecuteUbergraph_W_SquadManagement_InviteWidget, K2Node_Event_InStateNum) == 0x000004, "Member 'W_SquadManagement_InviteWidget_C_ExecuteUbergraph_W_SquadManagement_InviteWidget::K2Node_Event_InStateNum' has a wrong offset!");
static_assert(offsetof(W_SquadManagement_InviteWidget_C_ExecuteUbergraph_W_SquadManagement_InviteWidget, K2Node_Event_IsDesignTime) == 0x000008, "Member 'W_SquadManagement_InviteWidget_C_ExecuteUbergraph_W_SquadManagement_InviteWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_SquadManagement_InviteWidget_C_ExecuteUbergraph_W_SquadManagement_InviteWidget, K2Node_SwitchInteger_CmpSuccess) == 0x000009, "Member 'W_SquadManagement_InviteWidget_C_ExecuteUbergraph_W_SquadManagement_InviteWidget::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function W_SquadManagement_InviteWidget.W_SquadManagement_InviteWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_SquadManagement_InviteWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SquadManagement_InviteWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_SquadManagement_InviteWidget_C_PreConstruct");
static_assert(sizeof(W_SquadManagement_InviteWidget_C_PreConstruct) == 0x000001, "Wrong size on W_SquadManagement_InviteWidget_C_PreConstruct");
static_assert(offsetof(W_SquadManagement_InviteWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_SquadManagement_InviteWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_SquadManagement_InviteWidget.W_SquadManagement_InviteWidget_C.SetState
// 0x0004 (0x0004 - 0x0000)
struct W_SquadManagement_InviteWidget_C_SetState final
{
public:
	int32                                         InStateNum;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SquadManagement_InviteWidget_C_SetState) == 0x000004, "Wrong alignment on W_SquadManagement_InviteWidget_C_SetState");
static_assert(sizeof(W_SquadManagement_InviteWidget_C_SetState) == 0x000004, "Wrong size on W_SquadManagement_InviteWidget_C_SetState");
static_assert(offsetof(W_SquadManagement_InviteWidget_C_SetState, InStateNum) == 0x000000, "Member 'W_SquadManagement_InviteWidget_C_SetState::InStateNum' has a wrong offset!");

}

