#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SquadManagement_InviteListWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SquadManagement_InviteListWidget.W_SquadManagement_InviteListWidget_C
// 0x0058 (0x0620 - 0x05C8)
class UW_SquadManagement_InviteListWidget_C final : public UP2SquadManagementInviteListWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Divider;                                       // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SquadManagement_InviteWidget_C*      W_SquadManagement_InviteWidget;                    // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SquadManagement_InviteWidget_C*      W_SquadManagement_InviteWidget_1;                  // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SquadManagement_InviteWidget_C*      W_SquadManagement_InviteWidget_2;                  // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SquadManagement_InviteWidget_C*      W_SquadManagement_InviteWidget_3;                  // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SquadManagement_InviteWidget_C*      W_SquadManagement_InviteWidget_4;                  // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   PlayerName;                                        // 0x0600(0x0018)(Edit, BlueprintVisible)
	int32                                         PlayerLevel;                                       // 0x0618(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerStateInt;                                    // 0x061C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_SquadManagement_InviteListWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_SquadManagement_InviteListWidget_C">();
	}
	static class UW_SquadManagement_InviteListWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_SquadManagement_InviteListWidget_C>();
	}
};
static_assert(alignof(UW_SquadManagement_InviteListWidget_C) == 0x000008, "Wrong alignment on UW_SquadManagement_InviteListWidget_C");
static_assert(sizeof(UW_SquadManagement_InviteListWidget_C) == 0x000620, "Wrong size on UW_SquadManagement_InviteListWidget_C");
static_assert(offsetof(UW_SquadManagement_InviteListWidget_C, UberGraphFrame) == 0x0005C8, "Member 'UW_SquadManagement_InviteListWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InviteListWidget_C, Img_Divider) == 0x0005D0, "Member 'UW_SquadManagement_InviteListWidget_C::Img_Divider' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InviteListWidget_C, W_SquadManagement_InviteWidget) == 0x0005D8, "Member 'UW_SquadManagement_InviteListWidget_C::W_SquadManagement_InviteWidget' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InviteListWidget_C, W_SquadManagement_InviteWidget_1) == 0x0005E0, "Member 'UW_SquadManagement_InviteListWidget_C::W_SquadManagement_InviteWidget_1' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InviteListWidget_C, W_SquadManagement_InviteWidget_2) == 0x0005E8, "Member 'UW_SquadManagement_InviteListWidget_C::W_SquadManagement_InviteWidget_2' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InviteListWidget_C, W_SquadManagement_InviteWidget_3) == 0x0005F0, "Member 'UW_SquadManagement_InviteListWidget_C::W_SquadManagement_InviteWidget_3' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InviteListWidget_C, W_SquadManagement_InviteWidget_4) == 0x0005F8, "Member 'UW_SquadManagement_InviteListWidget_C::W_SquadManagement_InviteWidget_4' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InviteListWidget_C, PlayerName) == 0x000600, "Member 'UW_SquadManagement_InviteListWidget_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InviteListWidget_C, PlayerLevel) == 0x000618, "Member 'UW_SquadManagement_InviteListWidget_C::PlayerLevel' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InviteListWidget_C, PlayerStateInt) == 0x00061C, "Member 'UW_SquadManagement_InviteListWidget_C::PlayerStateInt' has a wrong offset!");

}

