#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SquadManagement_LoadoutCheckWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SquadManagement_LoadoutCheckWidget.W_SquadManagement_LoadoutCheckWidget_C
// 0x0030 (0x0438 - 0x0408)
class UW_SquadManagement_LoadoutCheckWidget_C final : public UP2LoadoutCheckWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           VB_LoadoutCheckWindow;                             // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonSlot_C*                        W_CommonSlot;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonSlot_C*                        W_CommonSlot_1;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonSlot_C*                        W_CommonSlot_2;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonSlot_C*                        W_CommonSlot_3;                                    // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_SquadManagement_LoadoutCheckWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetWidgetExpansion_ImplementableEvent()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_SquadManagement_LoadoutCheckWidget_C">();
	}
	static class UW_SquadManagement_LoadoutCheckWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_SquadManagement_LoadoutCheckWidget_C>();
	}
};
static_assert(alignof(UW_SquadManagement_LoadoutCheckWidget_C) == 0x000008, "Wrong alignment on UW_SquadManagement_LoadoutCheckWidget_C");
static_assert(sizeof(UW_SquadManagement_LoadoutCheckWidget_C) == 0x000438, "Wrong size on UW_SquadManagement_LoadoutCheckWidget_C");
static_assert(offsetof(UW_SquadManagement_LoadoutCheckWidget_C, UberGraphFrame) == 0x000408, "Member 'UW_SquadManagement_LoadoutCheckWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_LoadoutCheckWidget_C, VB_LoadoutCheckWindow) == 0x000410, "Member 'UW_SquadManagement_LoadoutCheckWidget_C::VB_LoadoutCheckWindow' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_LoadoutCheckWidget_C, W_CommonSlot) == 0x000418, "Member 'UW_SquadManagement_LoadoutCheckWidget_C::W_CommonSlot' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_LoadoutCheckWidget_C, W_CommonSlot_1) == 0x000420, "Member 'UW_SquadManagement_LoadoutCheckWidget_C::W_CommonSlot_1' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_LoadoutCheckWidget_C, W_CommonSlot_2) == 0x000428, "Member 'UW_SquadManagement_LoadoutCheckWidget_C::W_CommonSlot_2' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_LoadoutCheckWidget_C, W_CommonSlot_3) == 0x000430, "Member 'UW_SquadManagement_LoadoutCheckWidget_C::W_CommonSlot_3' has a wrong offset!");

}

