#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SquadManagement_InvitePopupWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SquadManagement_InvitePopupWidget.W_SquadManagement_InvitePopupWidget_C
// 0x00C0 (0x06A8 - 0x05E8)
class UW_SquadManagement_InvitePopupWidget_C final : public UP2InvitePopupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCircularThrobber*                      CircularThrobber;                                  // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Divider;                                       // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_308;                                        // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_SearchBar;                                     // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Desc;                                          // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_StatusDesc;                                    // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_TopBarTitle;                                   // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DecorationBuildMode_CategoryButton_C* W_DecorationBuildMode_CategoryButton;             // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DecorationBuildMode_CategoryButton_C* W_DecorationBuildMode_CategoryButton_1;           // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DecorationBuildMode_CategoryButton_C* W_DecorationBuildMode_CategoryButton_2;           // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DecorationBuildMode_CategoryButton_C* W_DecorationBuildMode_CategoryButton_3;           // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DecorationBuildMode_CategoryButton_C* W_DecorationBuildMode_CategoryButton_4;           // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DecorationBuildMode_CategoryButton_C* W_DecorationBuildMode_CategoryButton_5;           // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DecorationBuildMode_CategoryButton_C* W_DecorationBuildMode_CategoryButton_6;           // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DecorationBuildMode_CategoryButton_C* W_DecorationBuildMode_CategoryButton_7;           // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DecorationBuildMode_CategoryButton_C* W_DecorationBuildMode_CategoryButton_8;           // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DecorationBuildMode_CategoryButton_C* W_DecorationBuildMode_CategoryButton_9;           // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DecorationBuildMode_CategoryButton_C* W_DecorationBuildMode_CategoryButton_10;          // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DecorationBuildMode_CategoryButton_C* W_DecorationBuildMode_CategoryButton_11;          // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DecorationBuildMode_CategoryButton_C* W_DecorationBuildMode_CategoryButton_12;          // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DecorationBuildMode_CategoryButton_C* W_DecorationBuildMode_CategoryButton_13;          // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DecorationBuildMode_CategoryButton_C* W_DecorationBuildMode_CategoryButton_14;          // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DecorationBuildMode_CategoryButton_C* W_DecorationBuildMode_CategoryButton_15;          // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	bool BP_OnHandleBackAction()	 // 0xae1e64;
	void BP_SetPopupType(const EP2InvitePopupType InPopupType)	 // 0xae1e64;
	void ExecuteUbergraph_W_SquadManagement_InvitePopupWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetEnabled_BtnSubmit(const bool bEnabled)	 // 0xae1e64;
	void SetInviteError(const class FText& InErrorMessage)	 // 0xae1e64;
	void SetInviteStatus(const EP2InviteStatus_Private InStatus)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_SquadManagement_InvitePopupWidget_C">();
	}
	static class UW_SquadManagement_InvitePopupWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_SquadManagement_InvitePopupWidget_C>();
	}
};
static_assert(alignof(UW_SquadManagement_InvitePopupWidget_C) == 0x000008, "Wrong alignment on UW_SquadManagement_InvitePopupWidget_C");
static_assert(sizeof(UW_SquadManagement_InvitePopupWidget_C) == 0x0006A8, "Wrong size on UW_SquadManagement_InvitePopupWidget_C");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, UberGraphFrame) == 0x0005E8, "Member 'UW_SquadManagement_InvitePopupWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, CircularThrobber) == 0x0005F0, "Member 'UW_SquadManagement_InvitePopupWidget_C::CircularThrobber' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, Img_Divider) == 0x0005F8, "Member 'UW_SquadManagement_InvitePopupWidget_C::Img_Divider' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, Spacer_308) == 0x000600, "Member 'UW_SquadManagement_InvitePopupWidget_C::Spacer_308' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, SzB_SearchBar) == 0x000608, "Member 'UW_SquadManagement_InvitePopupWidget_C::SzB_SearchBar' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, Txt_Desc) == 0x000610, "Member 'UW_SquadManagement_InvitePopupWidget_C::Txt_Desc' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, Txt_StatusDesc) == 0x000618, "Member 'UW_SquadManagement_InvitePopupWidget_C::Txt_StatusDesc' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, Txt_TopBarTitle) == 0x000620, "Member 'UW_SquadManagement_InvitePopupWidget_C::Txt_TopBarTitle' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, W_DecorationBuildMode_CategoryButton) == 0x000628, "Member 'UW_SquadManagement_InvitePopupWidget_C::W_DecorationBuildMode_CategoryButton' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, W_DecorationBuildMode_CategoryButton_1) == 0x000630, "Member 'UW_SquadManagement_InvitePopupWidget_C::W_DecorationBuildMode_CategoryButton_1' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, W_DecorationBuildMode_CategoryButton_2) == 0x000638, "Member 'UW_SquadManagement_InvitePopupWidget_C::W_DecorationBuildMode_CategoryButton_2' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, W_DecorationBuildMode_CategoryButton_3) == 0x000640, "Member 'UW_SquadManagement_InvitePopupWidget_C::W_DecorationBuildMode_CategoryButton_3' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, W_DecorationBuildMode_CategoryButton_4) == 0x000648, "Member 'UW_SquadManagement_InvitePopupWidget_C::W_DecorationBuildMode_CategoryButton_4' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, W_DecorationBuildMode_CategoryButton_5) == 0x000650, "Member 'UW_SquadManagement_InvitePopupWidget_C::W_DecorationBuildMode_CategoryButton_5' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, W_DecorationBuildMode_CategoryButton_6) == 0x000658, "Member 'UW_SquadManagement_InvitePopupWidget_C::W_DecorationBuildMode_CategoryButton_6' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, W_DecorationBuildMode_CategoryButton_7) == 0x000660, "Member 'UW_SquadManagement_InvitePopupWidget_C::W_DecorationBuildMode_CategoryButton_7' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, W_DecorationBuildMode_CategoryButton_8) == 0x000668, "Member 'UW_SquadManagement_InvitePopupWidget_C::W_DecorationBuildMode_CategoryButton_8' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, W_DecorationBuildMode_CategoryButton_9) == 0x000670, "Member 'UW_SquadManagement_InvitePopupWidget_C::W_DecorationBuildMode_CategoryButton_9' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, W_DecorationBuildMode_CategoryButton_10) == 0x000678, "Member 'UW_SquadManagement_InvitePopupWidget_C::W_DecorationBuildMode_CategoryButton_10' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, W_DecorationBuildMode_CategoryButton_11) == 0x000680, "Member 'UW_SquadManagement_InvitePopupWidget_C::W_DecorationBuildMode_CategoryButton_11' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, W_DecorationBuildMode_CategoryButton_12) == 0x000688, "Member 'UW_SquadManagement_InvitePopupWidget_C::W_DecorationBuildMode_CategoryButton_12' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, W_DecorationBuildMode_CategoryButton_13) == 0x000690, "Member 'UW_SquadManagement_InvitePopupWidget_C::W_DecorationBuildMode_CategoryButton_13' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, W_DecorationBuildMode_CategoryButton_14) == 0x000698, "Member 'UW_SquadManagement_InvitePopupWidget_C::W_DecorationBuildMode_CategoryButton_14' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_InvitePopupWidget_C, W_DecorationBuildMode_CategoryButton_15) == 0x0006A0, "Member 'UW_SquadManagement_InvitePopupWidget_C::W_DecorationBuildMode_CategoryButton_15' has a wrong offset!");

}

