#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SquadManagement_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SquadManagement_Button.W_SquadManagement_Button_C
// 0x0068 (0x0340 - 0x02D8)
class UW_SquadManagement_Button_C final : public UP2SquadManagementButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_SquadManagementBtnBg;                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_SquadManagementBtnIcon;                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_SquadManagementBtnOutline;                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_SquadManagementBtn;                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_BtnUnderline;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SquadManagementBtnIcon;                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              SclB_SquadManagementBtnIcon;                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_SquadManagementBtn;                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_SquadManagementBtnIcon;                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_SquadManagementBtn;                            // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             BtnIcon;                                           // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         BtnType;                                           // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBlueBtn;                                         // 0x033C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void Destruct()	 // 0xae1e64;
	void ExecuteUbergraph_W_SquadManagement_Button(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void Set_Btn_Style(int32 BtnType_0, bool IsBlueBtn_0)	 // 0xae1e64;
	void SetBtnInfo(class UTexture2D* BtnIcon_0, const class FText& BtnTitle_0)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_SquadManagement_Button_C">();
	}
	static class UW_SquadManagement_Button_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_SquadManagement_Button_C>();
	}
};
static_assert(alignof(UW_SquadManagement_Button_C) == 0x000008, "Wrong alignment on UW_SquadManagement_Button_C");
static_assert(sizeof(UW_SquadManagement_Button_C) == 0x000340, "Wrong size on UW_SquadManagement_Button_C");
static_assert(offsetof(UW_SquadManagement_Button_C, UberGraphFrame) == 0x0002D8, "Member 'UW_SquadManagement_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_Button_C, Bdr_SquadManagementBtnBg) == 0x0002E0, "Member 'UW_SquadManagement_Button_C::Bdr_SquadManagementBtnBg' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_Button_C, Bdr_SquadManagementBtnIcon) == 0x0002E8, "Member 'UW_SquadManagement_Button_C::Bdr_SquadManagementBtnIcon' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_Button_C, Bdr_SquadManagementBtnOutline) == 0x0002F0, "Member 'UW_SquadManagement_Button_C::Bdr_SquadManagementBtnOutline' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_Button_C, HB_SquadManagementBtn) == 0x0002F8, "Member 'UW_SquadManagement_Button_C::HB_SquadManagementBtn' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_Button_C, Img_BtnUnderline) == 0x000300, "Member 'UW_SquadManagement_Button_C::Img_BtnUnderline' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_Button_C, Img_SquadManagementBtnIcon) == 0x000308, "Member 'UW_SquadManagement_Button_C::Img_SquadManagementBtnIcon' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_Button_C, SclB_SquadManagementBtnIcon) == 0x000310, "Member 'UW_SquadManagement_Button_C::SclB_SquadManagementBtnIcon' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_Button_C, SzB_SquadManagementBtn) == 0x000318, "Member 'UW_SquadManagement_Button_C::SzB_SquadManagementBtn' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_Button_C, SzB_SquadManagementBtnIcon) == 0x000320, "Member 'UW_SquadManagement_Button_C::SzB_SquadManagementBtnIcon' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_Button_C, Txt_SquadManagementBtn) == 0x000328, "Member 'UW_SquadManagement_Button_C::Txt_SquadManagementBtn' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_Button_C, BtnIcon) == 0x000330, "Member 'UW_SquadManagement_Button_C::BtnIcon' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_Button_C, BtnType) == 0x000338, "Member 'UW_SquadManagement_Button_C::BtnType' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_Button_C, IsBlueBtn) == 0x00033C, "Member 'UW_SquadManagement_Button_C::IsBlueBtn' has a wrong offset!");

}

