#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SquadManagement_PlayerWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_SquadManagement_PlayerWidget.W_SquadManagement_PlayerWidget_C.ExecuteUbergraph_W_SquadManagement_PlayerWidget
// 0x0008 (0x0008 - 0x0000)
struct W_SquadManagement_PlayerWidget_C_ExecuteUbergraph_W_SquadManagement_PlayerWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SquadManagement_PlayerWidget_C_ExecuteUbergraph_W_SquadManagement_PlayerWidget) == 0x000004, "Wrong alignment on W_SquadManagement_PlayerWidget_C_ExecuteUbergraph_W_SquadManagement_PlayerWidget");
static_assert(sizeof(W_SquadManagement_PlayerWidget_C_ExecuteUbergraph_W_SquadManagement_PlayerWidget) == 0x000008, "Wrong size on W_SquadManagement_PlayerWidget_C_ExecuteUbergraph_W_SquadManagement_PlayerWidget");
static_assert(offsetof(W_SquadManagement_PlayerWidget_C_ExecuteUbergraph_W_SquadManagement_PlayerWidget, EntryPoint) == 0x000000, "Member 'W_SquadManagement_PlayerWidget_C_ExecuteUbergraph_W_SquadManagement_PlayerWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_SquadManagement_PlayerWidget_C_ExecuteUbergraph_W_SquadManagement_PlayerWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_SquadManagement_PlayerWidget_C_ExecuteUbergraph_W_SquadManagement_PlayerWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_SquadManagement_PlayerWidget.W_SquadManagement_PlayerWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_SquadManagement_PlayerWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SquadManagement_PlayerWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_SquadManagement_PlayerWidget_C_PreConstruct");
static_assert(sizeof(W_SquadManagement_PlayerWidget_C_PreConstruct) == 0x000001, "Wrong size on W_SquadManagement_PlayerWidget_C_PreConstruct");
static_assert(offsetof(W_SquadManagement_PlayerWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_SquadManagement_PlayerWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_SquadManagement_PlayerWidget.W_SquadManagement_PlayerWidget_C.SetReadyIcon
// 0x0001 (0x0001 - 0x0000)
struct W_SquadManagement_PlayerWidget_C_SetReadyIcon final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SquadManagement_PlayerWidget_C_SetReadyIcon) == 0x000001, "Wrong alignment on W_SquadManagement_PlayerWidget_C_SetReadyIcon");
static_assert(sizeof(W_SquadManagement_PlayerWidget_C_SetReadyIcon) == 0x000001, "Wrong size on W_SquadManagement_PlayerWidget_C_SetReadyIcon");
static_assert(offsetof(W_SquadManagement_PlayerWidget_C_SetReadyIcon, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'W_SquadManagement_PlayerWidget_C_SetReadyIcon::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

