#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SquadListWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_SquadListWidget.W_SquadListWidget_C.ExecuteUbergraph_W_SquadListWidget
// 0x0228 (0x0228 - 0x0000)
struct W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x002C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0040(0x0014)()
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0084(0x0014)()
	struct FMargin                                K2Node_MakeStruct_Margin_3;                        // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_4;                        // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_5;                        // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_6;                        // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_7;                        // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_8;                        // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x00F8(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_6;                    // 0x010C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_7;                    // 0x0120(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_8;                    // 0x0134(0x0014)()
	class USizeBoxSlot*                           CallFunc_SlotAsSizeBoxSlot_ReturnValue;            // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_9;                    // 0x0150(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USizeBoxSlot*                           CallFunc_SlotAsSizeBoxSlot_ReturnValue_1;          // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_10;                   // 0x0170(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_11;                   // 0x0184(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_12;                   // 0x0198(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_13;                   // 0x01AC(0x0014)()
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USizeBoxSlot*                           CallFunc_SlotAsSizeBoxSlot_ReturnValue_2;          // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_14;                   // 0x01D8(0x0014)()
	struct FMargin                                K2Node_MakeStruct_Margin_9;                        // 0x01EC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDead;                               // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDbnoStageTwo;                       // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDbnoStageOne;                       // 0x01FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsHideout;                           // 0x01FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USizeBoxSlot*                           CallFunc_SlotAsSizeBoxSlot_ReturnValue_3;          // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_15;                   // 0x0208(0x0014)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x021D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x021E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x021F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget) == 0x000008, "Wrong alignment on W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget");
static_assert(sizeof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget) == 0x000228, "Wrong size on W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, EntryPoint) == 0x000000, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_SlateColor_2) == 0x00002C, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_SlateColor_3) == 0x000040, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_Margin) == 0x000054, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_Margin_1) == 0x000064, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_Margin_2) == 0x000074, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_SlateColor_4) == 0x000084, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_Margin_3) == 0x000098, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_Margin_3' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_Margin_4) == 0x0000A8, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_Margin_4' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_Margin_5) == 0x0000B8, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_Margin_5' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_Margin_6) == 0x0000C8, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_Margin_6' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_Margin_7) == 0x0000D8, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_Margin_7' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_Margin_8) == 0x0000E8, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_Margin_8' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_SlateColor_5) == 0x0000F8, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_SlateColor_6) == 0x00010C, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_SlateColor_6' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_SlateColor_7) == 0x000120, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_SlateColor_7' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_SlateColor_8) == 0x000134, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_SlateColor_8' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, CallFunc_SlotAsSizeBoxSlot_ReturnValue) == 0x000148, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::CallFunc_SlotAsSizeBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_SlateColor_9) == 0x000150, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_SlateColor_9' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_Event_IsDesignTime) == 0x000164, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, CallFunc_SlotAsSizeBoxSlot_ReturnValue_1) == 0x000168, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::CallFunc_SlotAsSizeBoxSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_SlateColor_10) == 0x000170, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_SlateColor_10' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_SlateColor_11) == 0x000184, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_SlateColor_11' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_SlateColor_12) == 0x000198, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_SlateColor_12' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_SlateColor_13) == 0x0001AC, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_SlateColor_13' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0001C0, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x0001C8, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, CallFunc_SlotAsSizeBoxSlot_ReturnValue_2) == 0x0001D0, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::CallFunc_SlotAsSizeBoxSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_SlateColor_14) == 0x0001D8, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_SlateColor_14' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_Margin_9) == 0x0001EC, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_Margin_9' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_Event_IsDead) == 0x0001FC, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_Event_IsDead' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_Event_IsDbnoStageTwo) == 0x0001FD, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_Event_IsDbnoStageTwo' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_Event_IsDbnoStageOne) == 0x0001FE, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_Event_IsDbnoStageOne' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_Event_bIsHideout) == 0x0001FF, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_Event_bIsHideout' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, CallFunc_SlotAsSizeBoxSlot_ReturnValue_3) == 0x000200, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::CallFunc_SlotAsSizeBoxSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_MakeStruct_SlateColor_15) == 0x000208, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_MakeStruct_SlateColor_15' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_SwitchEnum_CmpSuccess) == 0x00021C, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_SwitchEnum_CmpSuccess_1) == 0x00021D, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, K2Node_SwitchEnum_CmpSuccess_2) == 0x00021E, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, CallFunc_GetVisibility_ReturnValue) == 0x00021F, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000220, "Member 'W_SquadListWidget_C_ExecuteUbergraph_W_SquadListWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function W_SquadListWidget.W_SquadListWidget_C.OnUpdateSquadListItem_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_SquadListWidget_C_OnUpdateSquadListItem_ImplementableEvent final
{
public:
	bool                                          bIsHideout;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SquadListWidget_C_OnUpdateSquadListItem_ImplementableEvent) == 0x000001, "Wrong alignment on W_SquadListWidget_C_OnUpdateSquadListItem_ImplementableEvent");
static_assert(sizeof(W_SquadListWidget_C_OnUpdateSquadListItem_ImplementableEvent) == 0x000001, "Wrong size on W_SquadListWidget_C_OnUpdateSquadListItem_ImplementableEvent");
static_assert(offsetof(W_SquadListWidget_C_OnUpdateSquadListItem_ImplementableEvent, bIsHideout) == 0x000000, "Member 'W_SquadListWidget_C_OnUpdateSquadListItem_ImplementableEvent::bIsHideout' has a wrong offset!");

// Function W_SquadListWidget.W_SquadListWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_SquadListWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SquadListWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_SquadListWidget_C_PreConstruct");
static_assert(sizeof(W_SquadListWidget_C_PreConstruct) == 0x000001, "Wrong size on W_SquadListWidget_C_PreConstruct");
static_assert(offsetof(W_SquadListWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_SquadListWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_SquadListWidget.W_SquadListWidget_C.UpdateTextColor
// 0x0003 (0x0003 - 0x0000)
struct W_SquadListWidget_C_UpdateTextColor final
{
public:
	bool                                          IsDead;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDbnoStageTwo;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDbnoStageOne;                                    // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SquadListWidget_C_UpdateTextColor) == 0x000001, "Wrong alignment on W_SquadListWidget_C_UpdateTextColor");
static_assert(sizeof(W_SquadListWidget_C_UpdateTextColor) == 0x000003, "Wrong size on W_SquadListWidget_C_UpdateTextColor");
static_assert(offsetof(W_SquadListWidget_C_UpdateTextColor, IsDead) == 0x000000, "Member 'W_SquadListWidget_C_UpdateTextColor::IsDead' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_UpdateTextColor, IsDbnoStageTwo) == 0x000001, "Member 'W_SquadListWidget_C_UpdateTextColor::IsDbnoStageTwo' has a wrong offset!");
static_assert(offsetof(W_SquadListWidget_C_UpdateTextColor, IsDbnoStageOne) == 0x000002, "Member 'W_SquadListWidget_C_UpdateTextColor::IsDbnoStageOne' has a wrong offset!");

}

