#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SquadListWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SquadListWidget.W_SquadListWidget_C
// 0x0610 (0x0970 - 0x0360)
class UW_SquadListWidget_C final : public UP2SquadListWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_DbnoBannerBg;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_PlayerName_Glow;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_StateBannerBg;                                 // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_StateBg;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_StateOutline;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_BgPattern;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_StateIcon;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvB_SquadList;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ovr_StateArea;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_BgPattern;                                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_SquadList;                                     // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_State;                                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_StateBanner;                                   // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_StateMessage;                                  // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_3D8[0x8];                                      // 0x03D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            DbnoStageTwoStateOutlineBrush;                     // 0x03E0(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            NoOutlineBrush;                                    // 0x04B0(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            HideoutOutlineBrush;                               // 0x0580(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateFontInfo                         SelfPlayerNameFont;                                // 0x0650(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         DefaultPlayerNameFont;                             // 0x06A8(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateBrush                            DeadStateOutlineBrush;                             // 0x0700(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            DbnoStateOutlineBrush;                             // 0x07D0(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            NormalStateOutlineBrush;                           // 0x08A0(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_W_SquadListWidget(int32 EntryPoint)	 // 0xae1e64;
	void OnUpdateSquadListItem_ImplementableEvent(bool bIsHideout)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void UpdateTextColor(bool IsDead, bool IsDbnoStageTwo, bool IsDbnoStageOne)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_SquadListWidget_C">();
	}
	static class UW_SquadListWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_SquadListWidget_C>();
	}
};
static_assert(alignof(UW_SquadListWidget_C) == 0x000010, "Wrong alignment on UW_SquadListWidget_C");
static_assert(sizeof(UW_SquadListWidget_C) == 0x000970, "Wrong size on UW_SquadListWidget_C");
static_assert(offsetof(UW_SquadListWidget_C, UberGraphFrame) == 0x000360, "Member 'UW_SquadListWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SquadListWidget_C, Bdr_DbnoBannerBg) == 0x000368, "Member 'UW_SquadListWidget_C::Bdr_DbnoBannerBg' has a wrong offset!");
static_assert(offsetof(UW_SquadListWidget_C, Bdr_PlayerName_Glow) == 0x000370, "Member 'UW_SquadListWidget_C::Bdr_PlayerName_Glow' has a wrong offset!");
static_assert(offsetof(UW_SquadListWidget_C, Bdr_StateBannerBg) == 0x000378, "Member 'UW_SquadListWidget_C::Bdr_StateBannerBg' has a wrong offset!");
static_assert(offsetof(UW_SquadListWidget_C, Bdr_StateBg) == 0x000380, "Member 'UW_SquadListWidget_C::Bdr_StateBg' has a wrong offset!");
static_assert(offsetof(UW_SquadListWidget_C, Bdr_StateOutline) == 0x000388, "Member 'UW_SquadListWidget_C::Bdr_StateOutline' has a wrong offset!");
static_assert(offsetof(UW_SquadListWidget_C, Img_BgPattern) == 0x000390, "Member 'UW_SquadListWidget_C::Img_BgPattern' has a wrong offset!");
static_assert(offsetof(UW_SquadListWidget_C, Img_StateIcon) == 0x000398, "Member 'UW_SquadListWidget_C::Img_StateIcon' has a wrong offset!");
static_assert(offsetof(UW_SquadListWidget_C, InvB_SquadList) == 0x0003A0, "Member 'UW_SquadListWidget_C::InvB_SquadList' has a wrong offset!");
static_assert(offsetof(UW_SquadListWidget_C, Ovr_StateArea) == 0x0003A8, "Member 'UW_SquadListWidget_C::Ovr_StateArea' has a wrong offset!");
static_assert(offsetof(UW_SquadListWidget_C, SzB_BgPattern) == 0x0003B0, "Member 'UW_SquadListWidget_C::SzB_BgPattern' has a wrong offset!");
static_assert(offsetof(UW_SquadListWidget_C, SzB_SquadList) == 0x0003B8, "Member 'UW_SquadListWidget_C::SzB_SquadList' has a wrong offset!");
static_assert(offsetof(UW_SquadListWidget_C, SzB_State) == 0x0003C0, "Member 'UW_SquadListWidget_C::SzB_State' has a wrong offset!");
static_assert(offsetof(UW_SquadListWidget_C, SzB_StateBanner) == 0x0003C8, "Member 'UW_SquadListWidget_C::SzB_StateBanner' has a wrong offset!");
static_assert(offsetof(UW_SquadListWidget_C, Txt_StateMessage) == 0x0003D0, "Member 'UW_SquadListWidget_C::Txt_StateMessage' has a wrong offset!");
static_assert(offsetof(UW_SquadListWidget_C, DbnoStageTwoStateOutlineBrush) == 0x0003E0, "Member 'UW_SquadListWidget_C::DbnoStageTwoStateOutlineBrush' has a wrong offset!");
static_assert(offsetof(UW_SquadListWidget_C, NoOutlineBrush) == 0x0004B0, "Member 'UW_SquadListWidget_C::NoOutlineBrush' has a wrong offset!");
static_assert(offsetof(UW_SquadListWidget_C, HideoutOutlineBrush) == 0x000580, "Member 'UW_SquadListWidget_C::HideoutOutlineBrush' has a wrong offset!");
static_assert(offsetof(UW_SquadListWidget_C, SelfPlayerNameFont) == 0x000650, "Member 'UW_SquadListWidget_C::SelfPlayerNameFont' has a wrong offset!");
static_assert(offsetof(UW_SquadListWidget_C, DefaultPlayerNameFont) == 0x0006A8, "Member 'UW_SquadListWidget_C::DefaultPlayerNameFont' has a wrong offset!");
static_assert(offsetof(UW_SquadListWidget_C, DeadStateOutlineBrush) == 0x000700, "Member 'UW_SquadListWidget_C::DeadStateOutlineBrush' has a wrong offset!");
static_assert(offsetof(UW_SquadListWidget_C, DbnoStateOutlineBrush) == 0x0007D0, "Member 'UW_SquadListWidget_C::DbnoStateOutlineBrush' has a wrong offset!");
static_assert(offsetof(UW_SquadListWidget_C, NormalStateOutlineBrush) == 0x0008A0, "Member 'UW_SquadListWidget_C::NormalStateOutlineBrush' has a wrong offset!");

}

