#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SquadIndicatorWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SquadIndicatorWidget.W_SquadIndicatorWidget_C
// 0x0020 (0x0420 - 0x0400)
class UW_SquadIndicatorWidget_C final : public UP2SquadIndicatorWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_DiaEffect01;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_DiaEffect02;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_Main;                                  // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_SquadIndicatorWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_SquadIndicatorWidget_C">();
	}
	static class UW_SquadIndicatorWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_SquadIndicatorWidget_C>();
	}
};
static_assert(alignof(UW_SquadIndicatorWidget_C) == 0x000008, "Wrong alignment on UW_SquadIndicatorWidget_C");
static_assert(sizeof(UW_SquadIndicatorWidget_C) == 0x000420, "Wrong size on UW_SquadIndicatorWidget_C");
static_assert(offsetof(UW_SquadIndicatorWidget_C, UberGraphFrame) == 0x000400, "Member 'UW_SquadIndicatorWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SquadIndicatorWidget_C, Img_DiaEffect01) == 0x000408, "Member 'UW_SquadIndicatorWidget_C::Img_DiaEffect01' has a wrong offset!");
static_assert(offsetof(UW_SquadIndicatorWidget_C, Img_DiaEffect02) == 0x000410, "Member 'UW_SquadIndicatorWidget_C::Img_DiaEffect02' has a wrong offset!");
static_assert(offsetof(UW_SquadIndicatorWidget_C, RetainerBox_Main) == 0x000418, "Member 'UW_SquadIndicatorWidget_C::RetainerBox_Main' has a wrong offset!");

}

