#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SquadManagement_ContextMenuWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SquadManagement_ContextMenuWidget.W_SquadManagement_ContextMenuWidget_C
// 0x0068 (0x0670 - 0x0608)
class UW_SquadManagement_ContextMenuWidget_C final : public UP2SquadContextMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_HighPing;                                      // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_Status;                                        // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_HighPing;                                      // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_StatusDot;                                     // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Status;                                        // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_PlayerLevel;                                   // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_PlayerName;                                    // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Status;                                        // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   PlayerName;                                        // 0x0650(0x0018)(Edit, BlueprintVisible)
	int32                                         PlayerLevel;                                       // 0x0668(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerStateInt;                                    // 0x066C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_SquadManagement_ContextMenuWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void RefreshSquadContextMenuOnBP(const struct FP2SquadContextMenuData& InData)	 // 0xae1e64;
	void SetPlayerInfo(const class FText& PlayerName_0, int32 PlayerLevel_0)	 // 0xae1e64;
	void SetPlayerPing(int32 PlayerPing)	 // 0xae1e64;
	void SetPlayerState(int32 PlayerStateInt_0)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_SquadManagement_ContextMenuWidget_C">();
	}
	static class UW_SquadManagement_ContextMenuWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_SquadManagement_ContextMenuWidget_C>();
	}
};
static_assert(alignof(UW_SquadManagement_ContextMenuWidget_C) == 0x000008, "Wrong alignment on UW_SquadManagement_ContextMenuWidget_C");
static_assert(sizeof(UW_SquadManagement_ContextMenuWidget_C) == 0x000670, "Wrong size on UW_SquadManagement_ContextMenuWidget_C");
static_assert(offsetof(UW_SquadManagement_ContextMenuWidget_C, UberGraphFrame) == 0x000608, "Member 'UW_SquadManagement_ContextMenuWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_ContextMenuWidget_C, Bdr_HighPing) == 0x000610, "Member 'UW_SquadManagement_ContextMenuWidget_C::Bdr_HighPing' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_ContextMenuWidget_C, Bdr_Status) == 0x000618, "Member 'UW_SquadManagement_ContextMenuWidget_C::Bdr_Status' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_ContextMenuWidget_C, Img_HighPing) == 0x000620, "Member 'UW_SquadManagement_ContextMenuWidget_C::Img_HighPing' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_ContextMenuWidget_C, Img_StatusDot) == 0x000628, "Member 'UW_SquadManagement_ContextMenuWidget_C::Img_StatusDot' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_ContextMenuWidget_C, SzB_Status) == 0x000630, "Member 'UW_SquadManagement_ContextMenuWidget_C::SzB_Status' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_ContextMenuWidget_C, Txt_PlayerLevel) == 0x000638, "Member 'UW_SquadManagement_ContextMenuWidget_C::Txt_PlayerLevel' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_ContextMenuWidget_C, Txt_PlayerName) == 0x000640, "Member 'UW_SquadManagement_ContextMenuWidget_C::Txt_PlayerName' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_ContextMenuWidget_C, Txt_Status) == 0x000648, "Member 'UW_SquadManagement_ContextMenuWidget_C::Txt_Status' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_ContextMenuWidget_C, PlayerName) == 0x000650, "Member 'UW_SquadManagement_ContextMenuWidget_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_ContextMenuWidget_C, PlayerLevel) == 0x000668, "Member 'UW_SquadManagement_ContextMenuWidget_C::PlayerLevel' has a wrong offset!");
static_assert(offsetof(UW_SquadManagement_ContextMenuWidget_C, PlayerStateInt) == 0x00066C, "Member 'UW_SquadManagement_ContextMenuWidget_C::PlayerStateInt' has a wrong offset!");

}

