#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SquadNoti

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SquadNoti.W_SquadNoti_C
// 0x0060 (0x02E0 - 0x0280)
class UW_SquadNoti_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TimeProgressAnim;                                  // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Init;                                              // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    Keyguide_Accept;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    Keyguide_Decline;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           PB_TimeBar;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RTxt_Main;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   PlayerName;                                        // 0x02C8(0x0018)(Edit, BlueprintVisible)

public:
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_SquadNoti(int32 EntryPoint)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_SquadNoti_C">();
	}
	static class UW_SquadNoti_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_SquadNoti_C>();
	}
};
static_assert(alignof(UW_SquadNoti_C) == 0x000008, "Wrong alignment on UW_SquadNoti_C");
static_assert(sizeof(UW_SquadNoti_C) == 0x0002E0, "Wrong size on UW_SquadNoti_C");
static_assert(offsetof(UW_SquadNoti_C, UberGraphFrame) == 0x000280, "Member 'UW_SquadNoti_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SquadNoti_C, TimeProgressAnim) == 0x000288, "Member 'UW_SquadNoti_C::TimeProgressAnim' has a wrong offset!");
static_assert(offsetof(UW_SquadNoti_C, FadeOutAnim) == 0x000290, "Member 'UW_SquadNoti_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UW_SquadNoti_C, FadeInAnim) == 0x000298, "Member 'UW_SquadNoti_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UW_SquadNoti_C, Init) == 0x0002A0, "Member 'UW_SquadNoti_C::Init' has a wrong offset!");
static_assert(offsetof(UW_SquadNoti_C, Keyguide_Accept) == 0x0002A8, "Member 'UW_SquadNoti_C::Keyguide_Accept' has a wrong offset!");
static_assert(offsetof(UW_SquadNoti_C, Keyguide_Decline) == 0x0002B0, "Member 'UW_SquadNoti_C::Keyguide_Decline' has a wrong offset!");
static_assert(offsetof(UW_SquadNoti_C, PB_TimeBar) == 0x0002B8, "Member 'UW_SquadNoti_C::PB_TimeBar' has a wrong offset!");
static_assert(offsetof(UW_SquadNoti_C, RTxt_Main) == 0x0002C0, "Member 'UW_SquadNoti_C::RTxt_Main' has a wrong offset!");
static_assert(offsetof(UW_SquadNoti_C, PlayerName) == 0x0002C8, "Member 'UW_SquadNoti_C::PlayerName' has a wrong offset!");

}

