#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SystemMenu_Hideout

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"
#include "UMG_structs.hpp"
#include "Game_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SystemMenu_Hideout.W_SystemMenu_Hideout_C
// 0x00E8 (0x08F0 - 0x0808)
class UW_SystemMenu_Hideout_C final : public UP2SystemMenu_Hideout
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0808(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBackgroundBlur*                        Blr_SystemMenu;                                    // 0x0810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_BtnIcon;                                       // 0x0818(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Logo_Discord;                                  // 0x0820(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Logo_Heybox;                                   // 0x0828(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Logo_X;                                        // 0x0830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_RegionIcon;                                    // 0x0838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Stroke_Discord;                                // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Stroke_Heybox;                                 // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Stroke_X;                                      // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Title_Line;                                    // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Underline_Discord;                             // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Underline_Heybox;                              // 0x0868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Underline_X;                                   // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Root;                                      // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_LeaderboardButton;                             // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_FacilityTitle;                                 // 0x0888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_AgeWarning_C*                        W_AgeWarning;                                      // 0x0890(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsPressedSystemMenu;                               // 0x0898(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isKeyCheckStart;                                   // 0x0899(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89A[0x6];                                      // 0x089A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           SetInputModeTimerHandle;                           // 0x08A0(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class FText                                   Txt_Popup_Body;                                    // 0x08A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Survey_Title;                                      // 0x08C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Survey_Body;                                       // 0x08D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ShowOrHideWidget_Implementable(ESlateVisibility InVisibility)	 // 0xae1e64;
	void SetVisibilityExitHideoutBTN()	 // 0xae1e64;
	void SetInputFocus()	 // 0xae1e64;
	void ReceivePressedExittoHideoutBtn(const TDelegate<void(EPopupButtonID ButtonID)>& InDelegateResumeBtn)	 // 0xae1e64;
	void ReceivePressedExitBtn(const TDelegate<void(EPopupButtonID ButtonID)>& InDelegateResumeBtn)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void OnClickedExitToDesktop(EPopupButtonID ButtonID)	 // 0xae1e64;
	void ExittoHideout()	 // 0xae1e64;
	void ExecuteUbergraph_W_SystemMenu_Hideout(int32 EntryPoint)	 // 0xae1e64;
	void Destruct()	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void BP_OnDeactivated()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_SystemMenu_Hideout_C">();
	}
	static class UW_SystemMenu_Hideout_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_SystemMenu_Hideout_C>();
	}
};
static_assert(alignof(UW_SystemMenu_Hideout_C) == 0x000008, "Wrong alignment on UW_SystemMenu_Hideout_C");
static_assert(sizeof(UW_SystemMenu_Hideout_C) == 0x0008F0, "Wrong size on UW_SystemMenu_Hideout_C");
static_assert(offsetof(UW_SystemMenu_Hideout_C, UberGraphFrame) == 0x000808, "Member 'UW_SystemMenu_Hideout_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, Blr_SystemMenu) == 0x000810, "Member 'UW_SystemMenu_Hideout_C::Blr_SystemMenu' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, Img_BtnIcon) == 0x000818, "Member 'UW_SystemMenu_Hideout_C::Img_BtnIcon' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, Img_Logo_Discord) == 0x000820, "Member 'UW_SystemMenu_Hideout_C::Img_Logo_Discord' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, Img_Logo_Heybox) == 0x000828, "Member 'UW_SystemMenu_Hideout_C::Img_Logo_Heybox' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, Img_Logo_X) == 0x000830, "Member 'UW_SystemMenu_Hideout_C::Img_Logo_X' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, Img_RegionIcon) == 0x000838, "Member 'UW_SystemMenu_Hideout_C::Img_RegionIcon' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, Img_Stroke_Discord) == 0x000840, "Member 'UW_SystemMenu_Hideout_C::Img_Stroke_Discord' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, Img_Stroke_Heybox) == 0x000848, "Member 'UW_SystemMenu_Hideout_C::Img_Stroke_Heybox' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, Img_Stroke_X) == 0x000850, "Member 'UW_SystemMenu_Hideout_C::Img_Stroke_X' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, Img_Title_Line) == 0x000858, "Member 'UW_SystemMenu_Hideout_C::Img_Title_Line' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, Img_Underline_Discord) == 0x000860, "Member 'UW_SystemMenu_Hideout_C::Img_Underline_Discord' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, Img_Underline_Heybox) == 0x000868, "Member 'UW_SystemMenu_Hideout_C::Img_Underline_Heybox' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, Img_Underline_X) == 0x000870, "Member 'UW_SystemMenu_Hideout_C::Img_Underline_X' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, Overlay_Root) == 0x000878, "Member 'UW_SystemMenu_Hideout_C::Overlay_Root' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, SzB_LeaderboardButton) == 0x000880, "Member 'UW_SystemMenu_Hideout_C::SzB_LeaderboardButton' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, Txt_FacilityTitle) == 0x000888, "Member 'UW_SystemMenu_Hideout_C::Txt_FacilityTitle' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, W_AgeWarning) == 0x000890, "Member 'UW_SystemMenu_Hideout_C::W_AgeWarning' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, IsPressedSystemMenu) == 0x000898, "Member 'UW_SystemMenu_Hideout_C::IsPressedSystemMenu' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, isKeyCheckStart) == 0x000899, "Member 'UW_SystemMenu_Hideout_C::isKeyCheckStart' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, SetInputModeTimerHandle) == 0x0008A0, "Member 'UW_SystemMenu_Hideout_C::SetInputModeTimerHandle' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, Txt_Popup_Body) == 0x0008A8, "Member 'UW_SystemMenu_Hideout_C::Txt_Popup_Body' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, Survey_Title) == 0x0008C0, "Member 'UW_SystemMenu_Hideout_C::Survey_Title' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_Hideout_C, Survey_Body) == 0x0008D8, "Member 'UW_SystemMenu_Hideout_C::Survey_Body' has a wrong offset!");

}

