#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SystemMenuButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SystemMenuButton.W_SystemMenuButton_C
// 0x0020 (0x02A8 - 0x0288)
class UW_SystemMenuButton_C final : public UP2SystemMenuButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Btn_HoverOutline;                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SystemMenuIcon;                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeybindWidget_C*                     W_KeybindWidget;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__W_SystemMenuButton_Btn_SystemMenu_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_SystemMenuButton_Btn_SystemMenu_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void ExecuteUbergraph_W_SystemMenuButton(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_SystemMenuButton_C">();
	}
	static class UW_SystemMenuButton_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_SystemMenuButton_C>();
	}
};
static_assert(alignof(UW_SystemMenuButton_C) == 0x000008, "Wrong alignment on UW_SystemMenuButton_C");
static_assert(sizeof(UW_SystemMenuButton_C) == 0x0002A8, "Wrong size on UW_SystemMenuButton_C");
static_assert(offsetof(UW_SystemMenuButton_C, UberGraphFrame) == 0x000288, "Member 'UW_SystemMenuButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SystemMenuButton_C, Img_Btn_HoverOutline) == 0x000290, "Member 'UW_SystemMenuButton_C::Img_Btn_HoverOutline' has a wrong offset!");
static_assert(offsetof(UW_SystemMenuButton_C, Img_SystemMenuIcon) == 0x000298, "Member 'UW_SystemMenuButton_C::Img_SystemMenuIcon' has a wrong offset!");
static_assert(offsetof(UW_SystemMenuButton_C, W_KeybindWidget) == 0x0002A0, "Member 'UW_SystemMenuButton_C::W_KeybindWidget' has a wrong offset!");

}

