#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SystemMenu_Hideout

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function W_SystemMenu_Hideout.W_SystemMenu_Hideout_C.ShowOrHideWidget_Implementable
// 0x0001 (0x0001 - 0x0000)
struct W_SystemMenu_Hideout_C_ShowOrHideWidget_Implementable final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemMenu_Hideout_C_ShowOrHideWidget_Implementable) == 0x000001, "Wrong alignment on W_SystemMenu_Hideout_C_ShowOrHideWidget_Implementable");
static_assert(sizeof(W_SystemMenu_Hideout_C_ShowOrHideWidget_Implementable) == 0x000001, "Wrong size on W_SystemMenu_Hideout_C_ShowOrHideWidget_Implementable");
static_assert(offsetof(W_SystemMenu_Hideout_C_ShowOrHideWidget_Implementable, InVisibility) == 0x000000, "Member 'W_SystemMenu_Hideout_C_ShowOrHideWidget_Implementable::InVisibility' has a wrong offset!");

// Function W_SystemMenu_Hideout.W_SystemMenu_Hideout_C.SetVisibilityExitHideoutBTN
// 0x0018 (0x0018 - 0x0000)
struct W_SystemMenu_Hideout_C_SetVisibilityExitHideoutBTN final
{
public:
	bool                                          CallFunc_IsHideout_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchStarted_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemMenu_Hideout_C_SetVisibilityExitHideoutBTN) == 0x000008, "Wrong alignment on W_SystemMenu_Hideout_C_SetVisibilityExitHideoutBTN");
static_assert(sizeof(W_SystemMenu_Hideout_C_SetVisibilityExitHideoutBTN) == 0x000018, "Wrong size on W_SystemMenu_Hideout_C_SetVisibilityExitHideoutBTN");
static_assert(offsetof(W_SystemMenu_Hideout_C_SetVisibilityExitHideoutBTN, CallFunc_IsHideout_ReturnValue) == 0x000000, "Member 'W_SystemMenu_Hideout_C_SetVisibilityExitHideoutBTN::CallFunc_IsHideout_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_SetVisibilityExitHideoutBTN, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'W_SystemMenu_Hideout_C_SetVisibilityExitHideoutBTN::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_SetVisibilityExitHideoutBTN, CallFunc_HasMatchStarted_ReturnValue) == 0x000010, "Member 'W_SystemMenu_Hideout_C_SetVisibilityExitHideoutBTN::CallFunc_HasMatchStarted_ReturnValue' has a wrong offset!");

// Function W_SystemMenu_Hideout.W_SystemMenu_Hideout_C.SetInputFocus
// 0x0018 (0x0018 - 0x0000)
struct W_SystemMenu_Hideout_C_SetInputFocus final
{
public:
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemMenu_Hideout_C_SetInputFocus) == 0x000008, "Wrong alignment on W_SystemMenu_Hideout_C_SetInputFocus");
static_assert(sizeof(W_SystemMenu_Hideout_C_SetInputFocus) == 0x000018, "Wrong size on W_SystemMenu_Hideout_C_SetInputFocus");
static_assert(offsetof(W_SystemMenu_Hideout_C_SetInputFocus, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000000, "Member 'W_SystemMenu_Hideout_C_SetInputFocus::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_SetInputFocus, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'W_SystemMenu_Hideout_C_SetInputFocus::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_SetInputFocus, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'W_SystemMenu_Hideout_C_SetInputFocus::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function W_SystemMenu_Hideout.W_SystemMenu_Hideout_C.ReceivePressedExittoHideoutBtn
// 0x0010 (0x0010 - 0x0000)
struct W_SystemMenu_Hideout_C_ReceivePressedExittoHideoutBtn final
{
public:
	TDelegate<void(EPopupButtonID ButtonID)>      InDelegateResumeBtn;                               // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemMenu_Hideout_C_ReceivePressedExittoHideoutBtn) == 0x000004, "Wrong alignment on W_SystemMenu_Hideout_C_ReceivePressedExittoHideoutBtn");
static_assert(sizeof(W_SystemMenu_Hideout_C_ReceivePressedExittoHideoutBtn) == 0x000010, "Wrong size on W_SystemMenu_Hideout_C_ReceivePressedExittoHideoutBtn");
static_assert(offsetof(W_SystemMenu_Hideout_C_ReceivePressedExittoHideoutBtn, InDelegateResumeBtn) == 0x000000, "Member 'W_SystemMenu_Hideout_C_ReceivePressedExittoHideoutBtn::InDelegateResumeBtn' has a wrong offset!");

// Function W_SystemMenu_Hideout.W_SystemMenu_Hideout_C.ReceivePressedExitBtn
// 0x0010 (0x0010 - 0x0000)
struct W_SystemMenu_Hideout_C_ReceivePressedExitBtn final
{
public:
	TDelegate<void(EPopupButtonID ButtonID)>      InDelegateResumeBtn;                               // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemMenu_Hideout_C_ReceivePressedExitBtn) == 0x000004, "Wrong alignment on W_SystemMenu_Hideout_C_ReceivePressedExitBtn");
static_assert(sizeof(W_SystemMenu_Hideout_C_ReceivePressedExitBtn) == 0x000010, "Wrong size on W_SystemMenu_Hideout_C_ReceivePressedExitBtn");
static_assert(offsetof(W_SystemMenu_Hideout_C_ReceivePressedExitBtn, InDelegateResumeBtn) == 0x000000, "Member 'W_SystemMenu_Hideout_C_ReceivePressedExitBtn::InDelegateResumeBtn' has a wrong offset!");

// Function W_SystemMenu_Hideout.W_SystemMenu_Hideout_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_SystemMenu_Hideout_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemMenu_Hideout_C_PreConstruct) == 0x000001, "Wrong alignment on W_SystemMenu_Hideout_C_PreConstruct");
static_assert(sizeof(W_SystemMenu_Hideout_C_PreConstruct) == 0x000001, "Wrong size on W_SystemMenu_Hideout_C_PreConstruct");
static_assert(offsetof(W_SystemMenu_Hideout_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_SystemMenu_Hideout_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_SystemMenu_Hideout.W_SystemMenu_Hideout_C.OnClickedExitToDesktop
// 0x0001 (0x0001 - 0x0000)
struct W_SystemMenu_Hideout_C_OnClickedExitToDesktop final
{
public:
	EPopupButtonID                                ButtonID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemMenu_Hideout_C_OnClickedExitToDesktop) == 0x000001, "Wrong alignment on W_SystemMenu_Hideout_C_OnClickedExitToDesktop");
static_assert(sizeof(W_SystemMenu_Hideout_C_OnClickedExitToDesktop) == 0x000001, "Wrong size on W_SystemMenu_Hideout_C_OnClickedExitToDesktop");
static_assert(offsetof(W_SystemMenu_Hideout_C_OnClickedExitToDesktop, ButtonID) == 0x000000, "Member 'W_SystemMenu_Hideout_C_OnClickedExitToDesktop::ButtonID' has a wrong offset!");

// Function W_SystemMenu_Hideout.W_SystemMenu_Hideout_C.ExittoHideout
// 0x0018 (0x0018 - 0x0000)
struct W_SystemMenu_Hideout_C_ExittoHideout final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemMenu_Hideout_C_ExittoHideout) == 0x000008, "Wrong alignment on W_SystemMenu_Hideout_C_ExittoHideout");
static_assert(sizeof(W_SystemMenu_Hideout_C_ExittoHideout) == 0x000018, "Wrong size on W_SystemMenu_Hideout_C_ExittoHideout");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExittoHideout, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'W_SystemMenu_Hideout_C_ExittoHideout::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExittoHideout, K2Node_DynamicCast_AsP2Player_Controller) == 0x000008, "Member 'W_SystemMenu_Hideout_C_ExittoHideout::K2Node_DynamicCast_AsP2Player_Controller' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExittoHideout, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'W_SystemMenu_Hideout_C_ExittoHideout::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function W_SystemMenu_Hideout.W_SystemMenu_Hideout_C.ExecuteUbergraph_W_SystemMenu_Hideout
// 0x01B0 (0x01B0 - 0x0000)
struct W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0010(0x0018)()
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0038(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0050(0x0018)()
	TDelegate<void(EPopupButtonID ButtonID)>      K2Node_Event_InDelegateResumeBtn_1;                // 0x0068(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0088(0x0018)()
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller_1;        // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_ShowPopup_ReturnValue;                    // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasPlayerExfiltratedFromRaid_ReturnValue; // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Event_InVisibility;                         // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x00C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_1;     // 0x00D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPopupButtonID ButtonID)>      K2Node_Event_InDelegateResumeBtn;                  // 0x00E0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x00F0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_5;            // 0x0108(0x0018)()
	TDelegate<void(EPopupButtonID ButtonID)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLayerZOrder_ReturnValue;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_6;            // 0x0138(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_7;            // 0x0158(0x0018)()
	class UUserWidget*                            CallFunc_ShowPopup_ReturnValue_1;                  // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPopupButtonID                                K2Node_CustomEvent_ButtonID;                       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerState*                         K2Node_DynamicCast_AsP2Player_State;               // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_ShowPopup_ReturnValue_2;                  // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFirstLogout_ReturnValue;                // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout) == 0x000008, "Wrong alignment on W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout");
static_assert(sizeof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout) == 0x0001B0, "Wrong size on W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, EntryPoint) == 0x000000, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_MakeLiteralText_ReturnValue) == 0x000010, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, K2Node_DynamicCast_AsP2Player_Controller) == 0x000028, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::K2Node_DynamicCast_AsP2Player_Controller' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000038, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000050, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, K2Node_Event_InDelegateResumeBtn_1) == 0x000068, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::K2Node_Event_InDelegateResumeBtn_1' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, K2Node_Event_IsDesignTime) == 0x000078, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_GetOwningPlayer_ReturnValue) == 0x000080, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_MakeLiteralText_ReturnValue_3) == 0x000088, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, K2Node_DynamicCast_AsP2Player_Controller_1) == 0x0000A0, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::K2Node_DynamicCast_AsP2Player_Controller_1' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_ShowPopup_ReturnValue) == 0x0000B0, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_ShowPopup_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_WasPlayerExfiltratedFromRaid_ReturnValue) == 0x0000B8, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_WasPlayerExfiltratedFromRaid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, K2Node_Event_InVisibility) == 0x0000B9, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::K2Node_Event_InVisibility' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0000C0, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x0000C8, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x0000D0, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_MakeLiteralGameplayTag_ReturnValue_1) == 0x0000D8, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_MakeLiteralGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, K2Node_Event_InDelegateResumeBtn) == 0x0000E0, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::K2Node_Event_InDelegateResumeBtn' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_MakeLiteralText_ReturnValue_4) == 0x0000F0, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_MakeLiteralText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_MakeLiteralText_ReturnValue_5) == 0x000108, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_MakeLiteralText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, K2Node_CreateDelegate_OutputDelegate) == 0x000120, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_GetLayerZOrder_ReturnValue) == 0x000130, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_GetLayerZOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_MakeLiteralText_ReturnValue_6) == 0x000138, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_MakeLiteralText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_Add_IntInt_ReturnValue) == 0x000150, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_MakeLiteralText_ReturnValue_7) == 0x000158, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_MakeLiteralText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_ShowPopup_ReturnValue_1) == 0x000170, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_ShowPopup_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_GetPlayerController_ReturnValue_1) == 0x000178, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, K2Node_CustomEvent_ButtonID) == 0x000180, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::K2Node_CustomEvent_ButtonID' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000188, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, K2Node_DynamicCast_AsP2Player_State) == 0x000190, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::K2Node_DynamicCast_AsP2Player_State' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, K2Node_DynamicCast_bSuccess_2) == 0x000198, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_ShowPopup_ReturnValue_2) == 0x0001A0, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_ShowPopup_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout, CallFunc_IsFirstLogout_ReturnValue) == 0x0001A8, "Member 'W_SystemMenu_Hideout_C_ExecuteUbergraph_W_SystemMenu_Hideout::CallFunc_IsFirstLogout_ReturnValue' has a wrong offset!");

}

