#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SystemMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function W_SystemMenu.W_SystemMenu_C.ExecuteUbergraph_W_SystemMenu
// 0x0208 (0x0208 - 0x0000)
struct W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPopupButtonID ButtonID)>      K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0030(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0048(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0060(0x0018)()
	TDelegate<void(EPopupButtonID ButtonID)>      K2Node_Event_InDelegateResumeBtn_1;                // 0x0078(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0098(0x0018)()
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller_1;        // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2PlayerState*                         CallFunc_GetP2PlayerState_ReturnValue;             // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerDead_IsDead;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInTutorial_ReturnValue;              // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasPlayerExfiltratedFromRaid_ReturnValue; // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Event_InVisibility;                         // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x00D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_1;     // 0x00E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLayerZOrder_ReturnValue;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPopupButtonID ButtonID)>      K2Node_Event_InDelegateResumeBtn;                  // 0x00F8(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x0110(0x0018)()
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2PlayerState*                         K2Node_DynamicCast_AsP2Player_State;               // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFirstLogout_ReturnValue;                // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDeadOrDying_ReturnValue;                // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_5;            // 0x0148(0x0018)()
	int32                                         CallFunc_GetLayerZOrder_ReturnValue_1;             // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_6;            // 0x0168(0x0018)()
	class UUserWidget*                            CallFunc_ShowPopup_ReturnValue;                    // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0188(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_7;            // 0x01A0(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x01B8(0x0018)(ConstParm)
	class UUserWidget*                            CallFunc_ShowPopup_ReturnValue_1;                  // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_8;            // 0x01D8(0x0018)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_ShowPopup_ReturnValue_2;                  // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPopupButtonID                                K2Node_CustomEvent_ButtonID;                       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu) == 0x000008, "Wrong alignment on W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu");
static_assert(sizeof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu) == 0x000208, "Wrong size on W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, EntryPoint) == 0x000000, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, K2Node_DynamicCast_AsP2Player_Controller) == 0x000010, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::K2Node_DynamicCast_AsP2Player_Controller' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, K2Node_Event_IsDesignTime) == 0x00002C, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_MakeLiteralText_ReturnValue) == 0x000030, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000048, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000060, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, K2Node_Event_InDelegateResumeBtn_1) == 0x000078, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::K2Node_Event_InDelegateResumeBtn_1' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, Temp_bool_Variable) == 0x000088, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_GetOwningPlayer_ReturnValue) == 0x000090, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_MakeLiteralText_ReturnValue_3) == 0x000098, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, K2Node_DynamicCast_AsP2Player_Controller_1) == 0x0000B0, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::K2Node_DynamicCast_AsP2Player_Controller_1' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_GetP2PlayerState_ReturnValue) == 0x0000C0, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_GetP2PlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_IsPlayerDead_IsDead) == 0x0000C8, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_IsPlayerDead_IsDead' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_GetIsInTutorial_ReturnValue) == 0x0000C9, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_GetIsInTutorial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_WasPlayerExfiltratedFromRaid_ReturnValue) == 0x0000CA, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_WasPlayerExfiltratedFromRaid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_BooleanOR_ReturnValue) == 0x0000CB, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, K2Node_Event_InVisibility) == 0x0000CC, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::K2Node_Event_InVisibility' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0000D0, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x0000D8, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x0000E0, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_MakeLiteralGameplayTag_ReturnValue_1) == 0x0000E8, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_MakeLiteralGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_GetLayerZOrder_ReturnValue) == 0x0000F0, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_GetLayerZOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_Add_IntInt_ReturnValue) == 0x0000F4, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, K2Node_Event_InDelegateResumeBtn) == 0x0000F8, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::K2Node_Event_InDelegateResumeBtn' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000108, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_MakeLiteralText_ReturnValue_4) == 0x000110, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_MakeLiteralText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, K2Node_DynamicCast_AsP2Hero_Character) == 0x000128, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, K2Node_DynamicCast_bSuccess_2) == 0x000130, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, K2Node_DynamicCast_AsP2Player_State) == 0x000138, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::K2Node_DynamicCast_AsP2Player_State' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, K2Node_DynamicCast_bSuccess_3) == 0x000140, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_IsValid_ReturnValue) == 0x000141, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_IsFirstLogout_ReturnValue) == 0x000142, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_IsFirstLogout_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, Temp_bool_Variable_1) == 0x000143, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_IsDeadOrDying_ReturnValue) == 0x000144, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_IsDeadOrDying_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_MakeLiteralText_ReturnValue_5) == 0x000148, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_MakeLiteralText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_GetLayerZOrder_ReturnValue_1) == 0x000160, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_GetLayerZOrder_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_Add_IntInt_ReturnValue_1) == 0x000164, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_MakeLiteralText_ReturnValue_6) == 0x000168, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_MakeLiteralText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_ShowPopup_ReturnValue) == 0x000180, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_ShowPopup_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, K2Node_Select_Default) == 0x000188, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_MakeLiteralText_ReturnValue_7) == 0x0001A0, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_MakeLiteralText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, K2Node_Select_Default_1) == 0x0001B8, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_ShowPopup_ReturnValue_1) == 0x0001D0, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_ShowPopup_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_MakeLiteralText_ReturnValue_8) == 0x0001D8, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_MakeLiteralText_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_GetPlayerController_ReturnValue_1) == 0x0001F0, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, CallFunc_ShowPopup_ReturnValue_2) == 0x0001F8, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::CallFunc_ShowPopup_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu, K2Node_CustomEvent_ButtonID) == 0x000200, "Member 'W_SystemMenu_C_ExecuteUbergraph_W_SystemMenu::K2Node_CustomEvent_ButtonID' has a wrong offset!");

// Function W_SystemMenu.W_SystemMenu_C.ExittoHideout
// 0x0018 (0x0018 - 0x0000)
struct W_SystemMenu_C_ExittoHideout final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemMenu_C_ExittoHideout) == 0x000008, "Wrong alignment on W_SystemMenu_C_ExittoHideout");
static_assert(sizeof(W_SystemMenu_C_ExittoHideout) == 0x000018, "Wrong size on W_SystemMenu_C_ExittoHideout");
static_assert(offsetof(W_SystemMenu_C_ExittoHideout, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'W_SystemMenu_C_ExittoHideout::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExittoHideout, K2Node_DynamicCast_AsP2Player_Controller) == 0x000008, "Member 'W_SystemMenu_C_ExittoHideout::K2Node_DynamicCast_AsP2Player_Controller' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_ExittoHideout, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'W_SystemMenu_C_ExittoHideout::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function W_SystemMenu.W_SystemMenu_C.IsPlayerDead
// 0x0020 (0x0020 - 0x0000)
struct W_SystemMenu_C_IsPlayerDead final
{
public:
	class AP2PlayerController*                    PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDead;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       CallFunc_GetP2Character_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDeadOrDying_ReturnValue;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemMenu_C_IsPlayerDead) == 0x000008, "Wrong alignment on W_SystemMenu_C_IsPlayerDead");
static_assert(sizeof(W_SystemMenu_C_IsPlayerDead) == 0x000020, "Wrong size on W_SystemMenu_C_IsPlayerDead");
static_assert(offsetof(W_SystemMenu_C_IsPlayerDead, PlayerController) == 0x000000, "Member 'W_SystemMenu_C_IsPlayerDead::PlayerController' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_IsPlayerDead, IsDead) == 0x000008, "Member 'W_SystemMenu_C_IsPlayerDead::IsDead' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_IsPlayerDead, CallFunc_GetP2Character_ReturnValue) == 0x000010, "Member 'W_SystemMenu_C_IsPlayerDead::CallFunc_GetP2Character_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_IsPlayerDead, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'W_SystemMenu_C_IsPlayerDead::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_IsPlayerDead, CallFunc_IsDeadOrDying_ReturnValue) == 0x000019, "Member 'W_SystemMenu_C_IsPlayerDead::CallFunc_IsDeadOrDying_ReturnValue' has a wrong offset!");

// Function W_SystemMenu.W_SystemMenu_C.OnClickedExitToDesktop
// 0x0001 (0x0001 - 0x0000)
struct W_SystemMenu_C_OnClickedExitToDesktop final
{
public:
	EPopupButtonID                                ButtonID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemMenu_C_OnClickedExitToDesktop) == 0x000001, "Wrong alignment on W_SystemMenu_C_OnClickedExitToDesktop");
static_assert(sizeof(W_SystemMenu_C_OnClickedExitToDesktop) == 0x000001, "Wrong size on W_SystemMenu_C_OnClickedExitToDesktop");
static_assert(offsetof(W_SystemMenu_C_OnClickedExitToDesktop, ButtonID) == 0x000000, "Member 'W_SystemMenu_C_OnClickedExitToDesktop::ButtonID' has a wrong offset!");

// Function W_SystemMenu.W_SystemMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_SystemMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemMenu_C_PreConstruct) == 0x000001, "Wrong alignment on W_SystemMenu_C_PreConstruct");
static_assert(sizeof(W_SystemMenu_C_PreConstruct) == 0x000001, "Wrong size on W_SystemMenu_C_PreConstruct");
static_assert(offsetof(W_SystemMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_SystemMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_SystemMenu.W_SystemMenu_C.ReceivePressedExitBtn
// 0x0010 (0x0010 - 0x0000)
struct W_SystemMenu_C_ReceivePressedExitBtn final
{
public:
	TDelegate<void(EPopupButtonID ButtonID)>      InDelegateResumeBtn;                               // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemMenu_C_ReceivePressedExitBtn) == 0x000004, "Wrong alignment on W_SystemMenu_C_ReceivePressedExitBtn");
static_assert(sizeof(W_SystemMenu_C_ReceivePressedExitBtn) == 0x000010, "Wrong size on W_SystemMenu_C_ReceivePressedExitBtn");
static_assert(offsetof(W_SystemMenu_C_ReceivePressedExitBtn, InDelegateResumeBtn) == 0x000000, "Member 'W_SystemMenu_C_ReceivePressedExitBtn::InDelegateResumeBtn' has a wrong offset!");

// Function W_SystemMenu.W_SystemMenu_C.ReceivePressedExittoHideoutBtn
// 0x0010 (0x0010 - 0x0000)
struct W_SystemMenu_C_ReceivePressedExittoHideoutBtn final
{
public:
	TDelegate<void(EPopupButtonID ButtonID)>      InDelegateResumeBtn;                               // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemMenu_C_ReceivePressedExittoHideoutBtn) == 0x000004, "Wrong alignment on W_SystemMenu_C_ReceivePressedExittoHideoutBtn");
static_assert(sizeof(W_SystemMenu_C_ReceivePressedExittoHideoutBtn) == 0x000010, "Wrong size on W_SystemMenu_C_ReceivePressedExittoHideoutBtn");
static_assert(offsetof(W_SystemMenu_C_ReceivePressedExittoHideoutBtn, InDelegateResumeBtn) == 0x000000, "Member 'W_SystemMenu_C_ReceivePressedExittoHideoutBtn::InDelegateResumeBtn' has a wrong offset!");

// Function W_SystemMenu.W_SystemMenu_C.SetInputFocus
// 0x0018 (0x0018 - 0x0000)
struct W_SystemMenu_C_SetInputFocus final
{
public:
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemMenu_C_SetInputFocus) == 0x000008, "Wrong alignment on W_SystemMenu_C_SetInputFocus");
static_assert(sizeof(W_SystemMenu_C_SetInputFocus) == 0x000018, "Wrong size on W_SystemMenu_C_SetInputFocus");
static_assert(offsetof(W_SystemMenu_C_SetInputFocus, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000000, "Member 'W_SystemMenu_C_SetInputFocus::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_SetInputFocus, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'W_SystemMenu_C_SetInputFocus::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_C_SetInputFocus, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'W_SystemMenu_C_SetInputFocus::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function W_SystemMenu.W_SystemMenu_C.ShowOrHideWidget_Implementable
// 0x0001 (0x0001 - 0x0000)
struct W_SystemMenu_C_ShowOrHideWidget_Implementable final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemMenu_C_ShowOrHideWidget_Implementable) == 0x000001, "Wrong alignment on W_SystemMenu_C_ShowOrHideWidget_Implementable");
static_assert(sizeof(W_SystemMenu_C_ShowOrHideWidget_Implementable) == 0x000001, "Wrong size on W_SystemMenu_C_ShowOrHideWidget_Implementable");
static_assert(offsetof(W_SystemMenu_C_ShowOrHideWidget_Implementable, InVisibility) == 0x000000, "Member 'W_SystemMenu_C_ShowOrHideWidget_Implementable::InVisibility' has a wrong offset!");

}

