#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SystemMenu_PopupWidget_SkipTutorial

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function W_SystemMenu_PopupWidget_SkipTutorial.W_SystemMenu_PopupWidget_SkipTutorial_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_SystemMenu_PopupWidget_SkipTutorial_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemMenu_PopupWidget_SkipTutorial_C_PreConstruct) == 0x000001, "Wrong alignment on W_SystemMenu_PopupWidget_SkipTutorial_C_PreConstruct");
static_assert(sizeof(W_SystemMenu_PopupWidget_SkipTutorial_C_PreConstruct) == 0x000001, "Wrong size on W_SystemMenu_PopupWidget_SkipTutorial_C_PreConstruct");
static_assert(offsetof(W_SystemMenu_PopupWidget_SkipTutorial_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_SystemMenu_PopupWidget_SkipTutorial_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_SystemMenu_PopupWidget_SkipTutorial.W_SystemMenu_PopupWidget_SkipTutorial_C.PopupPressed
// 0x0001 (0x0001 - 0x0000)
struct W_SystemMenu_PopupWidget_SkipTutorial_C_PopupPressed final
{
public:
	EPopupButtonID                                ButtonID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemMenu_PopupWidget_SkipTutorial_C_PopupPressed) == 0x000001, "Wrong alignment on W_SystemMenu_PopupWidget_SkipTutorial_C_PopupPressed");
static_assert(sizeof(W_SystemMenu_PopupWidget_SkipTutorial_C_PopupPressed) == 0x000001, "Wrong size on W_SystemMenu_PopupWidget_SkipTutorial_C_PopupPressed");
static_assert(offsetof(W_SystemMenu_PopupWidget_SkipTutorial_C_PopupPressed, ButtonID) == 0x000000, "Member 'W_SystemMenu_PopupWidget_SkipTutorial_C_PopupPressed::ButtonID' has a wrong offset!");

// Function W_SystemMenu_PopupWidget_SkipTutorial.W_SystemMenu_PopupWidget_SkipTutorial_C.ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial
// 0x0058 (0x0058 - 0x0000)
struct W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	EPopupButtonID                                Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPopupButtonID ButtonID)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IP2PopupInterface>     K2Node_DynamicCast_AsP2Popup_Interface;            // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPopupButtonID                                K2Node_CustomEvent_ButtonID;                       // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial) == 0x000008, "Wrong alignment on W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial");
static_assert(sizeof(W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial) == 0x000058, "Wrong size on W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial");
static_assert(offsetof(W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial, EntryPoint) == 0x000000, "Member 'W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial, Temp_byte_Variable) == 0x000020, "Member 'W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial, Temp_bool_Variable) == 0x000034, "Member 'W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial, Temp_bool_Variable_1) == 0x000035, "Member 'W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial, Temp_bool_Variable_2) == 0x000036, "Member 'W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial, Temp_bool_Variable_3) == 0x000037, "Member 'W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial, Temp_bool_Variable_4) == 0x000038, "Member 'W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial, Temp_bool_Variable_5) == 0x000039, "Member 'W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial, Temp_bool_Variable_6) == 0x00003A, "Member 'W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial, K2Node_Event_IsDesignTime) == 0x00003B, "Member 'W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial, K2Node_DynamicCast_AsP2Popup_Interface) == 0x000040, "Member 'W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial::K2Node_DynamicCast_AsP2Popup_Interface' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial, K2Node_CustomEvent_ButtonID) == 0x000051, "Member 'W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial::K2Node_CustomEvent_ButtonID' has a wrong offset!");
static_assert(offsetof(W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial, K2Node_Select_Default) == 0x000052, "Member 'W_SystemMenu_PopupWidget_SkipTutorial_C_ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial::K2Node_Select_Default' has a wrong offset!");

}

