#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SystemMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SystemMenu.W_SystemMenu_C
// 0x00F8 (0x0868 - 0x0770)
class UW_SystemMenu_C final : public UP2SystemMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0770(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBackgroundBlur*                        Blr_SystemMenu;                                    // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonButtonWidget_C*                CommonBtn_Unstuck;                                 // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Logo_Discord;                                  // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Logo_Heybox;                                   // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Logo_X;                                        // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_RegionIcon;                                    // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Stroke_Discord;                                // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Stroke_Heybox;                                 // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Stroke_X;                                      // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Title_Line;                                    // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Underline_Discord;                             // 0x07C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Underline_Heybox;                              // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Underline_X;                                   // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Root;                                      // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_FacilityTitle;                                 // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_AgeWarning_C*                        W_AgeWarning;                                      // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsPressedSystemMenu;                               // 0x07F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isKeyCheckStart;                                   // 0x07F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7FA[0x6];                                      // 0x07FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           SetInputModeTimerHandle;                           // 0x0800(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class FText                                   Txt_Popup_Body;                                    // 0x0808(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Txt_ExitPopup_Body;                                // 0x0820(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SurveyTitle;                                       // 0x0838(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SurveyBody;                                        // 0x0850(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BP_OnDeactivated()	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void Destruct()	 // 0xae1e64;
	void ExecuteUbergraph_W_SystemMenu(int32 EntryPoint)	 // 0xae1e64;
	void ExittoHideout()	 // 0xae1e64;
	void IsPlayerDead(class AP2PlayerController* PlayerController, bool* IsDead)	 // 0xae1e64;
	void OnClickedExitToDesktop(EPopupButtonID ButtonID)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ReceivePressedExitBtn(const TDelegate<void(EPopupButtonID ButtonID)>& InDelegateResumeBtn)	 // 0xae1e64;
	void ReceivePressedExittoHideoutBtn(const TDelegate<void(EPopupButtonID ButtonID)>& InDelegateResumeBtn)	 // 0xae1e64;
	void SetInputFocus()	 // 0xae1e64;
	void ShowOrHideWidget_Implementable(ESlateVisibility InVisibility)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_SystemMenu_C">();
	}
	static class UW_SystemMenu_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_SystemMenu_C>();
	}
};
static_assert(alignof(UW_SystemMenu_C) == 0x000008, "Wrong alignment on UW_SystemMenu_C");
static_assert(sizeof(UW_SystemMenu_C) == 0x000868, "Wrong size on UW_SystemMenu_C");
static_assert(offsetof(UW_SystemMenu_C, UberGraphFrame) == 0x000770, "Member 'UW_SystemMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, Blr_SystemMenu) == 0x000778, "Member 'UW_SystemMenu_C::Blr_SystemMenu' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, CommonBtn_Unstuck) == 0x000780, "Member 'UW_SystemMenu_C::CommonBtn_Unstuck' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, Img_Logo_Discord) == 0x000788, "Member 'UW_SystemMenu_C::Img_Logo_Discord' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, Img_Logo_Heybox) == 0x000790, "Member 'UW_SystemMenu_C::Img_Logo_Heybox' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, Img_Logo_X) == 0x000798, "Member 'UW_SystemMenu_C::Img_Logo_X' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, Img_RegionIcon) == 0x0007A0, "Member 'UW_SystemMenu_C::Img_RegionIcon' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, Img_Stroke_Discord) == 0x0007A8, "Member 'UW_SystemMenu_C::Img_Stroke_Discord' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, Img_Stroke_Heybox) == 0x0007B0, "Member 'UW_SystemMenu_C::Img_Stroke_Heybox' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, Img_Stroke_X) == 0x0007B8, "Member 'UW_SystemMenu_C::Img_Stroke_X' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, Img_Title_Line) == 0x0007C0, "Member 'UW_SystemMenu_C::Img_Title_Line' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, Img_Underline_Discord) == 0x0007C8, "Member 'UW_SystemMenu_C::Img_Underline_Discord' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, Img_Underline_Heybox) == 0x0007D0, "Member 'UW_SystemMenu_C::Img_Underline_Heybox' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, Img_Underline_X) == 0x0007D8, "Member 'UW_SystemMenu_C::Img_Underline_X' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, Overlay_Root) == 0x0007E0, "Member 'UW_SystemMenu_C::Overlay_Root' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, Txt_FacilityTitle) == 0x0007E8, "Member 'UW_SystemMenu_C::Txt_FacilityTitle' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, W_AgeWarning) == 0x0007F0, "Member 'UW_SystemMenu_C::W_AgeWarning' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, IsPressedSystemMenu) == 0x0007F8, "Member 'UW_SystemMenu_C::IsPressedSystemMenu' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, isKeyCheckStart) == 0x0007F9, "Member 'UW_SystemMenu_C::isKeyCheckStart' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, SetInputModeTimerHandle) == 0x000800, "Member 'UW_SystemMenu_C::SetInputModeTimerHandle' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, Txt_Popup_Body) == 0x000808, "Member 'UW_SystemMenu_C::Txt_Popup_Body' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, Txt_ExitPopup_Body) == 0x000820, "Member 'UW_SystemMenu_C::Txt_ExitPopup_Body' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, SurveyTitle) == 0x000838, "Member 'UW_SystemMenu_C::SurveyTitle' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_C, SurveyBody) == 0x000850, "Member 'UW_SystemMenu_C::SurveyBody' has a wrong offset!");

}

