#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SystemMenu_PopupWidget_SkipTutorial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SystemMenu_PopupWidget_SkipTutorial.W_SystemMenu_PopupWidget_SkipTutorial_C
// 0x0068 (0x02E8 - 0x0280)
class UW_SystemMenu_PopupWidget_SkipTutorial_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 img_BG_Black;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_DotsPattern;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SystemMenu_PopupWidget_FullScreen_C* TutorialPopup;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DecoBG_C*                            W_DecoBG;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Title;                                             // 0x02A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Body;                                              // 0x02C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(bool LoadTutorial)> OnDismissed;                                   // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void UpdateLock()	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void PopupPressed(EPopupButtonID ButtonID)	 // 0xae1e64;
	void ExecuteUbergraph_W_SystemMenu_PopupWidget_SkipTutorial(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_SystemMenu_PopupWidget_SkipTutorial_C">();
	}
	static class UW_SystemMenu_PopupWidget_SkipTutorial_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_SystemMenu_PopupWidget_SkipTutorial_C>();
	}
};
static_assert(alignof(UW_SystemMenu_PopupWidget_SkipTutorial_C) == 0x000008, "Wrong alignment on UW_SystemMenu_PopupWidget_SkipTutorial_C");
static_assert(sizeof(UW_SystemMenu_PopupWidget_SkipTutorial_C) == 0x0002E8, "Wrong size on UW_SystemMenu_PopupWidget_SkipTutorial_C");
static_assert(offsetof(UW_SystemMenu_PopupWidget_SkipTutorial_C, UberGraphFrame) == 0x000280, "Member 'UW_SystemMenu_PopupWidget_SkipTutorial_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_PopupWidget_SkipTutorial_C, img_BG_Black) == 0x000288, "Member 'UW_SystemMenu_PopupWidget_SkipTutorial_C::img_BG_Black' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_PopupWidget_SkipTutorial_C, img_DotsPattern) == 0x000290, "Member 'UW_SystemMenu_PopupWidget_SkipTutorial_C::img_DotsPattern' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_PopupWidget_SkipTutorial_C, TutorialPopup) == 0x000298, "Member 'UW_SystemMenu_PopupWidget_SkipTutorial_C::TutorialPopup' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_PopupWidget_SkipTutorial_C, W_DecoBG) == 0x0002A0, "Member 'UW_SystemMenu_PopupWidget_SkipTutorial_C::W_DecoBG' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_PopupWidget_SkipTutorial_C, Title) == 0x0002A8, "Member 'UW_SystemMenu_PopupWidget_SkipTutorial_C::Title' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_PopupWidget_SkipTutorial_C, Body) == 0x0002C0, "Member 'UW_SystemMenu_PopupWidget_SkipTutorial_C::Body' has a wrong offset!");
static_assert(offsetof(UW_SystemMenu_PopupWidget_SkipTutorial_C, OnDismissed) == 0x0002D8, "Member 'UW_SystemMenu_PopupWidget_SkipTutorial_C::OnDismissed' has a wrong offset!");

}

