#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ToolTipMultiLineWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ToolTipMultiLineWidget.W_ToolTipMultiLineWidget_C
// 0x0028 (0x0310 - 0x02E8)
class UW_ToolTipMultiLineWidget_C final : public UP2MultiLineTooltipWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_ToolTipMultiLineTextWidget_C*        W_ToolTipMultiLineTextWidget;                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ToolTipMultiLineTextWidget_C*        W_ToolTipMultiLineTextWidget_1;                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ToolTipMultiLineTextWidget_C*        W_ToolTipMultiLineTextWidget_2;                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ToolTipMultiLineTextWidget_C*        W_ToolTipMultiLineTextWidget_3;                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_ToolTipMultiLineWidget(int32 EntryPoint)	 // 0xae1e64;
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ToolTipMultiLineWidget_C">();
	}
	static class UW_ToolTipMultiLineWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ToolTipMultiLineWidget_C>();
	}
};
static_assert(alignof(UW_ToolTipMultiLineWidget_C) == 0x000008, "Wrong alignment on UW_ToolTipMultiLineWidget_C");
static_assert(sizeof(UW_ToolTipMultiLineWidget_C) == 0x000310, "Wrong size on UW_ToolTipMultiLineWidget_C");
static_assert(offsetof(UW_ToolTipMultiLineWidget_C, UberGraphFrame) == 0x0002E8, "Member 'UW_ToolTipMultiLineWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ToolTipMultiLineWidget_C, W_ToolTipMultiLineTextWidget) == 0x0002F0, "Member 'UW_ToolTipMultiLineWidget_C::W_ToolTipMultiLineTextWidget' has a wrong offset!");
static_assert(offsetof(UW_ToolTipMultiLineWidget_C, W_ToolTipMultiLineTextWidget_1) == 0x0002F8, "Member 'UW_ToolTipMultiLineWidget_C::W_ToolTipMultiLineTextWidget_1' has a wrong offset!");
static_assert(offsetof(UW_ToolTipMultiLineWidget_C, W_ToolTipMultiLineTextWidget_2) == 0x000300, "Member 'UW_ToolTipMultiLineWidget_C::W_ToolTipMultiLineTextWidget_2' has a wrong offset!");
static_assert(offsetof(UW_ToolTipMultiLineWidget_C, W_ToolTipMultiLineTextWidget_3) == 0x000308, "Member 'UW_ToolTipMultiLineWidget_C::W_ToolTipMultiLineTextWidget_3' has a wrong offset!");

}

