#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Trading_Popup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Trading_Popup.W_Trading_Popup_C
// 0x00A8 (0x0730 - 0x0688)
class UW_Trading_Popup_C final : public UP2TradingPopupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0688(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HB_SelectRecipient;                                // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Anim01;                                        // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Anim02;                                        // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Anim03;                                        // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Anim04;                                        // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Anim05;                                        // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Divide05;                                      // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Divider;                                       // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Divider03;                                     // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_SelectRecipient;                            // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TradingItemsHeader;                                // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_ReputationInfo;                                 // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_RequiredItemsInfo;                              // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_SelectRecipientInfo;                            // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MoreInfoWidget_C*                    W_MoreInfoWidget;                                  // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Trading_Offer_SelectRecipient_C*     W_Trading_Offer_SelectRecipient;                   // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Trading_Offer_SelectRecipient_C*     W_Trading_Offer_SelectRecipient_77;                // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Trading_Offer_SelectRecipient_C*     W_Trading_Offer_SelectRecipient_161;               // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Trading_Offer_SelectRecipient_C*     W_Trading_Offer_SelectRecipient_242;               // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_Trading_Popup(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void UpdatePopupStyle_ImplementableEvent()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Trading_Popup_C">();
	}
	static class UW_Trading_Popup_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Trading_Popup_C>();
	}
};
static_assert(alignof(UW_Trading_Popup_C) == 0x000008, "Wrong alignment on UW_Trading_Popup_C");
static_assert(sizeof(UW_Trading_Popup_C) == 0x000730, "Wrong size on UW_Trading_Popup_C");
static_assert(offsetof(UW_Trading_Popup_C, UberGraphFrame) == 0x000688, "Member 'UW_Trading_Popup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Trading_Popup_C, HB_SelectRecipient) == 0x000690, "Member 'UW_Trading_Popup_C::HB_SelectRecipient' has a wrong offset!");
static_assert(offsetof(UW_Trading_Popup_C, Img_Anim01) == 0x000698, "Member 'UW_Trading_Popup_C::Img_Anim01' has a wrong offset!");
static_assert(offsetof(UW_Trading_Popup_C, Img_Anim02) == 0x0006A0, "Member 'UW_Trading_Popup_C::Img_Anim02' has a wrong offset!");
static_assert(offsetof(UW_Trading_Popup_C, Img_Anim03) == 0x0006A8, "Member 'UW_Trading_Popup_C::Img_Anim03' has a wrong offset!");
static_assert(offsetof(UW_Trading_Popup_C, Img_Anim04) == 0x0006B0, "Member 'UW_Trading_Popup_C::Img_Anim04' has a wrong offset!");
static_assert(offsetof(UW_Trading_Popup_C, Img_Anim05) == 0x0006B8, "Member 'UW_Trading_Popup_C::Img_Anim05' has a wrong offset!");
static_assert(offsetof(UW_Trading_Popup_C, Img_Divide05) == 0x0006C0, "Member 'UW_Trading_Popup_C::Img_Divide05' has a wrong offset!");
static_assert(offsetof(UW_Trading_Popup_C, Img_Divider) == 0x0006C8, "Member 'UW_Trading_Popup_C::Img_Divider' has a wrong offset!");
static_assert(offsetof(UW_Trading_Popup_C, Img_Divider03) == 0x0006D0, "Member 'UW_Trading_Popup_C::Img_Divider03' has a wrong offset!");
static_assert(offsetof(UW_Trading_Popup_C, Spacer_SelectRecipient) == 0x0006D8, "Member 'UW_Trading_Popup_C::Spacer_SelectRecipient' has a wrong offset!");
static_assert(offsetof(UW_Trading_Popup_C, TitleText) == 0x0006E0, "Member 'UW_Trading_Popup_C::TitleText' has a wrong offset!");
static_assert(offsetof(UW_Trading_Popup_C, TradingItemsHeader) == 0x0006E8, "Member 'UW_Trading_Popup_C::TradingItemsHeader' has a wrong offset!");
static_assert(offsetof(UW_Trading_Popup_C, VB_ReputationInfo) == 0x0006F0, "Member 'UW_Trading_Popup_C::VB_ReputationInfo' has a wrong offset!");
static_assert(offsetof(UW_Trading_Popup_C, VB_RequiredItemsInfo) == 0x0006F8, "Member 'UW_Trading_Popup_C::VB_RequiredItemsInfo' has a wrong offset!");
static_assert(offsetof(UW_Trading_Popup_C, VB_SelectRecipientInfo) == 0x000700, "Member 'UW_Trading_Popup_C::VB_SelectRecipientInfo' has a wrong offset!");
static_assert(offsetof(UW_Trading_Popup_C, W_MoreInfoWidget) == 0x000708, "Member 'UW_Trading_Popup_C::W_MoreInfoWidget' has a wrong offset!");
static_assert(offsetof(UW_Trading_Popup_C, W_Trading_Offer_SelectRecipient) == 0x000710, "Member 'UW_Trading_Popup_C::W_Trading_Offer_SelectRecipient' has a wrong offset!");
static_assert(offsetof(UW_Trading_Popup_C, W_Trading_Offer_SelectRecipient_77) == 0x000718, "Member 'UW_Trading_Popup_C::W_Trading_Offer_SelectRecipient_77' has a wrong offset!");
static_assert(offsetof(UW_Trading_Popup_C, W_Trading_Offer_SelectRecipient_161) == 0x000720, "Member 'UW_Trading_Popup_C::W_Trading_Offer_SelectRecipient_161' has a wrong offset!");
static_assert(offsetof(UW_Trading_Popup_C, W_Trading_Offer_SelectRecipient_242) == 0x000728, "Member 'UW_Trading_Popup_C::W_Trading_Offer_SelectRecipient_242' has a wrong offset!");

}

