#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TradingItemWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_TradingItemWidget.W_TradingItemWidget_C.ExecuteUbergraph_W_TradingItemWidget
// 0x0004 (0x0004 - 0x0000)
struct W_TradingItemWidget_C_ExecuteUbergraph_W_TradingItemWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TradingItemWidget_C_ExecuteUbergraph_W_TradingItemWidget) == 0x000004, "Wrong alignment on W_TradingItemWidget_C_ExecuteUbergraph_W_TradingItemWidget");
static_assert(sizeof(W_TradingItemWidget_C_ExecuteUbergraph_W_TradingItemWidget) == 0x000004, "Wrong size on W_TradingItemWidget_C_ExecuteUbergraph_W_TradingItemWidget");
static_assert(offsetof(W_TradingItemWidget_C_ExecuteUbergraph_W_TradingItemWidget, EntryPoint) == 0x000000, "Member 'W_TradingItemWidget_C_ExecuteUbergraph_W_TradingItemWidget::EntryPoint' has a wrong offset!");

// Function W_TradingItemWidget.W_TradingItemWidget_C.UpdateLayers_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_TradingItemWidget_C_UpdateLayers_ImplementableEvent final
{
public:
	bool                                          CallFunc_IsTradingItemLocked_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TradingItemWidget_C_UpdateLayers_ImplementableEvent) == 0x000001, "Wrong alignment on W_TradingItemWidget_C_UpdateLayers_ImplementableEvent");
static_assert(sizeof(W_TradingItemWidget_C_UpdateLayers_ImplementableEvent) == 0x000001, "Wrong size on W_TradingItemWidget_C_UpdateLayers_ImplementableEvent");
static_assert(offsetof(W_TradingItemWidget_C_UpdateLayers_ImplementableEvent, CallFunc_IsTradingItemLocked_ReturnValue) == 0x000000, "Member 'W_TradingItemWidget_C_UpdateLayers_ImplementableEvent::CallFunc_IsTradingItemLocked_ReturnValue' has a wrong offset!");

}

