#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Trading_RestockItemGroup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Trading_RestockItemGroup.W_Trading_RestockItemGroup_C
// 0x0020 (0x0378 - 0x0358)
class UW_Trading_RestockItemGroup_C final : public UP2TradingRestockItemGroupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RestockAnim;                                       // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Img_RemainingTime;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TradingItemWidget_C*                 W_TradingItemWidget;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Trading_RestockItemGroup(int32 EntryPoint)	 // 0xae1e64;
	void ToggleImminentAnimationOnBP(bool InPlay)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Trading_RestockItemGroup_C">();
	}
	static class UW_Trading_RestockItemGroup_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Trading_RestockItemGroup_C>();
	}
};
static_assert(alignof(UW_Trading_RestockItemGroup_C) == 0x000008, "Wrong alignment on UW_Trading_RestockItemGroup_C");
static_assert(sizeof(UW_Trading_RestockItemGroup_C) == 0x000378, "Wrong size on UW_Trading_RestockItemGroup_C");
static_assert(offsetof(UW_Trading_RestockItemGroup_C, UberGraphFrame) == 0x000358, "Member 'UW_Trading_RestockItemGroup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Trading_RestockItemGroup_C, RestockAnim) == 0x000360, "Member 'UW_Trading_RestockItemGroup_C::RestockAnim' has a wrong offset!");
static_assert(offsetof(UW_Trading_RestockItemGroup_C, Img_RemainingTime) == 0x000368, "Member 'UW_Trading_RestockItemGroup_C::Img_RemainingTime' has a wrong offset!");
static_assert(offsetof(UW_Trading_RestockItemGroup_C, W_TradingItemWidget) == 0x000370, "Member 'UW_Trading_RestockItemGroup_C::W_TradingItemWidget' has a wrong offset!");

}

