#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Transacton_RequiredItemWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Transacton_RequiredItemWidget.W_Transacton_RequiredItemWidget_C
// 0x0058 (0x0300 - 0x02A8)
class UW_Transacton_RequiredItemWidget_C final : public UP2TransactionRequiredItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_RequiredItemBg;                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       IB_Empty;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_LeftBar;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WS_CheckBox;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsEmpty;                                           // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRequirementMet;                                  // 0x02D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ItemName;                                          // 0x02D8(0x0018)(Edit, BlueprintVisible)
	class UTexture2D*                             ItemIcon;                                          // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentQuantity;                                   // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RequiredQuantity;                                  // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Transacton_RequiredItemWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetIsMeetRequirements(bool InIsMeetRequirements)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Transacton_RequiredItemWidget_C">();
	}
	static class UW_Transacton_RequiredItemWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Transacton_RequiredItemWidget_C>();
	}
};
static_assert(alignof(UW_Transacton_RequiredItemWidget_C) == 0x000008, "Wrong alignment on UW_Transacton_RequiredItemWidget_C");
static_assert(sizeof(UW_Transacton_RequiredItemWidget_C) == 0x000300, "Wrong size on UW_Transacton_RequiredItemWidget_C");
static_assert(offsetof(UW_Transacton_RequiredItemWidget_C, UberGraphFrame) == 0x0002A8, "Member 'UW_Transacton_RequiredItemWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Transacton_RequiredItemWidget_C, Bdr_RequiredItemBg) == 0x0002B0, "Member 'UW_Transacton_RequiredItemWidget_C::Bdr_RequiredItemBg' has a wrong offset!");
static_assert(offsetof(UW_Transacton_RequiredItemWidget_C, IB_Empty) == 0x0002B8, "Member 'UW_Transacton_RequiredItemWidget_C::IB_Empty' has a wrong offset!");
static_assert(offsetof(UW_Transacton_RequiredItemWidget_C, Img_LeftBar) == 0x0002C0, "Member 'UW_Transacton_RequiredItemWidget_C::Img_LeftBar' has a wrong offset!");
static_assert(offsetof(UW_Transacton_RequiredItemWidget_C, WS_CheckBox) == 0x0002C8, "Member 'UW_Transacton_RequiredItemWidget_C::WS_CheckBox' has a wrong offset!");
static_assert(offsetof(UW_Transacton_RequiredItemWidget_C, IsEmpty) == 0x0002D0, "Member 'UW_Transacton_RequiredItemWidget_C::IsEmpty' has a wrong offset!");
static_assert(offsetof(UW_Transacton_RequiredItemWidget_C, IsRequirementMet) == 0x0002D1, "Member 'UW_Transacton_RequiredItemWidget_C::IsRequirementMet' has a wrong offset!");
static_assert(offsetof(UW_Transacton_RequiredItemWidget_C, ItemName) == 0x0002D8, "Member 'UW_Transacton_RequiredItemWidget_C::ItemName' has a wrong offset!");
static_assert(offsetof(UW_Transacton_RequiredItemWidget_C, ItemIcon) == 0x0002F0, "Member 'UW_Transacton_RequiredItemWidget_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UW_Transacton_RequiredItemWidget_C, CurrentQuantity) == 0x0002F8, "Member 'UW_Transacton_RequiredItemWidget_C::CurrentQuantity' has a wrong offset!");
static_assert(offsetof(UW_Transacton_RequiredItemWidget_C, RequiredQuantity) == 0x0002FC, "Member 'UW_Transacton_RequiredItemWidget_C::RequiredQuantity' has a wrong offset!");

}

