#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Transaction_ItemWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Transaction_ItemWidget.W_Transaction_ItemWidget_C
// 0x0028 (0x0308 - 0x02E0)
class UW_Transaction_ItemWidget_C final : public UP2ContractTransactionItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FText                                   ItemName;                                          // 0x02E8(0x0018)(Edit, BlueprintVisible)
	int32                                         CurrentCount;                                      // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReqCount;                                          // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Transaction_ItemWidget(int32 EntryPoint)	 // 0xae1e64;
	void OnSetIsMeetRequirements_ImplementableEvent(bool InIsMeetRequirements)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetItemInfo(const class FText& ItemName_0, int32 CurrentCount_0, int32 ReqCount_0)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Transaction_ItemWidget_C">();
	}
	static class UW_Transaction_ItemWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Transaction_ItemWidget_C>();
	}
};
static_assert(alignof(UW_Transaction_ItemWidget_C) == 0x000008, "Wrong alignment on UW_Transaction_ItemWidget_C");
static_assert(sizeof(UW_Transaction_ItemWidget_C) == 0x000308, "Wrong size on UW_Transaction_ItemWidget_C");
static_assert(offsetof(UW_Transaction_ItemWidget_C, UberGraphFrame) == 0x0002E0, "Member 'UW_Transaction_ItemWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Transaction_ItemWidget_C, ItemName) == 0x0002E8, "Member 'UW_Transaction_ItemWidget_C::ItemName' has a wrong offset!");
static_assert(offsetof(UW_Transaction_ItemWidget_C, CurrentCount) == 0x000300, "Member 'UW_Transaction_ItemWidget_C::CurrentCount' has a wrong offset!");
static_assert(offsetof(UW_Transaction_ItemWidget_C, ReqCount) == 0x000304, "Member 'UW_Transaction_ItemWidget_C::ReqCount' has a wrong offset!");

}

