#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Transaction_PopupWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Transaction_PopupWidget.W_Transaction_PopupWidget_C
// 0x0068 (0x06B0 - 0x0648)
class UW_Transaction_PopupWidget_C final : public UP2TransactionPopupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0648(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_Transacton_RequiredItemWidget_C*     W_Transacton_RequiredItemWidget;                   // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Transacton_RequiredItemWidget_C*     W_Transacton_RequiredItemWidget_1;                 // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Transacton_RequiredItemWidget_C*     W_Transacton_RequiredItemWidget_2;                 // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TransactionName;                                   // 0x0668(0x0018)(Edit, BlueprintVisible)
	class FText                                   ItemName;                                          // 0x0680(0x0018)(Edit, BlueprintVisible)
	class FText                                   DescText;                                          // 0x0698(0x0018)(Edit, BlueprintVisible)

public:
	void Construct()	 // 0xae1e64;
	void Destruct()	 // 0xae1e64;
	void ExecuteUbergraph_W_Transaction_PopupWidget(int32 EntryPoint)	 // 0xae1e64;
	void OnBackAction_1()	 // 0xae1e64;
	void OnStashContainerChanged(class UP2Container* InContainer)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetEnabled_BtnSubmit(const bool bEnabled)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Transaction_PopupWidget_C">();
	}
	static class UW_Transaction_PopupWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Transaction_PopupWidget_C>();
	}
};
static_assert(alignof(UW_Transaction_PopupWidget_C) == 0x000008, "Wrong alignment on UW_Transaction_PopupWidget_C");
static_assert(sizeof(UW_Transaction_PopupWidget_C) == 0x0006B0, "Wrong size on UW_Transaction_PopupWidget_C");
static_assert(offsetof(UW_Transaction_PopupWidget_C, UberGraphFrame) == 0x000648, "Member 'UW_Transaction_PopupWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Transaction_PopupWidget_C, W_Transacton_RequiredItemWidget) == 0x000650, "Member 'UW_Transaction_PopupWidget_C::W_Transacton_RequiredItemWidget' has a wrong offset!");
static_assert(offsetof(UW_Transaction_PopupWidget_C, W_Transacton_RequiredItemWidget_1) == 0x000658, "Member 'UW_Transaction_PopupWidget_C::W_Transacton_RequiredItemWidget_1' has a wrong offset!");
static_assert(offsetof(UW_Transaction_PopupWidget_C, W_Transacton_RequiredItemWidget_2) == 0x000660, "Member 'UW_Transaction_PopupWidget_C::W_Transacton_RequiredItemWidget_2' has a wrong offset!");
static_assert(offsetof(UW_Transaction_PopupWidget_C, TransactionName) == 0x000668, "Member 'UW_Transaction_PopupWidget_C::TransactionName' has a wrong offset!");
static_assert(offsetof(UW_Transaction_PopupWidget_C, ItemName) == 0x000680, "Member 'UW_Transaction_PopupWidget_C::ItemName' has a wrong offset!");
static_assert(offsetof(UW_Transaction_PopupWidget_C, DescText) == 0x000698, "Member 'UW_Transaction_PopupWidget_C::DescText' has a wrong offset!");

}

