#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Transaction_ItemWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Transaction_ItemWidget.W_Transaction_ItemWidget_C.ExecuteUbergraph_W_Transaction_ItemWidget
// 0x0030 (0x0030 - 0x0000)
struct W_Transaction_ItemWidget_C_ExecuteUbergraph_W_Transaction_ItemWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsMeetRequirements;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Transaction_ItemWidget_C_ExecuteUbergraph_W_Transaction_ItemWidget) == 0x000004, "Wrong alignment on W_Transaction_ItemWidget_C_ExecuteUbergraph_W_Transaction_ItemWidget");
static_assert(sizeof(W_Transaction_ItemWidget_C_ExecuteUbergraph_W_Transaction_ItemWidget) == 0x000030, "Wrong size on W_Transaction_ItemWidget_C_ExecuteUbergraph_W_Transaction_ItemWidget");
static_assert(offsetof(W_Transaction_ItemWidget_C_ExecuteUbergraph_W_Transaction_ItemWidget, EntryPoint) == 0x000000, "Member 'W_Transaction_ItemWidget_C_ExecuteUbergraph_W_Transaction_ItemWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Transaction_ItemWidget_C_ExecuteUbergraph_W_Transaction_ItemWidget, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_Transaction_ItemWidget_C_ExecuteUbergraph_W_Transaction_ItemWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Transaction_ItemWidget_C_ExecuteUbergraph_W_Transaction_ItemWidget, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_Transaction_ItemWidget_C_ExecuteUbergraph_W_Transaction_ItemWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Transaction_ItemWidget_C_ExecuteUbergraph_W_Transaction_ItemWidget, K2Node_Event_IsDesignTime) == 0x00002C, "Member 'W_Transaction_ItemWidget_C_ExecuteUbergraph_W_Transaction_ItemWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Transaction_ItemWidget_C_ExecuteUbergraph_W_Transaction_ItemWidget, K2Node_Event_InIsMeetRequirements) == 0x00002D, "Member 'W_Transaction_ItemWidget_C_ExecuteUbergraph_W_Transaction_ItemWidget::K2Node_Event_InIsMeetRequirements' has a wrong offset!");

// Function W_Transaction_ItemWidget.W_Transaction_ItemWidget_C.OnSetIsMeetRequirements_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_Transaction_ItemWidget_C_OnSetIsMeetRequirements_ImplementableEvent final
{
public:
	bool                                          InIsMeetRequirements;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Transaction_ItemWidget_C_OnSetIsMeetRequirements_ImplementableEvent) == 0x000001, "Wrong alignment on W_Transaction_ItemWidget_C_OnSetIsMeetRequirements_ImplementableEvent");
static_assert(sizeof(W_Transaction_ItemWidget_C_OnSetIsMeetRequirements_ImplementableEvent) == 0x000001, "Wrong size on W_Transaction_ItemWidget_C_OnSetIsMeetRequirements_ImplementableEvent");
static_assert(offsetof(W_Transaction_ItemWidget_C_OnSetIsMeetRequirements_ImplementableEvent, InIsMeetRequirements) == 0x000000, "Member 'W_Transaction_ItemWidget_C_OnSetIsMeetRequirements_ImplementableEvent::InIsMeetRequirements' has a wrong offset!");

// Function W_Transaction_ItemWidget.W_Transaction_ItemWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Transaction_ItemWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Transaction_ItemWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Transaction_ItemWidget_C_PreConstruct");
static_assert(sizeof(W_Transaction_ItemWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Transaction_ItemWidget_C_PreConstruct");
static_assert(offsetof(W_Transaction_ItemWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Transaction_ItemWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Transaction_ItemWidget.W_Transaction_ItemWidget_C.SetItemInfo
// 0x00F8 (0x00F8 - 0x0000)
struct W_Transaction_ItemWidget_C_SetItemInfo final
{
public:
	class FText                                   ItemName_0;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         CurrentCount_0;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReqCount_0;                                        // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0090(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B8(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00D0(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00E4(0x0014)()
};
static_assert(alignof(W_Transaction_ItemWidget_C_SetItemInfo) == 0x000008, "Wrong alignment on W_Transaction_ItemWidget_C_SetItemInfo");
static_assert(sizeof(W_Transaction_ItemWidget_C_SetItemInfo) == 0x0000F8, "Wrong size on W_Transaction_ItemWidget_C_SetItemInfo");
static_assert(offsetof(W_Transaction_ItemWidget_C_SetItemInfo, ItemName_0) == 0x000000, "Member 'W_Transaction_ItemWidget_C_SetItemInfo::ItemName_0' has a wrong offset!");
static_assert(offsetof(W_Transaction_ItemWidget_C_SetItemInfo, CurrentCount_0) == 0x000018, "Member 'W_Transaction_ItemWidget_C_SetItemInfo::CurrentCount_0' has a wrong offset!");
static_assert(offsetof(W_Transaction_ItemWidget_C_SetItemInfo, ReqCount_0) == 0x00001C, "Member 'W_Transaction_ItemWidget_C_SetItemInfo::ReqCount_0' has a wrong offset!");
static_assert(offsetof(W_Transaction_ItemWidget_C_SetItemInfo, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000020, "Member 'W_Transaction_ItemWidget_C_SetItemInfo::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Transaction_ItemWidget_C_SetItemInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'W_Transaction_ItemWidget_C_SetItemInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Transaction_ItemWidget_C_SetItemInfo, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'W_Transaction_ItemWidget_C_SetItemInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_Transaction_ItemWidget_C_SetItemInfo, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000090, "Member 'W_Transaction_ItemWidget_C_SetItemInfo::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Transaction_ItemWidget_C_SetItemInfo, K2Node_MakeArray_Array) == 0x0000A8, "Member 'W_Transaction_ItemWidget_C_SetItemInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_Transaction_ItemWidget_C_SetItemInfo, CallFunc_Format_ReturnValue) == 0x0000B8, "Member 'W_Transaction_ItemWidget_C_SetItemInfo::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Transaction_ItemWidget_C_SetItemInfo, K2Node_MakeStruct_SlateColor) == 0x0000D0, "Member 'W_Transaction_ItemWidget_C_SetItemInfo::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Transaction_ItemWidget_C_SetItemInfo, K2Node_MakeStruct_SlateColor_1) == 0x0000E4, "Member 'W_Transaction_ItemWidget_C_SetItemInfo::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

}

