#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Transaction_PopupWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Transaction_PopupWidget.W_Transaction_PopupWidget_C.ExecuteUbergraph_W_Transaction_PopupWidget
// 0x00A0 (0x00A0 - 0x0000)
struct W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UP2Container* InContainer)> K2Node_CreateDelegate_OutputDelegate;           // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnabled;                             // 0x0035(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Container*                           K2Node_CustomEvent_InContainer;                    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_Laptop_CommonBtnWidget_C*            K2Node_DynamicCast_AsW_Laptop_Common_Btn_Widget;   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UP2Container*>                   CallFunc_GetStashContainers_OutContainers;         // 0x0060(0x0010)(ReferenceParm)
	TArray<class UP2Container*>                   CallFunc_GetStashContainers_OutContainers_1;       // 0x0070(0x0010)(ReferenceParm)
	class UP2Container*                           CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2Container*                           CallFunc_Array_Get_Item_1;                         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget) == 0x000008, "Wrong alignment on W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget");
static_assert(sizeof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget) == 0x0000A0, "Wrong size on W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, EntryPoint) == 0x000000, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, Temp_int_Array_Index_Variable) == 0x000008, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, K2Node_Event_IsDesignTime) == 0x00001C, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, CallFunc_GetChildrenCount_ReturnValue) == 0x000020, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000034, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, K2Node_Event_bEnabled) == 0x000035, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::K2Node_Event_bEnabled' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, K2Node_CustomEvent_InContainer) == 0x000038, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::K2Node_CustomEvent_InContainer' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, K2Node_DynamicCast_AsW_Laptop_Common_Btn_Widget) == 0x000040, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::K2Node_DynamicCast_AsW_Laptop_Common_Btn_Widget' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, CallFunc_GetPlayerController_ReturnValue_1) == 0x000058, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, CallFunc_GetStashContainers_OutContainers) == 0x000060, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::CallFunc_GetStashContainers_OutContainers' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, CallFunc_GetStashContainers_OutContainers_1) == 0x000070, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::CallFunc_GetStashContainers_OutContainers_1' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, CallFunc_Array_Get_Item) == 0x000080, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, CallFunc_Array_Get_Item_1) == 0x000088, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, CallFunc_IsValid_ReturnValue_1) == 0x000091, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, CallFunc_Array_Length_ReturnValue_1) == 0x000098, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget, CallFunc_Less_IntInt_ReturnValue_1) == 0x00009D, "Member 'W_Transaction_PopupWidget_C_ExecuteUbergraph_W_Transaction_PopupWidget::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function W_Transaction_PopupWidget.W_Transaction_PopupWidget_C.OnStashContainerChanged
// 0x0008 (0x0008 - 0x0000)
struct W_Transaction_PopupWidget_C_OnStashContainerChanged final
{
public:
	class UP2Container*                           InContainer;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Transaction_PopupWidget_C_OnStashContainerChanged) == 0x000008, "Wrong alignment on W_Transaction_PopupWidget_C_OnStashContainerChanged");
static_assert(sizeof(W_Transaction_PopupWidget_C_OnStashContainerChanged) == 0x000008, "Wrong size on W_Transaction_PopupWidget_C_OnStashContainerChanged");
static_assert(offsetof(W_Transaction_PopupWidget_C_OnStashContainerChanged, InContainer) == 0x000000, "Member 'W_Transaction_PopupWidget_C_OnStashContainerChanged::InContainer' has a wrong offset!");

// Function W_Transaction_PopupWidget.W_Transaction_PopupWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Transaction_PopupWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Transaction_PopupWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Transaction_PopupWidget_C_PreConstruct");
static_assert(sizeof(W_Transaction_PopupWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Transaction_PopupWidget_C_PreConstruct");
static_assert(offsetof(W_Transaction_PopupWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Transaction_PopupWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Transaction_PopupWidget.W_Transaction_PopupWidget_C.SetEnabled_BtnSubmit
// 0x0001 (0x0001 - 0x0000)
struct W_Transaction_PopupWidget_C_SetEnabled_BtnSubmit final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Transaction_PopupWidget_C_SetEnabled_BtnSubmit) == 0x000001, "Wrong alignment on W_Transaction_PopupWidget_C_SetEnabled_BtnSubmit");
static_assert(sizeof(W_Transaction_PopupWidget_C_SetEnabled_BtnSubmit) == 0x000001, "Wrong size on W_Transaction_PopupWidget_C_SetEnabled_BtnSubmit");
static_assert(offsetof(W_Transaction_PopupWidget_C_SetEnabled_BtnSubmit, bEnabled) == 0x000000, "Member 'W_Transaction_PopupWidget_C_SetEnabled_BtnSubmit::bEnabled' has a wrong offset!");

}

