#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Trading_Category

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Trading_Category.W_Trading_Category_C.ExecuteUbergraph_W_Trading_Category
// 0x0028 (0x0028 - 0x0000)
struct W_Trading_Category_C_ExecuteUbergraph_W_Trading_Category final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelected_ReturnValue;                   // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelected_ReturnValue_1;                 // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Trading_Category_C_ExecuteUbergraph_W_Trading_Category) == 0x000004, "Wrong alignment on W_Trading_Category_C_ExecuteUbergraph_W_Trading_Category");
static_assert(sizeof(W_Trading_Category_C_ExecuteUbergraph_W_Trading_Category) == 0x000028, "Wrong size on W_Trading_Category_C_ExecuteUbergraph_W_Trading_Category");
static_assert(offsetof(W_Trading_Category_C_ExecuteUbergraph_W_Trading_Category, EntryPoint) == 0x000000, "Member 'W_Trading_Category_C_ExecuteUbergraph_W_Trading_Category::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Trading_Category_C_ExecuteUbergraph_W_Trading_Category, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'W_Trading_Category_C_ExecuteUbergraph_W_Trading_Category::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_Trading_Category_C_ExecuteUbergraph_W_Trading_Category, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'W_Trading_Category_C_ExecuteUbergraph_W_Trading_Category::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_Trading_Category_C_ExecuteUbergraph_W_Trading_Category, K2Node_Event_IsDesignTime) == 0x000024, "Member 'W_Trading_Category_C_ExecuteUbergraph_W_Trading_Category::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Trading_Category_C_ExecuteUbergraph_W_Trading_Category, CallFunc_IsSelected_ReturnValue) == 0x000025, "Member 'W_Trading_Category_C_ExecuteUbergraph_W_Trading_Category::CallFunc_IsSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Trading_Category_C_ExecuteUbergraph_W_Trading_Category, CallFunc_IsSelected_ReturnValue_1) == 0x000026, "Member 'W_Trading_Category_C_ExecuteUbergraph_W_Trading_Category::CallFunc_IsSelected_ReturnValue_1' has a wrong offset!");

// Function W_Trading_Category.W_Trading_Category_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Trading_Category_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Trading_Category_C_PreConstruct) == 0x000001, "Wrong alignment on W_Trading_Category_C_PreConstruct");
static_assert(sizeof(W_Trading_Category_C_PreConstruct) == 0x000001, "Wrong size on W_Trading_Category_C_PreConstruct");
static_assert(offsetof(W_Trading_Category_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Trading_Category_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Trading_Category.W_Trading_Category_C.UpdateImageColor
// 0x0040 (0x0040 - 0x0000)
struct W_Trading_Category_C_UpdateImageColor final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0014(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0028(0x0014)()
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Trading_Category_C_UpdateImageColor) == 0x000004, "Wrong alignment on W_Trading_Category_C_UpdateImageColor");
static_assert(sizeof(W_Trading_Category_C_UpdateImageColor) == 0x000040, "Wrong size on W_Trading_Category_C_UpdateImageColor");
static_assert(offsetof(W_Trading_Category_C_UpdateImageColor, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'W_Trading_Category_C_UpdateImageColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Trading_Category_C_UpdateImageColor, K2Node_MakeStruct_SlateColor_1) == 0x000014, "Member 'W_Trading_Category_C_UpdateImageColor::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Trading_Category_C_UpdateImageColor, K2Node_MakeStruct_SlateColor_2) == 0x000028, "Member 'W_Trading_Category_C_UpdateImageColor::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_Trading_Category_C_UpdateImageColor, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00003C, "Member 'W_Trading_Category_C_UpdateImageColor::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Trading_Category_C_UpdateImageColor, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x00003D, "Member 'W_Trading_Category_C_UpdateImageColor::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");

// Function W_Trading_Category.W_Trading_Category_C.UpdateSelectedDesign
// 0x0001 (0x0001 - 0x0000)
struct W_Trading_Category_C_UpdateSelectedDesign final
{
public:
	bool                                          InbSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Trading_Category_C_UpdateSelectedDesign) == 0x000001, "Wrong alignment on W_Trading_Category_C_UpdateSelectedDesign");
static_assert(sizeof(W_Trading_Category_C_UpdateSelectedDesign) == 0x000001, "Wrong size on W_Trading_Category_C_UpdateSelectedDesign");
static_assert(offsetof(W_Trading_Category_C_UpdateSelectedDesign, InbSelected) == 0x000000, "Member 'W_Trading_Category_C_UpdateSelectedDesign::InbSelected' has a wrong offset!");

}

