#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Trading_QuantityControl

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Trading_QuantityControl.W_Trading_QuantityControl_C
// 0x0040 (0x0328 - 0x02E8)
class UW_Trading_QuantityControl_C final : public UP2QuantityControlWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Init;                                              // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Bdr_Outline_Down;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_Outline_Up;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_QuantityControl;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Down;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Outline;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Up;                                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_Trading_QuantityControl(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Trading_QuantityControl_C">();
	}
	static class UW_Trading_QuantityControl_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Trading_QuantityControl_C>();
	}
};
static_assert(alignof(UW_Trading_QuantityControl_C) == 0x000008, "Wrong alignment on UW_Trading_QuantityControl_C");
static_assert(sizeof(UW_Trading_QuantityControl_C) == 0x000328, "Wrong size on UW_Trading_QuantityControl_C");
static_assert(offsetof(UW_Trading_QuantityControl_C, UberGraphFrame) == 0x0002E8, "Member 'UW_Trading_QuantityControl_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Trading_QuantityControl_C, Init) == 0x0002F0, "Member 'UW_Trading_QuantityControl_C::Init' has a wrong offset!");
static_assert(offsetof(UW_Trading_QuantityControl_C, Bdr_Outline_Down) == 0x0002F8, "Member 'UW_Trading_QuantityControl_C::Bdr_Outline_Down' has a wrong offset!");
static_assert(offsetof(UW_Trading_QuantityControl_C, Bdr_Outline_Up) == 0x000300, "Member 'UW_Trading_QuantityControl_C::Bdr_Outline_Up' has a wrong offset!");
static_assert(offsetof(UW_Trading_QuantityControl_C, HB_QuantityControl) == 0x000308, "Member 'UW_Trading_QuantityControl_C::HB_QuantityControl' has a wrong offset!");
static_assert(offsetof(UW_Trading_QuantityControl_C, Img_Down) == 0x000310, "Member 'UW_Trading_QuantityControl_C::Img_Down' has a wrong offset!");
static_assert(offsetof(UW_Trading_QuantityControl_C, Img_Outline) == 0x000318, "Member 'UW_Trading_QuantityControl_C::Img_Outline' has a wrong offset!");
static_assert(offsetof(UW_Trading_QuantityControl_C, Img_Up) == 0x000320, "Member 'UW_Trading_QuantityControl_C::Img_Up' has a wrong offset!");

}

