#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Trading_TradingListItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Trading_TradingListItem.W_Trading_TradingListItem_C
// 0x0028 (0x0370 - 0x0348)
class UW_Trading_TradingListItem_C final : public UP2TradingListItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_CloseBtnOutline;                               // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_TradingItemInfo;                               // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_CloseIcon;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_TradingTypeGradient;                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__W_Trading_TradingItem_Btn_Close_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_Trading_TradingItem_Btn_Close_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void ExecuteUbergraph_W_Trading_TradingListItem(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void UpdateWidgetDesign(bool bIsForBuy)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Trading_TradingListItem_C">();
	}
	static class UW_Trading_TradingListItem_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Trading_TradingListItem_C>();
	}
};
static_assert(alignof(UW_Trading_TradingListItem_C) == 0x000008, "Wrong alignment on UW_Trading_TradingListItem_C");
static_assert(sizeof(UW_Trading_TradingListItem_C) == 0x000370, "Wrong size on UW_Trading_TradingListItem_C");
static_assert(offsetof(UW_Trading_TradingListItem_C, UberGraphFrame) == 0x000348, "Member 'UW_Trading_TradingListItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Trading_TradingListItem_C, Bdr_CloseBtnOutline) == 0x000350, "Member 'UW_Trading_TradingListItem_C::Bdr_CloseBtnOutline' has a wrong offset!");
static_assert(offsetof(UW_Trading_TradingListItem_C, Bdr_TradingItemInfo) == 0x000358, "Member 'UW_Trading_TradingListItem_C::Bdr_TradingItemInfo' has a wrong offset!");
static_assert(offsetof(UW_Trading_TradingListItem_C, Img_CloseIcon) == 0x000360, "Member 'UW_Trading_TradingListItem_C::Img_CloseIcon' has a wrong offset!");
static_assert(offsetof(UW_Trading_TradingListItem_C, Img_TradingTypeGradient) == 0x000368, "Member 'UW_Trading_TradingListItem_C::Img_TradingTypeGradient' has a wrong offset!");

}

