#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Trading_Popup

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Trading_Popup.W_Trading_Popup_C.ExecuteUbergraph_W_Trading_Popup
// 0x0008 (0x0008 - 0x0000)
struct W_Trading_Popup_C_ExecuteUbergraph_W_Trading_Popup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Trading_Popup_C_ExecuteUbergraph_W_Trading_Popup) == 0x000004, "Wrong alignment on W_Trading_Popup_C_ExecuteUbergraph_W_Trading_Popup");
static_assert(sizeof(W_Trading_Popup_C_ExecuteUbergraph_W_Trading_Popup) == 0x000008, "Wrong size on W_Trading_Popup_C_ExecuteUbergraph_W_Trading_Popup");
static_assert(offsetof(W_Trading_Popup_C_ExecuteUbergraph_W_Trading_Popup, EntryPoint) == 0x000000, "Member 'W_Trading_Popup_C_ExecuteUbergraph_W_Trading_Popup::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Trading_Popup_C_ExecuteUbergraph_W_Trading_Popup, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_Trading_Popup_C_ExecuteUbergraph_W_Trading_Popup::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_Trading_Popup.W_Trading_Popup_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Trading_Popup_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Trading_Popup_C_PreConstruct) == 0x000001, "Wrong alignment on W_Trading_Popup_C_PreConstruct");
static_assert(sizeof(W_Trading_Popup_C_PreConstruct) == 0x000001, "Wrong size on W_Trading_Popup_C_PreConstruct");
static_assert(offsetof(W_Trading_Popup_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Trading_Popup_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Trading_Popup.W_Trading_Popup_C.UpdatePopupStyle_ImplementableEvent
// 0x0010 (0x0010 - 0x0000)
struct W_Trading_Popup_C_UpdatePopupStyle_ImplementableEvent final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Trading_Popup_C_UpdatePopupStyle_ImplementableEvent) == 0x000008, "Wrong alignment on W_Trading_Popup_C_UpdatePopupStyle_ImplementableEvent");
static_assert(sizeof(W_Trading_Popup_C_UpdatePopupStyle_ImplementableEvent) == 0x000010, "Wrong size on W_Trading_Popup_C_UpdatePopupStyle_ImplementableEvent");
static_assert(offsetof(W_Trading_Popup_C_UpdatePopupStyle_ImplementableEvent, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'W_Trading_Popup_C_UpdatePopupStyle_ImplementableEvent::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Trading_Popup_C_UpdatePopupStyle_ImplementableEvent, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'W_Trading_Popup_C_UpdatePopupStyle_ImplementableEvent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

