#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TutorialGuide_Highlight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_TutorialGuide_Highlight.W_TutorialGuide_Highlight_C
// 0x0040 (0x0350 - 0x0310)
class UW_TutorialGuide_Highlight_C final : public UP2TutorialGuideHighlightWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Highlight01Init;                                   // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Highlight02Init;                                   // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Highlight02FadeInAnim;                             // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Highlight01FadeInAnim;                             // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Highlight01Anim;                                   // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Highlight02Anim;                                   // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Ovr_Highlight02;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_TutorialGuide_Highlight(int32 EntryPoint)	 // 0xae1e64;
	void Finished_01F8AE2D401B0D1E4A4559A9B69F3DD9()	 // 0xae1e64;
	void Finished_57885D8D4FF5C8DE9C8878A3100BCB88()	 // 0xae1e64;
	void Finished_7FA42BDF400042E16CCBBE94BFF678B7()	 // 0xae1e64;
	void Finished_C18C70B24249B41BDAB4D7B5EFD35805()	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SequenceEvent__ENTRYPOINTW_TutorialGuide_Highlight()	 // 0xae1e64;
	void SequenceEvent__ENTRYPOINTW_TutorialGuide_Highlight_0()	 // 0xae1e64;
	void SourcePlaySound()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_TutorialGuide_Highlight_C">();
	}
	static class UW_TutorialGuide_Highlight_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_TutorialGuide_Highlight_C>();
	}
};
static_assert(alignof(UW_TutorialGuide_Highlight_C) == 0x000008, "Wrong alignment on UW_TutorialGuide_Highlight_C");
static_assert(sizeof(UW_TutorialGuide_Highlight_C) == 0x000350, "Wrong size on UW_TutorialGuide_Highlight_C");
static_assert(offsetof(UW_TutorialGuide_Highlight_C, UberGraphFrame) == 0x000310, "Member 'UW_TutorialGuide_Highlight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_TutorialGuide_Highlight_C, Highlight01Init) == 0x000318, "Member 'UW_TutorialGuide_Highlight_C::Highlight01Init' has a wrong offset!");
static_assert(offsetof(UW_TutorialGuide_Highlight_C, Highlight02Init) == 0x000320, "Member 'UW_TutorialGuide_Highlight_C::Highlight02Init' has a wrong offset!");
static_assert(offsetof(UW_TutorialGuide_Highlight_C, Highlight02FadeInAnim) == 0x000328, "Member 'UW_TutorialGuide_Highlight_C::Highlight02FadeInAnim' has a wrong offset!");
static_assert(offsetof(UW_TutorialGuide_Highlight_C, Highlight01FadeInAnim) == 0x000330, "Member 'UW_TutorialGuide_Highlight_C::Highlight01FadeInAnim' has a wrong offset!");
static_assert(offsetof(UW_TutorialGuide_Highlight_C, Highlight01Anim) == 0x000338, "Member 'UW_TutorialGuide_Highlight_C::Highlight01Anim' has a wrong offset!");
static_assert(offsetof(UW_TutorialGuide_Highlight_C, Highlight02Anim) == 0x000340, "Member 'UW_TutorialGuide_Highlight_C::Highlight02Anim' has a wrong offset!");
static_assert(offsetof(UW_TutorialGuide_Highlight_C, Ovr_Highlight02) == 0x000348, "Member 'UW_TutorialGuide_Highlight_C::Ovr_Highlight02' has a wrong offset!");

}

