#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TutorialGuide

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_TutorialGuide.W_TutorialGuide_C
// 0x0020 (0x0720 - 0x0700)
class UW_TutorialGuide_C final : public UP2TutorialGuideWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0700(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HighlightFadeInAnim;                               // 0x0708(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HighlightAnim;                                     // 0x0710(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Ovr_Highlight;                                     // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_TutorialGuide(int32 EntryPoint)	 // 0xae1e64;
	void Finished_A16FC667454B1DD25188AE9CA2013FF7()	 // 0xae1e64;
	void OnHighlightLoopSound()	 // 0xae1e64;
	void OnHighlightSound()	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SequenceEvent__ENTRYPOINTW_TutorialGuide()	 // 0xae1e64;
	void SequenceEvent__ENTRYPOINTW_TutorialGuide_0()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_TutorialGuide_C">();
	}
	static class UW_TutorialGuide_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_TutorialGuide_C>();
	}
};
static_assert(alignof(UW_TutorialGuide_C) == 0x000010, "Wrong alignment on UW_TutorialGuide_C");
static_assert(sizeof(UW_TutorialGuide_C) == 0x000720, "Wrong size on UW_TutorialGuide_C");
static_assert(offsetof(UW_TutorialGuide_C, UberGraphFrame) == 0x000700, "Member 'UW_TutorialGuide_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_TutorialGuide_C, HighlightFadeInAnim) == 0x000708, "Member 'UW_TutorialGuide_C::HighlightFadeInAnim' has a wrong offset!");
static_assert(offsetof(UW_TutorialGuide_C, HighlightAnim) == 0x000710, "Member 'UW_TutorialGuide_C::HighlightAnim' has a wrong offset!");
static_assert(offsetof(UW_TutorialGuide_C, Ovr_Highlight) == 0x000718, "Member 'UW_TutorialGuide_C::Ovr_Highlight' has a wrong offset!");

}

