#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TutorialGuide

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function W_TutorialGuide.W_TutorialGuide_C.ExecuteUbergraph_W_TutorialGuide
// 0x00A0 (0x00A0 - 0x0000)
struct W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRemainingPlaySoundCount_ReturnValue;   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRemainingPlaySoundCount_ReturnValue_1; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0048(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide) == 0x000008, "Wrong alignment on W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide");
static_assert(sizeof(W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide) == 0x0000A0, "Wrong size on W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide");
static_assert(offsetof(W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide, EntryPoint) == 0x000000, "Member 'W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide, CallFunc_GetRemainingPlaySoundCount_ReturnValue) == 0x000014, "Member 'W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide::CallFunc_GetRemainingPlaySoundCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide, CallFunc_GetRemainingPlaySoundCount_ReturnValue_1) == 0x000018, "Member 'W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide::CallFunc_GetRemainingPlaySoundCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000028, "Member 'W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide, K2Node_Event_IsDesignTime) == 0x000030, "Member 'W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000040, "Member 'W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide, Temp_delegate_Variable) == 0x000048, "Member 'W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide, CallFunc_GetPosition_ReturnValue) == 0x000058, "Member 'W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide, CallFunc_PostEvent_ReturnValue) == 0x000068, "Member 'W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide, CallFunc_BreakVector2D_X) == 0x000070, "Member 'W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide, CallFunc_BreakVector2D_Y) == 0x000078, "Member 'W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000080, "Member 'W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000088, "Member 'W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000090, "Member 'W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'W_TutorialGuide_C_ExecuteUbergraph_W_TutorialGuide::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function W_TutorialGuide.W_TutorialGuide_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_TutorialGuide_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TutorialGuide_C_PreConstruct) == 0x000001, "Wrong alignment on W_TutorialGuide_C_PreConstruct");
static_assert(sizeof(W_TutorialGuide_C_PreConstruct) == 0x000001, "Wrong size on W_TutorialGuide_C_PreConstruct");
static_assert(offsetof(W_TutorialGuide_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_TutorialGuide_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

