#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TutorialGuide_Highlight

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function W_TutorialGuide_Highlight.W_TutorialGuide_Highlight_C.ExecuteUbergraph_W_TutorialGuide_Highlight
// 0x00D8 (0x00D8 - 0x0000)
struct W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRemainingPlaySoundCount_ReturnValue;   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0094(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_2;  // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_3;  // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_3; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRemainingPlaySoundCount_ReturnValue_1; // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight) == 0x000008, "Wrong alignment on W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight");
static_assert(sizeof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight) == 0x0000D8, "Wrong size on W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, EntryPoint) == 0x000000, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, CallFunc_IsVisible_ReturnValue) == 0x000004, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000038, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, CallFunc_GetRemainingPlaySoundCount_ReturnValue) == 0x000040, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::CallFunc_GetRemainingPlaySoundCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, CallFunc_Subtract_IntInt_ReturnValue) == 0x000044, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, CallFunc_IsVisible_ReturnValue_1) == 0x000048, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, K2Node_Event_IsDesignTime) == 0x000049, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, CallFunc_PlayAnimation_ReturnValue_1) == 0x000058, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, K2Node_CreateDelegate_OutputDelegate_3) == 0x000060, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000070, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000078, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000080, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000088, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, CallFunc_IsValid_ReturnValue_1) == 0x000091, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, Temp_delegate_Variable) == 0x000094, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, CallFunc_CreatePlayAnimationProxyObject_Result_2) == 0x0000A8, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::CallFunc_CreatePlayAnimationProxyObject_Result_2' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2) == 0x0000B0, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, CallFunc_PostEvent_ReturnValue) == 0x0000B8, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, CallFunc_IsValid_ReturnValue_2) == 0x0000BC, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, CallFunc_CreatePlayAnimationProxyObject_Result_3) == 0x0000C0, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::CallFunc_CreatePlayAnimationProxyObject_Result_3' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_3) == 0x0000C8, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, CallFunc_GetRemainingPlaySoundCount_ReturnValue_1) == 0x0000D0, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::CallFunc_GetRemainingPlaySoundCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D4, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight, CallFunc_IsValid_ReturnValue_3) == 0x0000D5, "Member 'W_TutorialGuide_Highlight_C_ExecuteUbergraph_W_TutorialGuide_Highlight::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function W_TutorialGuide_Highlight.W_TutorialGuide_Highlight_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_TutorialGuide_Highlight_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TutorialGuide_Highlight_C_PreConstruct) == 0x000001, "Wrong alignment on W_TutorialGuide_Highlight_C_PreConstruct");
static_assert(sizeof(W_TutorialGuide_Highlight_C_PreConstruct) == 0x000001, "Wrong size on W_TutorialGuide_Highlight_C_PreConstruct");
static_assert(offsetof(W_TutorialGuide_Highlight_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_TutorialGuide_Highlight_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

