#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_VaultingWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_VaultingWidget.W_VaultingWidget_C
// 0x0030 (0x02B0 - 0x0280)
class UW_VaultingWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               Ovr_Vaulting;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ovr_Vaulting_Shadow;                               // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ovr_Vaulting_Ui;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Keybind;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        VaultEdgeAngle;                                    // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_VaultingWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_VaultingWidget_C">();
	}
	static class UW_VaultingWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_VaultingWidget_C>();
	}
};
static_assert(alignof(UW_VaultingWidget_C) == 0x000008, "Wrong alignment on UW_VaultingWidget_C");
static_assert(sizeof(UW_VaultingWidget_C) == 0x0002B0, "Wrong size on UW_VaultingWidget_C");
static_assert(offsetof(UW_VaultingWidget_C, UberGraphFrame) == 0x000280, "Member 'UW_VaultingWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_VaultingWidget_C, Ovr_Vaulting) == 0x000288, "Member 'UW_VaultingWidget_C::Ovr_Vaulting' has a wrong offset!");
static_assert(offsetof(UW_VaultingWidget_C, Ovr_Vaulting_Shadow) == 0x000290, "Member 'UW_VaultingWidget_C::Ovr_Vaulting_Shadow' has a wrong offset!");
static_assert(offsetof(UW_VaultingWidget_C, Ovr_Vaulting_Ui) == 0x000298, "Member 'UW_VaultingWidget_C::Ovr_Vaulting_Ui' has a wrong offset!");
static_assert(offsetof(UW_VaultingWidget_C, SzB_Keybind) == 0x0002A0, "Member 'UW_VaultingWidget_C::SzB_Keybind' has a wrong offset!");
static_assert(offsetof(UW_VaultingWidget_C, VaultEdgeAngle) == 0x0002A8, "Member 'UW_VaultingWidget_C::VaultEdgeAngle' has a wrong offset!");

}

