#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Vincinity_Container

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Vincinity_Container.W_Vincinity_Container_C
// 0x0020 (0x0370 - 0x0350)
class UW_Vincinity_Container_C final : public UP2VincinityContainerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Outline;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_HeadlineWidget_C*          W_Inventory_HeadlineWidget;                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_Item_C*                    W_Inventory_Item;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Vincinity_Container(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Vincinity_Container_C">();
	}
	static class UW_Vincinity_Container_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Vincinity_Container_C>();
	}
};
static_assert(alignof(UW_Vincinity_Container_C) == 0x000008, "Wrong alignment on UW_Vincinity_Container_C");
static_assert(sizeof(UW_Vincinity_Container_C) == 0x000370, "Wrong size on UW_Vincinity_Container_C");
static_assert(offsetof(UW_Vincinity_Container_C, UberGraphFrame) == 0x000350, "Member 'UW_Vincinity_Container_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Vincinity_Container_C, Img_Outline) == 0x000358, "Member 'UW_Vincinity_Container_C::Img_Outline' has a wrong offset!");
static_assert(offsetof(UW_Vincinity_Container_C, W_Inventory_HeadlineWidget) == 0x000360, "Member 'UW_Vincinity_Container_C::W_Inventory_HeadlineWidget' has a wrong offset!");
static_assert(offsetof(UW_Vincinity_Container_C, W_Inventory_Item) == 0x000368, "Member 'UW_Vincinity_Container_C::W_Inventory_Item' has a wrong offset!");

}

