#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WaypointMarker

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_WaypointMarker.W_WaypointMarker_C.ExecuteUbergraph_W_WaypointMarker
// 0x000C (0x000C - 0x0000)
struct W_WaypointMarker_C_ExecuteUbergraph_W_WaypointMarker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InIndex;                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_WaypointMarker_C_ExecuteUbergraph_W_WaypointMarker) == 0x000004, "Wrong alignment on W_WaypointMarker_C_ExecuteUbergraph_W_WaypointMarker");
static_assert(sizeof(W_WaypointMarker_C_ExecuteUbergraph_W_WaypointMarker) == 0x00000C, "Wrong size on W_WaypointMarker_C_ExecuteUbergraph_W_WaypointMarker");
static_assert(offsetof(W_WaypointMarker_C_ExecuteUbergraph_W_WaypointMarker, EntryPoint) == 0x000000, "Member 'W_WaypointMarker_C_ExecuteUbergraph_W_WaypointMarker::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_WaypointMarker_C_ExecuteUbergraph_W_WaypointMarker, K2Node_Event_InIndex) == 0x000004, "Member 'W_WaypointMarker_C_ExecuteUbergraph_W_WaypointMarker::K2Node_Event_InIndex' has a wrong offset!");
static_assert(offsetof(W_WaypointMarker_C_ExecuteUbergraph_W_WaypointMarker, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'W_WaypointMarker_C_ExecuteUbergraph_W_WaypointMarker::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function W_WaypointMarker.W_WaypointMarker_C.SetWaypointIndex
// 0x0004 (0x0004 - 0x0000)
struct W_WaypointMarker_C_SetWaypointIndex final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_WaypointMarker_C_SetWaypointIndex) == 0x000004, "Wrong alignment on W_WaypointMarker_C_SetWaypointIndex");
static_assert(sizeof(W_WaypointMarker_C_SetWaypointIndex) == 0x000004, "Wrong size on W_WaypointMarker_C_SetWaypointIndex");
static_assert(offsetof(W_WaypointMarker_C_SetWaypointIndex, InIndex) == 0x000000, "Member 'W_WaypointMarker_C_SetWaypointIndex::InIndex' has a wrong offset!");

}

