#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WeaponSkin_ColorPicker

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_WeaponSkin_ColorPicker.W_WeaponSkin_ColorPicker_C.OnSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct W_WeaponSkin_ColorPicker_C_OnSelectionChanged final
{
public:
	bool                                          bNewSelected;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_WeaponSkin_ColorPicker_C_OnSelectionChanged) == 0x000001, "Wrong alignment on W_WeaponSkin_ColorPicker_C_OnSelectionChanged");
static_assert(sizeof(W_WeaponSkin_ColorPicker_C_OnSelectionChanged) == 0x000001, "Wrong size on W_WeaponSkin_ColorPicker_C_OnSelectionChanged");
static_assert(offsetof(W_WeaponSkin_ColorPicker_C_OnSelectionChanged, bNewSelected) == 0x000000, "Member 'W_WeaponSkin_ColorPicker_C_OnSelectionChanged::bNewSelected' has a wrong offset!");

// Function W_WeaponSkin_ColorPicker.W_WeaponSkin_ColorPicker_C.ExecuteUbergraph_W_WeaponSkin_ColorPicker
// 0x0030 (0x0030 - 0x0000)
struct W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewSelected;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker) == 0x000008, "Wrong alignment on W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker");
static_assert(sizeof(W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker) == 0x000030, "Wrong size on W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker");
static_assert(offsetof(W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker, EntryPoint) == 0x000000, "Member 'W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker, Temp_bool_Variable) == 0x000004, "Member 'W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker, Temp_byte_Variable) == 0x000005, "Member 'W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker, Temp_byte_Variable_1) == 0x000006, "Member 'W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker, Temp_bool_Variable_1) == 0x000007, "Member 'W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker, Temp_byte_Variable_2) == 0x000008, "Member 'W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker, Temp_byte_Variable_3) == 0x000009, "Member 'W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker, Temp_bool_Variable_2) == 0x00000A, "Member 'W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker, Temp_byte_Variable_4) == 0x00000B, "Member 'W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker, Temp_byte_Variable_5) == 0x00000C, "Member 'W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker, Temp_bool_Variable_3) == 0x00000D, "Member 'W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker, Temp_byte_Variable_6) == 0x00000E, "Member 'W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker, Temp_byte_Variable_7) == 0x00000F, "Member 'W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker, K2Node_Event_bNewSelected) == 0x000010, "Member 'W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker::K2Node_Event_bNewSelected' has a wrong offset!");
static_assert(offsetof(W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker, K2Node_Select_Default) == 0x000011, "Member 'W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker, K2Node_Select_Default_1) == 0x000028, "Member 'W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker, K2Node_Select_Default_2) == 0x000029, "Member 'W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker, K2Node_Select_Default_3) == 0x00002A, "Member 'W_WeaponSkin_ColorPicker_C_ExecuteUbergraph_W_WeaponSkin_ColorPicker::K2Node_Select_Default_3' has a wrong offset!");

}

