#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WeaponHudWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function W_WeaponHudWidget.W_WeaponHudWidget_C.ExecuteUbergraph_W_WeaponHudWidget
// 0x0050 (0x0050 - 0x0000)
struct W_WeaponHudWidget_C_ExecuteUbergraph_W_WeaponHudWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FP2LootMessage& InLoot)> K2Node_CreateDelegate_OutputDelegate;       // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2LootMessage                         K2Node_CustomEvent_InLoot;                         // 0x0020(0x0010)(ConstParm)
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2InventoryManagerComponent*           CallFunc_GetInventoryManagerComponent_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_WeaponHudWidget_C_ExecuteUbergraph_W_WeaponHudWidget) == 0x000008, "Wrong alignment on W_WeaponHudWidget_C_ExecuteUbergraph_W_WeaponHudWidget");
static_assert(sizeof(W_WeaponHudWidget_C_ExecuteUbergraph_W_WeaponHudWidget) == 0x000050, "Wrong size on W_WeaponHudWidget_C_ExecuteUbergraph_W_WeaponHudWidget");
static_assert(offsetof(W_WeaponHudWidget_C_ExecuteUbergraph_W_WeaponHudWidget, EntryPoint) == 0x000000, "Member 'W_WeaponHudWidget_C_ExecuteUbergraph_W_WeaponHudWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_ExecuteUbergraph_W_WeaponHudWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'W_WeaponHudWidget_C_ExecuteUbergraph_W_WeaponHudWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_ExecuteUbergraph_W_WeaponHudWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'W_WeaponHudWidget_C_ExecuteUbergraph_W_WeaponHudWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_ExecuteUbergraph_W_WeaponHudWidget, K2Node_CustomEvent_InLoot) == 0x000020, "Member 'W_WeaponHudWidget_C_ExecuteUbergraph_W_WeaponHudWidget::K2Node_CustomEvent_InLoot' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_ExecuteUbergraph_W_WeaponHudWidget, K2Node_DynamicCast_AsP2Player_Controller) == 0x000030, "Member 'W_WeaponHudWidget_C_ExecuteUbergraph_W_WeaponHudWidget::K2Node_DynamicCast_AsP2Player_Controller' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_ExecuteUbergraph_W_WeaponHudWidget, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'W_WeaponHudWidget_C_ExecuteUbergraph_W_WeaponHudWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_ExecuteUbergraph_W_WeaponHudWidget, CallFunc_GetInventoryManagerComponent_ReturnValue) == 0x000040, "Member 'W_WeaponHudWidget_C_ExecuteUbergraph_W_WeaponHudWidget::CallFunc_GetInventoryManagerComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_ExecuteUbergraph_W_WeaponHudWidget, K2Node_Event_IsDesignTime) == 0x000048, "Member 'W_WeaponHudWidget_C_ExecuteUbergraph_W_WeaponHudWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_WeaponHudWidget.W_WeaponHudWidget_C.Get Loot Entries As Text
// 0x0220 (0x0220 - 0x0000)
struct W_WeaponHudWidget_C_Get_Loot_Entries_As_Text final
{
public:
	struct FP2LootMessage                         InMessage;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   OutText;                                           // 0x0010(0x0018)(Parm, OutParm)
	class FText                                   Text;                                              // 0x0028(0x0018)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FP2LootMessageEntry                    CallFunc_Array_Get_Item;                           // 0x0048(0x0010)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x00C8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0130(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0140(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0190(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01A8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0208(0x0018)()
};
static_assert(alignof(W_WeaponHudWidget_C_Get_Loot_Entries_As_Text) == 0x000008, "Wrong alignment on W_WeaponHudWidget_C_Get_Loot_Entries_As_Text");
static_assert(sizeof(W_WeaponHudWidget_C_Get_Loot_Entries_As_Text) == 0x000220, "Wrong size on W_WeaponHudWidget_C_Get_Loot_Entries_As_Text");
static_assert(offsetof(W_WeaponHudWidget_C_Get_Loot_Entries_As_Text, InMessage) == 0x000000, "Member 'W_WeaponHudWidget_C_Get_Loot_Entries_As_Text::InMessage' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_Get_Loot_Entries_As_Text, OutText) == 0x000010, "Member 'W_WeaponHudWidget_C_Get_Loot_Entries_As_Text::OutText' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_Get_Loot_Entries_As_Text, Text) == 0x000028, "Member 'W_WeaponHudWidget_C_Get_Loot_Entries_As_Text::Text' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_Get_Loot_Entries_As_Text, Temp_int_Array_Index_Variable) == 0x000040, "Member 'W_WeaponHudWidget_C_Get_Loot_Entries_As_Text::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_Get_Loot_Entries_As_Text, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'W_WeaponHudWidget_C_Get_Loot_Entries_As_Text::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_Get_Loot_Entries_As_Text, CallFunc_Array_Get_Item) == 0x000048, "Member 'W_WeaponHudWidget_C_Get_Loot_Entries_As_Text::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_Get_Loot_Entries_As_Text, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'W_WeaponHudWidget_C_Get_Loot_Entries_As_Text::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_Get_Loot_Entries_As_Text, CallFunc_Max_ReturnValue) == 0x00005C, "Member 'W_WeaponHudWidget_C_Get_Loot_Entries_As_Text::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_Get_Loot_Entries_As_Text, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000060, "Member 'W_WeaponHudWidget_C_Get_Loot_Entries_As_Text::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_Get_Loot_Entries_As_Text, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'W_WeaponHudWidget_C_Get_Loot_Entries_As_Text::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_Get_Loot_Entries_As_Text, K2Node_MakeStruct_FormatArgumentData) == 0x000070, "Member 'W_WeaponHudWidget_C_Get_Loot_Entries_As_Text::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_Get_Loot_Entries_As_Text, CallFunc_Add_IntInt_ReturnValue) == 0x0000C0, "Member 'W_WeaponHudWidget_C_Get_Loot_Entries_As_Text::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_Get_Loot_Entries_As_Text, CallFunc_TextToUpper_ReturnValue) == 0x0000C8, "Member 'W_WeaponHudWidget_C_Get_Loot_Entries_As_Text::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_Get_Loot_Entries_As_Text, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000E0, "Member 'W_WeaponHudWidget_C_Get_Loot_Entries_As_Text::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_Get_Loot_Entries_As_Text, K2Node_MakeArray_Array) == 0x000130, "Member 'W_WeaponHudWidget_C_Get_Loot_Entries_As_Text::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_Get_Loot_Entries_As_Text, K2Node_MakeStruct_FormatArgumentData_2) == 0x000140, "Member 'W_WeaponHudWidget_C_Get_Loot_Entries_As_Text::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_Get_Loot_Entries_As_Text, CallFunc_Format_ReturnValue) == 0x000190, "Member 'W_WeaponHudWidget_C_Get_Loot_Entries_As_Text::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_Get_Loot_Entries_As_Text, K2Node_MakeStruct_FormatArgumentData_3) == 0x0001A8, "Member 'W_WeaponHudWidget_C_Get_Loot_Entries_As_Text::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_Get_Loot_Entries_As_Text, K2Node_MakeArray_Array_1) == 0x0001F8, "Member 'W_WeaponHudWidget_C_Get_Loot_Entries_As_Text::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_WeaponHudWidget_C_Get_Loot_Entries_As_Text, CallFunc_Format_ReturnValue_1) == 0x000208, "Member 'W_WeaponHudWidget_C_Get_Loot_Entries_As_Text::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function W_WeaponHudWidget.W_WeaponHudWidget_C.OnLootMessageDelegate_Event_0
// 0x0010 (0x0010 - 0x0000)
struct W_WeaponHudWidget_C_OnLootMessageDelegate_Event_0 final
{
public:
	struct FP2LootMessage                         InLoot;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_WeaponHudWidget_C_OnLootMessageDelegate_Event_0) == 0x000008, "Wrong alignment on W_WeaponHudWidget_C_OnLootMessageDelegate_Event_0");
static_assert(sizeof(W_WeaponHudWidget_C_OnLootMessageDelegate_Event_0) == 0x000010, "Wrong size on W_WeaponHudWidget_C_OnLootMessageDelegate_Event_0");
static_assert(offsetof(W_WeaponHudWidget_C_OnLootMessageDelegate_Event_0, InLoot) == 0x000000, "Member 'W_WeaponHudWidget_C_OnLootMessageDelegate_Event_0::InLoot' has a wrong offset!");

// Function W_WeaponHudWidget.W_WeaponHudWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_WeaponHudWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_WeaponHudWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_WeaponHudWidget_C_PreConstruct");
static_assert(sizeof(W_WeaponHudWidget_C_PreConstruct) == 0x000001, "Wrong size on W_WeaponHudWidget_C_PreConstruct");
static_assert(offsetof(W_WeaponHudWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_WeaponHudWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

