#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WeaponList

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_WeaponList.W_WeaponList_C.ExecuteUbergraph_W_WeaponList
// 0x0008 (0x0008 - 0x0000)
struct W_WeaponList_C_ExecuteUbergraph_W_WeaponList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InShowTimeSec;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_WeaponList_C_ExecuteUbergraph_W_WeaponList) == 0x000004, "Wrong alignment on W_WeaponList_C_ExecuteUbergraph_W_WeaponList");
static_assert(sizeof(W_WeaponList_C_ExecuteUbergraph_W_WeaponList) == 0x000008, "Wrong size on W_WeaponList_C_ExecuteUbergraph_W_WeaponList");
static_assert(offsetof(W_WeaponList_C_ExecuteUbergraph_W_WeaponList, EntryPoint) == 0x000000, "Member 'W_WeaponList_C_ExecuteUbergraph_W_WeaponList::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_WeaponList_C_ExecuteUbergraph_W_WeaponList, K2Node_Event_InShowTimeSec) == 0x000004, "Member 'W_WeaponList_C_ExecuteUbergraph_W_WeaponList::K2Node_Event_InShowTimeSec' has a wrong offset!");

// Function W_WeaponList.W_WeaponList_C.PlayFadeInAnim_ImplementableEvent
// 0x0004 (0x0004 - 0x0000)
struct W_WeaponList_C_PlayFadeInAnim_ImplementableEvent final
{
public:
	float                                         InShowTimeSec;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_WeaponList_C_PlayFadeInAnim_ImplementableEvent) == 0x000004, "Wrong alignment on W_WeaponList_C_PlayFadeInAnim_ImplementableEvent");
static_assert(sizeof(W_WeaponList_C_PlayFadeInAnim_ImplementableEvent) == 0x000004, "Wrong size on W_WeaponList_C_PlayFadeInAnim_ImplementableEvent");
static_assert(offsetof(W_WeaponList_C_PlayFadeInAnim_ImplementableEvent, InShowTimeSec) == 0x000000, "Member 'W_WeaponList_C_PlayFadeInAnim_ImplementableEvent::InShowTimeSec' has a wrong offset!");

}

