#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WeaponHudWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_WeaponHudWidget.W_WeaponHudWidget_C
// 0x0080 (0x0428 - 0x03A8)
class UW_WeaponHudWidget_C final : public UP2WeaponHUD_Main
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ReserveFadeInAnim;                                 // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ReserveFadeOutAnim;                                // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CP_ReserveInfo;                                    // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           R_CurMagazine;                                     // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_AmmoType;                                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AP2HeroCharacter*                       Hero;                                              // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentStamina;                                    // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentHealth;                                     // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentWeight;                                     // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UP2CharacterMovementComponent*          P2CMC;                                             // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_WeaponHud_MagWidget_C*>       WeaponHudMagazines;                                // 0x0400(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FLinearColor                           UnavailableColor;                                  // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAdsHud;                                          // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_WeaponHudWidget(int32 EntryPoint)	 // 0xae1e64;
	void Get_Loot_Entries_As_Text(const struct FP2LootMessage& InMessage, class FText* OutText)	 // 0xae1e64;
	void OnLootMessageDelegate_Event_0(const struct FP2LootMessage& InLoot)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void UpdateFireMode()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_WeaponHudWidget_C">();
	}
	static class UW_WeaponHudWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_WeaponHudWidget_C>();
	}
};
static_assert(alignof(UW_WeaponHudWidget_C) == 0x000008, "Wrong alignment on UW_WeaponHudWidget_C");
static_assert(sizeof(UW_WeaponHudWidget_C) == 0x000428, "Wrong size on UW_WeaponHudWidget_C");
static_assert(offsetof(UW_WeaponHudWidget_C, UberGraphFrame) == 0x0003A8, "Member 'UW_WeaponHudWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_WeaponHudWidget_C, ReserveFadeInAnim) == 0x0003B0, "Member 'UW_WeaponHudWidget_C::ReserveFadeInAnim' has a wrong offset!");
static_assert(offsetof(UW_WeaponHudWidget_C, ReserveFadeOutAnim) == 0x0003B8, "Member 'UW_WeaponHudWidget_C::ReserveFadeOutAnim' has a wrong offset!");
static_assert(offsetof(UW_WeaponHudWidget_C, CP_ReserveInfo) == 0x0003C0, "Member 'UW_WeaponHudWidget_C::CP_ReserveInfo' has a wrong offset!");
static_assert(offsetof(UW_WeaponHudWidget_C, R_CurMagazine) == 0x0003C8, "Member 'UW_WeaponHudWidget_C::R_CurMagazine' has a wrong offset!");
static_assert(offsetof(UW_WeaponHudWidget_C, Txt_AmmoType) == 0x0003D0, "Member 'UW_WeaponHudWidget_C::Txt_AmmoType' has a wrong offset!");
static_assert(offsetof(UW_WeaponHudWidget_C, Hero) == 0x0003D8, "Member 'UW_WeaponHudWidget_C::Hero' has a wrong offset!");
static_assert(offsetof(UW_WeaponHudWidget_C, CurrentStamina) == 0x0003E0, "Member 'UW_WeaponHudWidget_C::CurrentStamina' has a wrong offset!");
static_assert(offsetof(UW_WeaponHudWidget_C, CurrentHealth) == 0x0003E8, "Member 'UW_WeaponHudWidget_C::CurrentHealth' has a wrong offset!");
static_assert(offsetof(UW_WeaponHudWidget_C, CurrentWeight) == 0x0003F0, "Member 'UW_WeaponHudWidget_C::CurrentWeight' has a wrong offset!");
static_assert(offsetof(UW_WeaponHudWidget_C, P2CMC) == 0x0003F8, "Member 'UW_WeaponHudWidget_C::P2CMC' has a wrong offset!");
static_assert(offsetof(UW_WeaponHudWidget_C, WeaponHudMagazines) == 0x000400, "Member 'UW_WeaponHudWidget_C::WeaponHudMagazines' has a wrong offset!");
static_assert(offsetof(UW_WeaponHudWidget_C, UnavailableColor) == 0x000410, "Member 'UW_WeaponHudWidget_C::UnavailableColor' has a wrong offset!");
static_assert(offsetof(UW_WeaponHudWidget_C, IsAdsHud) == 0x000420, "Member 'UW_WeaponHudWidget_C::IsAdsHud' has a wrong offset!");

}

