#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WeaponListWidget

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function W_WeaponListWidget.W_WeaponListWidget_C.GetEquipItemNameAndTypeByText
// 0x00E8 (0x00E8 - 0x0000)
struct W_WeaponListWidget_C_GetEquipItemNameAndTypeByText final
{
public:
	struct FGameplayTag                           InItemTypeTag;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class FText                                   OutItemName;                                       // 0x0008(0x0018)(Parm, OutParm)
	class FText                                   OutItemType;                                       // 0x0020(0x0018)(Parm, OutParm)
	class FText                                   txtItemType;                                       // 0x0038(0x0018)(Edit, BlueprintVisible)
	class FText                                   txtItemName;                                       // 0x0050(0x0018)(Edit, BlueprintVisible)
	int32                                         TagNum;                                            // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x0088(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A0(0x0018)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ToUpper_ReturnValue;                      // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00D0(0x0018)()
};
static_assert(alignof(W_WeaponListWidget_C_GetEquipItemNameAndTypeByText) == 0x000008, "Wrong alignment on W_WeaponListWidget_C_GetEquipItemNameAndTypeByText");
static_assert(sizeof(W_WeaponListWidget_C_GetEquipItemNameAndTypeByText) == 0x0000E8, "Wrong size on W_WeaponListWidget_C_GetEquipItemNameAndTypeByText");
static_assert(offsetof(W_WeaponListWidget_C_GetEquipItemNameAndTypeByText, InItemTypeTag) == 0x000000, "Member 'W_WeaponListWidget_C_GetEquipItemNameAndTypeByText::InItemTypeTag' has a wrong offset!");
static_assert(offsetof(W_WeaponListWidget_C_GetEquipItemNameAndTypeByText, OutItemName) == 0x000008, "Member 'W_WeaponListWidget_C_GetEquipItemNameAndTypeByText::OutItemName' has a wrong offset!");
static_assert(offsetof(W_WeaponListWidget_C_GetEquipItemNameAndTypeByText, OutItemType) == 0x000020, "Member 'W_WeaponListWidget_C_GetEquipItemNameAndTypeByText::OutItemType' has a wrong offset!");
static_assert(offsetof(W_WeaponListWidget_C_GetEquipItemNameAndTypeByText, txtItemType) == 0x000038, "Member 'W_WeaponListWidget_C_GetEquipItemNameAndTypeByText::txtItemType' has a wrong offset!");
static_assert(offsetof(W_WeaponListWidget_C_GetEquipItemNameAndTypeByText, txtItemName) == 0x000050, "Member 'W_WeaponListWidget_C_GetEquipItemNameAndTypeByText::txtItemName' has a wrong offset!");
static_assert(offsetof(W_WeaponListWidget_C_GetEquipItemNameAndTypeByText, TagNum) == 0x000068, "Member 'W_WeaponListWidget_C_GetEquipItemNameAndTypeByText::TagNum' has a wrong offset!");
static_assert(offsetof(W_WeaponListWidget_C_GetEquipItemNameAndTypeByText, CallFunc_GetTagName_ReturnValue) == 0x00006C, "Member 'W_WeaponListWidget_C_GetEquipItemNameAndTypeByText::CallFunc_GetTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponListWidget_C_GetEquipItemNameAndTypeByText, CallFunc_Conv_NameToString_ReturnValue) == 0x000078, "Member 'W_WeaponListWidget_C_GetEquipItemNameAndTypeByText::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponListWidget_C_GetEquipItemNameAndTypeByText, CallFunc_ParseIntoArray_ReturnValue) == 0x000088, "Member 'W_WeaponListWidget_C_GetEquipItemNameAndTypeByText::CallFunc_ParseIntoArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponListWidget_C_GetEquipItemNameAndTypeByText, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'W_WeaponListWidget_C_GetEquipItemNameAndTypeByText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponListWidget_C_GetEquipItemNameAndTypeByText, CallFunc_Subtract_IntInt_ReturnValue) == 0x00009C, "Member 'W_WeaponListWidget_C_GetEquipItemNameAndTypeByText::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponListWidget_C_GetEquipItemNameAndTypeByText, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A0, "Member 'W_WeaponListWidget_C_GetEquipItemNameAndTypeByText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponListWidget_C_GetEquipItemNameAndTypeByText, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000B8, "Member 'W_WeaponListWidget_C_GetEquipItemNameAndTypeByText::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_WeaponListWidget_C_GetEquipItemNameAndTypeByText, CallFunc_ToUpper_ReturnValue) == 0x0000C0, "Member 'W_WeaponListWidget_C_GetEquipItemNameAndTypeByText::CallFunc_ToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponListWidget_C_GetEquipItemNameAndTypeByText, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000D0, "Member 'W_WeaponListWidget_C_GetEquipItemNameAndTypeByText::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

}

