#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WeaponHud_Throwable

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_WeaponHud_Throwable.W_WeaponHud_Throwable_C
// 0x0030 (0x02F8 - 0x02C8)
class UW_WeaponHud_Throwable_C final : public UP2UtilityHUD_Throwable
{
public:
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Bdr_Status_Bg;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Bracket_L;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Bracket_R;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_X;                                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_WeaponHud_Throwable_C">();
	}
	static class UW_WeaponHud_Throwable_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_WeaponHud_Throwable_C>();
	}
};
static_assert(alignof(UW_WeaponHud_Throwable_C) == 0x000008, "Wrong alignment on UW_WeaponHud_Throwable_C");
static_assert(sizeof(UW_WeaponHud_Throwable_C) == 0x0002F8, "Wrong size on UW_WeaponHud_Throwable_C");
static_assert(offsetof(UW_WeaponHud_Throwable_C, FadeOutAnim) == 0x0002C8, "Member 'UW_WeaponHud_Throwable_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UW_WeaponHud_Throwable_C, FadeInAnim) == 0x0002D0, "Member 'UW_WeaponHud_Throwable_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UW_WeaponHud_Throwable_C, Bdr_Status_Bg) == 0x0002D8, "Member 'UW_WeaponHud_Throwable_C::Bdr_Status_Bg' has a wrong offset!");
static_assert(offsetof(UW_WeaponHud_Throwable_C, Img_Bracket_L) == 0x0002E0, "Member 'UW_WeaponHud_Throwable_C::Img_Bracket_L' has a wrong offset!");
static_assert(offsetof(UW_WeaponHud_Throwable_C, Img_Bracket_R) == 0x0002E8, "Member 'UW_WeaponHud_Throwable_C::Img_Bracket_R' has a wrong offset!");
static_assert(offsetof(UW_WeaponHud_Throwable_C, Txt_X) == 0x0002F0, "Member 'UW_WeaponHud_Throwable_C::Txt_X' has a wrong offset!");

}

