#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WeaponHud_MagWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_WeaponHud_MagWidget.W_WeaponHud_MagWidget_C
// 0x0048 (0x0300 - 0x02B8)
class UW_WeaponHud_MagWidget_C final : public UP2WeaponHUD_Magazine
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_BG;                                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_Outline;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScB_Magazine;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Magazine;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              Size;                                              // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VB_Padding;                                        // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsReversed;                                       // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_WeaponHud_MagWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_WeaponHud_MagWidget_C">();
	}
	static class UW_WeaponHud_MagWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_WeaponHud_MagWidget_C>();
	}
};
static_assert(alignof(UW_WeaponHud_MagWidget_C) == 0x000008, "Wrong alignment on UW_WeaponHud_MagWidget_C");
static_assert(sizeof(UW_WeaponHud_MagWidget_C) == 0x000300, "Wrong size on UW_WeaponHud_MagWidget_C");
static_assert(offsetof(UW_WeaponHud_MagWidget_C, UberGraphFrame) == 0x0002B8, "Member 'UW_WeaponHud_MagWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_WeaponHud_MagWidget_C, Bdr_BG) == 0x0002C0, "Member 'UW_WeaponHud_MagWidget_C::Bdr_BG' has a wrong offset!");
static_assert(offsetof(UW_WeaponHud_MagWidget_C, Bdr_Outline) == 0x0002C8, "Member 'UW_WeaponHud_MagWidget_C::Bdr_Outline' has a wrong offset!");
static_assert(offsetof(UW_WeaponHud_MagWidget_C, ScB_Magazine) == 0x0002D0, "Member 'UW_WeaponHud_MagWidget_C::ScB_Magazine' has a wrong offset!");
static_assert(offsetof(UW_WeaponHud_MagWidget_C, SzB_Magazine) == 0x0002D8, "Member 'UW_WeaponHud_MagWidget_C::SzB_Magazine' has a wrong offset!");
static_assert(offsetof(UW_WeaponHud_MagWidget_C, Size) == 0x0002E0, "Member 'UW_WeaponHud_MagWidget_C::Size' has a wrong offset!");
static_assert(offsetof(UW_WeaponHud_MagWidget_C, VB_Padding) == 0x0002F0, "Member 'UW_WeaponHud_MagWidget_C::VB_Padding' has a wrong offset!");
static_assert(offsetof(UW_WeaponHud_MagWidget_C, bIsReversed) == 0x0002F8, "Member 'UW_WeaponHud_MagWidget_C::bIsReversed' has a wrong offset!");

}

