#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WeaponHud_StatusWidget

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_WeaponHud_StatusWidget.W_WeaponHud_StatusWidget_C
// 0x0018 (0x0338 - 0x0320)
class UW_WeaponHud_StatusWidget_C final : public UP2WeaponHUD_Status
{
public:
	class UBorder*                                Bdr_Status_Bg;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Bracket_L;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Bracket_R;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_WeaponHud_StatusWidget_C">();
	}
	static class UW_WeaponHud_StatusWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_WeaponHud_StatusWidget_C>();
	}
};
static_assert(alignof(UW_WeaponHud_StatusWidget_C) == 0x000008, "Wrong alignment on UW_WeaponHud_StatusWidget_C");
static_assert(sizeof(UW_WeaponHud_StatusWidget_C) == 0x000338, "Wrong size on UW_WeaponHud_StatusWidget_C");
static_assert(offsetof(UW_WeaponHud_StatusWidget_C, Bdr_Status_Bg) == 0x000320, "Member 'UW_WeaponHud_StatusWidget_C::Bdr_Status_Bg' has a wrong offset!");
static_assert(offsetof(UW_WeaponHud_StatusWidget_C, Img_Bracket_L) == 0x000328, "Member 'UW_WeaponHud_StatusWidget_C::Img_Bracket_L' has a wrong offset!");
static_assert(offsetof(UW_WeaponHud_StatusWidget_C, Img_Bracket_R) == 0x000330, "Member 'UW_WeaponHud_StatusWidget_C::Img_Bracket_R' has a wrong offset!");

}

