#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WeaponHud_ProgressBar

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_WeaponHud_ProgressBar.W_WeaponHud_ProgressBar_C.ExecuteUbergraph_W_WeaponHud_ProgressBar
// 0x03D0 (0x03D0 - 0x0000)
struct W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x001C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0014)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0044(0x0014)()
	class UBorderSlot*                            CallFunc_SlotAsBorderSlot_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0060(0x00D0)()
	struct FProgressBarStyle                      K2Node_MakeStruct_ProgressBarStyle;                // 0x0130(0x0290)()
	float                                         K2Node_MakeStruct_Bottom_ImplicitCast;             // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar) == 0x000010, "Wrong alignment on W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar");
static_assert(sizeof(W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar) == 0x0003D0, "Wrong size on W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar");
static_assert(offsetof(W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar, EntryPoint) == 0x000000, "Member 'W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar, Temp_bool_Variable) == 0x000004, "Member 'W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar, K2Node_MakeStruct_Margin) == 0x000008, "Member 'W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar, K2Node_Event_IsDesignTime) == 0x000018, "Member 'W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar, K2Node_MakeStruct_SlateColor) == 0x00001C, "Member 'W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar, K2Node_Select_Default) == 0x000044, "Member 'W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar, CallFunc_SlotAsBorderSlot_ReturnValue) == 0x000058, "Member 'W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar::CallFunc_SlotAsBorderSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar, K2Node_MakeStruct_SlateBrush) == 0x000060, "Member 'W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar, K2Node_MakeStruct_ProgressBarStyle) == 0x000130, "Member 'W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar::K2Node_MakeStruct_ProgressBarStyle' has a wrong offset!");
static_assert(offsetof(W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar, K2Node_MakeStruct_Bottom_ImplicitCast) == 0x0003C0, "Member 'W_WeaponHud_ProgressBar_C_ExecuteUbergraph_W_WeaponHud_ProgressBar::K2Node_MakeStruct_Bottom_ImplicitCast' has a wrong offset!");

// Function W_WeaponHud_ProgressBar.W_WeaponHud_ProgressBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_WeaponHud_ProgressBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_WeaponHud_ProgressBar_C_PreConstruct) == 0x000001, "Wrong alignment on W_WeaponHud_ProgressBar_C_PreConstruct");
static_assert(sizeof(W_WeaponHud_ProgressBar_C_PreConstruct) == 0x000001, "Wrong size on W_WeaponHud_ProgressBar_C_PreConstruct");
static_assert(offsetof(W_WeaponHud_ProgressBar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_WeaponHud_ProgressBar_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

