#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Wishlist_CategoryWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Wishlist_CategoryWidget.W_Wishlist_CategoryWidget_C
// 0x00F8 (0x03C0 - 0x02C8)
class UW_Wishlist_CategoryWidget_C final : public UP2WishListLootContextCategoryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_CategoryInfo;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Selected;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Select;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             CategoryIcon;                                      // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CategoryNameText;                                  // 0x02F0(0x0018)(Edit, BlueprintVisible)
	int32                                         WishlistCountInt;                                  // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x030C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         DefaultFontStyle;                                  // 0x0310(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         SelectFontStyle;                                   // 0x0368(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__W_Wishlist_CategoryWidget_Btn_WishlistCategory_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_Wishlist_CategoryWidget_Btn_WishlistCategory_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void ExecuteUbergraph_W_Wishlist_CategoryWidget(int32 EntryPoint)	 // 0xae1e64;
	void OnRefreshSelectedStateOnBP(bool InSelected, int32 InItemCount)	 // 0xae1e64;
	void OnRefreshSetCategoryInfoOnBP(const class FText& InCategoryNameText, int32 InItemCount)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetCategoryInfo(const class FText& CategoryNameText_0, int32 WishlistCountInt_0)	 // 0xae1e64;
	void SetSelectedState(bool IsSelected_0, int32 WishlistCountInt_0)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Wishlist_CategoryWidget_C">();
	}
	static class UW_Wishlist_CategoryWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Wishlist_CategoryWidget_C>();
	}
};
static_assert(alignof(UW_Wishlist_CategoryWidget_C) == 0x000008, "Wrong alignment on UW_Wishlist_CategoryWidget_C");
static_assert(sizeof(UW_Wishlist_CategoryWidget_C) == 0x0003C0, "Wrong size on UW_Wishlist_CategoryWidget_C");
static_assert(offsetof(UW_Wishlist_CategoryWidget_C, UberGraphFrame) == 0x0002C8, "Member 'UW_Wishlist_CategoryWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Wishlist_CategoryWidget_C, Bdr_CategoryInfo) == 0x0002D0, "Member 'UW_Wishlist_CategoryWidget_C::Bdr_CategoryInfo' has a wrong offset!");
static_assert(offsetof(UW_Wishlist_CategoryWidget_C, Img_Selected) == 0x0002D8, "Member 'UW_Wishlist_CategoryWidget_C::Img_Selected' has a wrong offset!");
static_assert(offsetof(UW_Wishlist_CategoryWidget_C, Txt_Select) == 0x0002E0, "Member 'UW_Wishlist_CategoryWidget_C::Txt_Select' has a wrong offset!");
static_assert(offsetof(UW_Wishlist_CategoryWidget_C, CategoryIcon) == 0x0002E8, "Member 'UW_Wishlist_CategoryWidget_C::CategoryIcon' has a wrong offset!");
static_assert(offsetof(UW_Wishlist_CategoryWidget_C, CategoryNameText) == 0x0002F0, "Member 'UW_Wishlist_CategoryWidget_C::CategoryNameText' has a wrong offset!");
static_assert(offsetof(UW_Wishlist_CategoryWidget_C, WishlistCountInt) == 0x000308, "Member 'UW_Wishlist_CategoryWidget_C::WishlistCountInt' has a wrong offset!");
static_assert(offsetof(UW_Wishlist_CategoryWidget_C, IsSelected) == 0x00030C, "Member 'UW_Wishlist_CategoryWidget_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UW_Wishlist_CategoryWidget_C, DefaultFontStyle) == 0x000310, "Member 'UW_Wishlist_CategoryWidget_C::DefaultFontStyle' has a wrong offset!");
static_assert(offsetof(UW_Wishlist_CategoryWidget_C, SelectFontStyle) == 0x000368, "Member 'UW_Wishlist_CategoryWidget_C::SelectFontStyle' has a wrong offset!");

}

