#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Wishlist_CategoryWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Wishlist_CategoryWidget.W_Wishlist_CategoryWidget_C.ExecuteUbergraph_W_Wishlist_CategoryWidget
// 0x0058 (0x0058 - 0x0000)
struct W_Wishlist_CategoryWidget_C_ExecuteUbergraph_W_Wishlist_CategoryWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InSelected;                           // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InItemCount_1;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InCategoryNameText;                   // 0x0038(0x0018)(ConstParm)
	int32                                         K2Node_Event_InItemCount;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Wishlist_CategoryWidget_C_ExecuteUbergraph_W_Wishlist_CategoryWidget) == 0x000008, "Wrong alignment on W_Wishlist_CategoryWidget_C_ExecuteUbergraph_W_Wishlist_CategoryWidget");
static_assert(sizeof(W_Wishlist_CategoryWidget_C_ExecuteUbergraph_W_Wishlist_CategoryWidget) == 0x000058, "Wrong size on W_Wishlist_CategoryWidget_C_ExecuteUbergraph_W_Wishlist_CategoryWidget");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_ExecuteUbergraph_W_Wishlist_CategoryWidget, EntryPoint) == 0x000000, "Member 'W_Wishlist_CategoryWidget_C_ExecuteUbergraph_W_Wishlist_CategoryWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_ExecuteUbergraph_W_Wishlist_CategoryWidget, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_Wishlist_CategoryWidget_C_ExecuteUbergraph_W_Wishlist_CategoryWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_ExecuteUbergraph_W_Wishlist_CategoryWidget, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_Wishlist_CategoryWidget_C_ExecuteUbergraph_W_Wishlist_CategoryWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_ExecuteUbergraph_W_Wishlist_CategoryWidget, K2Node_Event_IsDesignTime) == 0x00002C, "Member 'W_Wishlist_CategoryWidget_C_ExecuteUbergraph_W_Wishlist_CategoryWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_ExecuteUbergraph_W_Wishlist_CategoryWidget, K2Node_Event_InSelected) == 0x00002D, "Member 'W_Wishlist_CategoryWidget_C_ExecuteUbergraph_W_Wishlist_CategoryWidget::K2Node_Event_InSelected' has a wrong offset!");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_ExecuteUbergraph_W_Wishlist_CategoryWidget, K2Node_Event_InItemCount_1) == 0x000030, "Member 'W_Wishlist_CategoryWidget_C_ExecuteUbergraph_W_Wishlist_CategoryWidget::K2Node_Event_InItemCount_1' has a wrong offset!");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_ExecuteUbergraph_W_Wishlist_CategoryWidget, K2Node_Event_InCategoryNameText) == 0x000038, "Member 'W_Wishlist_CategoryWidget_C_ExecuteUbergraph_W_Wishlist_CategoryWidget::K2Node_Event_InCategoryNameText' has a wrong offset!");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_ExecuteUbergraph_W_Wishlist_CategoryWidget, K2Node_Event_InItemCount) == 0x000050, "Member 'W_Wishlist_CategoryWidget_C_ExecuteUbergraph_W_Wishlist_CategoryWidget::K2Node_Event_InItemCount' has a wrong offset!");

// Function W_Wishlist_CategoryWidget.W_Wishlist_CategoryWidget_C.OnRefreshSelectedStateOnBP
// 0x0008 (0x0008 - 0x0000)
struct W_Wishlist_CategoryWidget_C_OnRefreshSelectedStateOnBP final
{
public:
	bool                                          InSelected;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InItemCount;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Wishlist_CategoryWidget_C_OnRefreshSelectedStateOnBP) == 0x000004, "Wrong alignment on W_Wishlist_CategoryWidget_C_OnRefreshSelectedStateOnBP");
static_assert(sizeof(W_Wishlist_CategoryWidget_C_OnRefreshSelectedStateOnBP) == 0x000008, "Wrong size on W_Wishlist_CategoryWidget_C_OnRefreshSelectedStateOnBP");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_OnRefreshSelectedStateOnBP, InSelected) == 0x000000, "Member 'W_Wishlist_CategoryWidget_C_OnRefreshSelectedStateOnBP::InSelected' has a wrong offset!");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_OnRefreshSelectedStateOnBP, InItemCount) == 0x000004, "Member 'W_Wishlist_CategoryWidget_C_OnRefreshSelectedStateOnBP::InItemCount' has a wrong offset!");

// Function W_Wishlist_CategoryWidget.W_Wishlist_CategoryWidget_C.OnRefreshSetCategoryInfoOnBP
// 0x0020 (0x0020 - 0x0000)
struct W_Wishlist_CategoryWidget_C_OnRefreshSetCategoryInfoOnBP final
{
public:
	class FText                                   InCategoryNameText;                                // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         InItemCount;                                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Wishlist_CategoryWidget_C_OnRefreshSetCategoryInfoOnBP) == 0x000008, "Wrong alignment on W_Wishlist_CategoryWidget_C_OnRefreshSetCategoryInfoOnBP");
static_assert(sizeof(W_Wishlist_CategoryWidget_C_OnRefreshSetCategoryInfoOnBP) == 0x000020, "Wrong size on W_Wishlist_CategoryWidget_C_OnRefreshSetCategoryInfoOnBP");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_OnRefreshSetCategoryInfoOnBP, InCategoryNameText) == 0x000000, "Member 'W_Wishlist_CategoryWidget_C_OnRefreshSetCategoryInfoOnBP::InCategoryNameText' has a wrong offset!");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_OnRefreshSetCategoryInfoOnBP, InItemCount) == 0x000018, "Member 'W_Wishlist_CategoryWidget_C_OnRefreshSetCategoryInfoOnBP::InItemCount' has a wrong offset!");

// Function W_Wishlist_CategoryWidget.W_Wishlist_CategoryWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Wishlist_CategoryWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Wishlist_CategoryWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Wishlist_CategoryWidget_C_PreConstruct");
static_assert(sizeof(W_Wishlist_CategoryWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Wishlist_CategoryWidget_C_PreConstruct");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Wishlist_CategoryWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Wishlist_CategoryWidget.W_Wishlist_CategoryWidget_C.SetCategoryInfo
// 0x00B0 (0x00B0 - 0x0000)
struct W_Wishlist_CategoryWidget_C_SetCategoryInfo final
{
public:
	class FText                                   CategoryNameText_0;                                // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         WishlistCountInt_0;                                // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
};
static_assert(alignof(W_Wishlist_CategoryWidget_C_SetCategoryInfo) == 0x000008, "Wrong alignment on W_Wishlist_CategoryWidget_C_SetCategoryInfo");
static_assert(sizeof(W_Wishlist_CategoryWidget_C_SetCategoryInfo) == 0x0000B0, "Wrong size on W_Wishlist_CategoryWidget_C_SetCategoryInfo");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_SetCategoryInfo, CategoryNameText_0) == 0x000000, "Member 'W_Wishlist_CategoryWidget_C_SetCategoryInfo::CategoryNameText_0' has a wrong offset!");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_SetCategoryInfo, WishlistCountInt_0) == 0x000018, "Member 'W_Wishlist_CategoryWidget_C_SetCategoryInfo::WishlistCountInt_0' has a wrong offset!");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_SetCategoryInfo, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'W_Wishlist_CategoryWidget_C_SetCategoryInfo::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_SetCategoryInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'W_Wishlist_CategoryWidget_C_SetCategoryInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_SetCategoryInfo, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'W_Wishlist_CategoryWidget_C_SetCategoryInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_SetCategoryInfo, K2Node_MakeArray_Array) == 0x000088, "Member 'W_Wishlist_CategoryWidget_C_SetCategoryInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_SetCategoryInfo, CallFunc_Format_ReturnValue) == 0x000098, "Member 'W_Wishlist_CategoryWidget_C_SetCategoryInfo::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function W_Wishlist_CategoryWidget.W_Wishlist_CategoryWidget_C.SetSelectedState
// 0x0058 (0x0058 - 0x0000)
struct W_Wishlist_CategoryWidget_C_SetSelectedState final
{
public:
	bool                                          IsSelected_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WishlistCountInt_0;                                // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x001C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0030(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0044(0x0014)()
};
static_assert(alignof(W_Wishlist_CategoryWidget_C_SetSelectedState) == 0x000004, "Wrong alignment on W_Wishlist_CategoryWidget_C_SetSelectedState");
static_assert(sizeof(W_Wishlist_CategoryWidget_C_SetSelectedState) == 0x000058, "Wrong size on W_Wishlist_CategoryWidget_C_SetSelectedState");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_SetSelectedState, IsSelected_0) == 0x000000, "Member 'W_Wishlist_CategoryWidget_C_SetSelectedState::IsSelected_0' has a wrong offset!");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_SetSelectedState, WishlistCountInt_0) == 0x000004, "Member 'W_Wishlist_CategoryWidget_C_SetSelectedState::WishlistCountInt_0' has a wrong offset!");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_SetSelectedState, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'W_Wishlist_CategoryWidget_C_SetSelectedState::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_SetSelectedState, K2Node_MakeStruct_SlateColor_1) == 0x00001C, "Member 'W_Wishlist_CategoryWidget_C_SetSelectedState::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_SetSelectedState, K2Node_MakeStruct_SlateColor_2) == 0x000030, "Member 'W_Wishlist_CategoryWidget_C_SetSelectedState::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_Wishlist_CategoryWidget_C_SetSelectedState, K2Node_MakeStruct_SlateColor_3) == 0x000044, "Member 'W_Wishlist_CategoryWidget_C_SetSelectedState::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");

}

