#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WorldMap_MapMarkerRadialSub

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_WorldMap_MapMarkerRadialSub.W_WorldMap_MapMarkerRadialSub_C.ExecuteUbergraph_W_WorldMap_MapMarkerRadialSub
// 0x0030 (0x0030 - 0x0000)
struct W_WorldMap_MapMarkerRadialSub_C_ExecuteUbergraph_W_WorldMap_MapMarkerRadialSub final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InAngle;                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsActive;                          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderTransformAngle_Angle_ImplicitCast; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_WorldMap_MapMarkerRadialSub_C_ExecuteUbergraph_W_WorldMap_MapMarkerRadialSub) == 0x000008, "Wrong alignment on W_WorldMap_MapMarkerRadialSub_C_ExecuteUbergraph_W_WorldMap_MapMarkerRadialSub");
static_assert(sizeof(W_WorldMap_MapMarkerRadialSub_C_ExecuteUbergraph_W_WorldMap_MapMarkerRadialSub) == 0x000030, "Wrong size on W_WorldMap_MapMarkerRadialSub_C_ExecuteUbergraph_W_WorldMap_MapMarkerRadialSub");
static_assert(offsetof(W_WorldMap_MapMarkerRadialSub_C_ExecuteUbergraph_W_WorldMap_MapMarkerRadialSub, EntryPoint) == 0x000000, "Member 'W_WorldMap_MapMarkerRadialSub_C_ExecuteUbergraph_W_WorldMap_MapMarkerRadialSub::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_WorldMap_MapMarkerRadialSub_C_ExecuteUbergraph_W_WorldMap_MapMarkerRadialSub, K2Node_Event_InAngle) == 0x000004, "Member 'W_WorldMap_MapMarkerRadialSub_C_ExecuteUbergraph_W_WorldMap_MapMarkerRadialSub::K2Node_Event_InAngle' has a wrong offset!");
static_assert(offsetof(W_WorldMap_MapMarkerRadialSub_C_ExecuteUbergraph_W_WorldMap_MapMarkerRadialSub, K2Node_Event_bInIsActive) == 0x000008, "Member 'W_WorldMap_MapMarkerRadialSub_C_ExecuteUbergraph_W_WorldMap_MapMarkerRadialSub::K2Node_Event_bInIsActive' has a wrong offset!");
static_assert(offsetof(W_WorldMap_MapMarkerRadialSub_C_ExecuteUbergraph_W_WorldMap_MapMarkerRadialSub, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'W_WorldMap_MapMarkerRadialSub_C_ExecuteUbergraph_W_WorldMap_MapMarkerRadialSub::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_WorldMap_MapMarkerRadialSub_C_ExecuteUbergraph_W_WorldMap_MapMarkerRadialSub, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'W_WorldMap_MapMarkerRadialSub_C_ExecuteUbergraph_W_WorldMap_MapMarkerRadialSub::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_WorldMap_MapMarkerRadialSub_C_ExecuteUbergraph_W_WorldMap_MapMarkerRadialSub, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000020, "Member 'W_WorldMap_MapMarkerRadialSub_C_ExecuteUbergraph_W_WorldMap_MapMarkerRadialSub::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_WorldMap_MapMarkerRadialSub_C_ExecuteUbergraph_W_WorldMap_MapMarkerRadialSub, CallFunc_SetRenderTransformAngle_Angle_ImplicitCast) == 0x000028, "Member 'W_WorldMap_MapMarkerRadialSub_C_ExecuteUbergraph_W_WorldMap_MapMarkerRadialSub::CallFunc_SetRenderTransformAngle_Angle_ImplicitCast' has a wrong offset!");

// Function W_WorldMap_MapMarkerRadialSub.W_WorldMap_MapMarkerRadialSub_C.OnAngleChanged
// 0x0004 (0x0004 - 0x0000)
struct W_WorldMap_MapMarkerRadialSub_C_OnAngleChanged final
{
public:
	float                                         InAngle;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_WorldMap_MapMarkerRadialSub_C_OnAngleChanged) == 0x000004, "Wrong alignment on W_WorldMap_MapMarkerRadialSub_C_OnAngleChanged");
static_assert(sizeof(W_WorldMap_MapMarkerRadialSub_C_OnAngleChanged) == 0x000004, "Wrong size on W_WorldMap_MapMarkerRadialSub_C_OnAngleChanged");
static_assert(offsetof(W_WorldMap_MapMarkerRadialSub_C_OnAngleChanged, InAngle) == 0x000000, "Member 'W_WorldMap_MapMarkerRadialSub_C_OnAngleChanged::InAngle' has a wrong offset!");

// Function W_WorldMap_MapMarkerRadialSub.W_WorldMap_MapMarkerRadialSub_C.OnIsActiveChanged
// 0x0001 (0x0001 - 0x0000)
struct W_WorldMap_MapMarkerRadialSub_C_OnIsActiveChanged final
{
public:
	bool                                          bInIsActive;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_WorldMap_MapMarkerRadialSub_C_OnIsActiveChanged) == 0x000001, "Wrong alignment on W_WorldMap_MapMarkerRadialSub_C_OnIsActiveChanged");
static_assert(sizeof(W_WorldMap_MapMarkerRadialSub_C_OnIsActiveChanged) == 0x000001, "Wrong size on W_WorldMap_MapMarkerRadialSub_C_OnIsActiveChanged");
static_assert(offsetof(W_WorldMap_MapMarkerRadialSub_C_OnIsActiveChanged, bInIsActive) == 0x000000, "Member 'W_WorldMap_MapMarkerRadialSub_C_OnIsActiveChanged::bInIsActive' has a wrong offset!");

}

