#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WorldMap_MapMarkerRadialSub

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_WorldMap_MapMarkerRadialSub.W_WorldMap_MapMarkerRadialSub_C
// 0x0040 (0x02E8 - 0x02A8)
class UW_WorldMap_MapMarkerRadialSub_C final : public UP2MapMarkerRadialSubWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Icon;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_RadialNormal;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_RadialSelected;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ovr_GroupIndicatorRoot;                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_RadialOption;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_RadialState;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WS_RadialState;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_WorldMap_MapMarkerRadialSub(int32 EntryPoint)	 // 0xae1e64;
	void OnAngleChanged(float InAngle)	 // 0xae1e64;
	void OnIsActiveChanged(bool bInIsActive)	 // 0xae1e64;
	void UpdateWidgetDesign()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_WorldMap_MapMarkerRadialSub_C">();
	}
	static class UW_WorldMap_MapMarkerRadialSub_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_WorldMap_MapMarkerRadialSub_C>();
	}
};
static_assert(alignof(UW_WorldMap_MapMarkerRadialSub_C) == 0x000008, "Wrong alignment on UW_WorldMap_MapMarkerRadialSub_C");
static_assert(sizeof(UW_WorldMap_MapMarkerRadialSub_C) == 0x0002E8, "Wrong size on UW_WorldMap_MapMarkerRadialSub_C");
static_assert(offsetof(UW_WorldMap_MapMarkerRadialSub_C, UberGraphFrame) == 0x0002A8, "Member 'UW_WorldMap_MapMarkerRadialSub_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_WorldMap_MapMarkerRadialSub_C, Img_Icon) == 0x0002B0, "Member 'UW_WorldMap_MapMarkerRadialSub_C::Img_Icon' has a wrong offset!");
static_assert(offsetof(UW_WorldMap_MapMarkerRadialSub_C, Img_RadialNormal) == 0x0002B8, "Member 'UW_WorldMap_MapMarkerRadialSub_C::Img_RadialNormal' has a wrong offset!");
static_assert(offsetof(UW_WorldMap_MapMarkerRadialSub_C, Img_RadialSelected) == 0x0002C0, "Member 'UW_WorldMap_MapMarkerRadialSub_C::Img_RadialSelected' has a wrong offset!");
static_assert(offsetof(UW_WorldMap_MapMarkerRadialSub_C, Ovr_GroupIndicatorRoot) == 0x0002C8, "Member 'UW_WorldMap_MapMarkerRadialSub_C::Ovr_GroupIndicatorRoot' has a wrong offset!");
static_assert(offsetof(UW_WorldMap_MapMarkerRadialSub_C, SzB_RadialOption) == 0x0002D0, "Member 'UW_WorldMap_MapMarkerRadialSub_C::SzB_RadialOption' has a wrong offset!");
static_assert(offsetof(UW_WorldMap_MapMarkerRadialSub_C, SzB_RadialState) == 0x0002D8, "Member 'UW_WorldMap_MapMarkerRadialSub_C::SzB_RadialState' has a wrong offset!");
static_assert(offsetof(UW_WorldMap_MapMarkerRadialSub_C, WS_RadialState) == 0x0002E0, "Member 'UW_WorldMap_MapMarkerRadialSub_C::WS_RadialState' has a wrong offset!");

}

