#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WorldMapContractList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_WorldMapContractList.W_WorldMapContractList_C
// 0x00A0 (0x0340 - 0x02A0)
class UW_WorldMapContractList_C final : public UP2WorldMapContractListWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_24;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_LockedIcon;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_NotiDot;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget;                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget_1;                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget_2;                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget_3;                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget_4;                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget_5;                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget_6;                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget_7;                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget_8;                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget_9;                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget_10;                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget_11;                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget_12;                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget_13;                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget_14;                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ShowHeadline;                                      // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_WorldMapContractList(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_WorldMapContractList_C">();
	}
	static class UW_WorldMapContractList_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_WorldMapContractList_C>();
	}
};
static_assert(alignof(UW_WorldMapContractList_C) == 0x000008, "Wrong alignment on UW_WorldMapContractList_C");
static_assert(sizeof(UW_WorldMapContractList_C) == 0x000340, "Wrong size on UW_WorldMapContractList_C");
static_assert(offsetof(UW_WorldMapContractList_C, UberGraphFrame) == 0x0002A0, "Member 'UW_WorldMapContractList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_WorldMapContractList_C, Image_24) == 0x0002A8, "Member 'UW_WorldMapContractList_C::Image_24' has a wrong offset!");
static_assert(offsetof(UW_WorldMapContractList_C, Img_LockedIcon) == 0x0002B0, "Member 'UW_WorldMapContractList_C::Img_LockedIcon' has a wrong offset!");
static_assert(offsetof(UW_WorldMapContractList_C, Img_NotiDot) == 0x0002B8, "Member 'UW_WorldMapContractList_C::Img_NotiDot' has a wrong offset!");
static_assert(offsetof(UW_WorldMapContractList_C, W_Plsd_Contract_ItemWidget) == 0x0002C0, "Member 'UW_WorldMapContractList_C::W_Plsd_Contract_ItemWidget' has a wrong offset!");
static_assert(offsetof(UW_WorldMapContractList_C, W_Plsd_Contract_ItemWidget_1) == 0x0002C8, "Member 'UW_WorldMapContractList_C::W_Plsd_Contract_ItemWidget_1' has a wrong offset!");
static_assert(offsetof(UW_WorldMapContractList_C, W_Plsd_Contract_ItemWidget_2) == 0x0002D0, "Member 'UW_WorldMapContractList_C::W_Plsd_Contract_ItemWidget_2' has a wrong offset!");
static_assert(offsetof(UW_WorldMapContractList_C, W_Plsd_Contract_ItemWidget_3) == 0x0002D8, "Member 'UW_WorldMapContractList_C::W_Plsd_Contract_ItemWidget_3' has a wrong offset!");
static_assert(offsetof(UW_WorldMapContractList_C, W_Plsd_Contract_ItemWidget_4) == 0x0002E0, "Member 'UW_WorldMapContractList_C::W_Plsd_Contract_ItemWidget_4' has a wrong offset!");
static_assert(offsetof(UW_WorldMapContractList_C, W_Plsd_Contract_ItemWidget_5) == 0x0002E8, "Member 'UW_WorldMapContractList_C::W_Plsd_Contract_ItemWidget_5' has a wrong offset!");
static_assert(offsetof(UW_WorldMapContractList_C, W_Plsd_Contract_ItemWidget_6) == 0x0002F0, "Member 'UW_WorldMapContractList_C::W_Plsd_Contract_ItemWidget_6' has a wrong offset!");
static_assert(offsetof(UW_WorldMapContractList_C, W_Plsd_Contract_ItemWidget_7) == 0x0002F8, "Member 'UW_WorldMapContractList_C::W_Plsd_Contract_ItemWidget_7' has a wrong offset!");
static_assert(offsetof(UW_WorldMapContractList_C, W_Plsd_Contract_ItemWidget_8) == 0x000300, "Member 'UW_WorldMapContractList_C::W_Plsd_Contract_ItemWidget_8' has a wrong offset!");
static_assert(offsetof(UW_WorldMapContractList_C, W_Plsd_Contract_ItemWidget_9) == 0x000308, "Member 'UW_WorldMapContractList_C::W_Plsd_Contract_ItemWidget_9' has a wrong offset!");
static_assert(offsetof(UW_WorldMapContractList_C, W_Plsd_Contract_ItemWidget_10) == 0x000310, "Member 'UW_WorldMapContractList_C::W_Plsd_Contract_ItemWidget_10' has a wrong offset!");
static_assert(offsetof(UW_WorldMapContractList_C, W_Plsd_Contract_ItemWidget_11) == 0x000318, "Member 'UW_WorldMapContractList_C::W_Plsd_Contract_ItemWidget_11' has a wrong offset!");
static_assert(offsetof(UW_WorldMapContractList_C, W_Plsd_Contract_ItemWidget_12) == 0x000320, "Member 'UW_WorldMapContractList_C::W_Plsd_Contract_ItemWidget_12' has a wrong offset!");
static_assert(offsetof(UW_WorldMapContractList_C, W_Plsd_Contract_ItemWidget_13) == 0x000328, "Member 'UW_WorldMapContractList_C::W_Plsd_Contract_ItemWidget_13' has a wrong offset!");
static_assert(offsetof(UW_WorldMapContractList_C, W_Plsd_Contract_ItemWidget_14) == 0x000330, "Member 'UW_WorldMapContractList_C::W_Plsd_Contract_ItemWidget_14' has a wrong offset!");
static_assert(offsetof(UW_WorldMapContractList_C, ShowHeadline) == 0x000338, "Member 'UW_WorldMapContractList_C::ShowHeadline' has a wrong offset!");

}

