#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WorldMap3D

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_WorldMap3D.W_WorldMap3D_C
// 0x0050 (0x0808 - 0x07B8)
class UW_WorldMap3D_C final : public UP2WorldMap3DWidget
{
public:
	class UImage*                                 Img_Vignette;                                      // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UP2MapMarkerComponent*                  DefaultMarkerClass;                                // 0x07C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          HasStoredLocation;                                 // 0x07C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C9[0x7];                                      // 0x07C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CurrentMapLocationPanDebug;                        // 0x07D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PreviousMapLocationPanDebug;                       // 0x07E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnter;                                           // 0x0800(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddMarker()	 // 0xae1e64;
	void DebugPrints()	 // 0xae1e64;
	void SetMatchCountdownState(EP2MatchCountdownState IntMatchCountdownState)	 // 0xae1e64;

	struct FVector2D GetRatio() const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_WorldMap3D_C">();
	}
	static class UW_WorldMap3D_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_WorldMap3D_C>();
	}
};
static_assert(alignof(UW_WorldMap3D_C) == 0x000008, "Wrong alignment on UW_WorldMap3D_C");
static_assert(sizeof(UW_WorldMap3D_C) == 0x000808, "Wrong size on UW_WorldMap3D_C");
static_assert(offsetof(UW_WorldMap3D_C, Img_Vignette) == 0x0007B8, "Member 'UW_WorldMap3D_C::Img_Vignette' has a wrong offset!");
static_assert(offsetof(UW_WorldMap3D_C, DefaultMarkerClass) == 0x0007C0, "Member 'UW_WorldMap3D_C::DefaultMarkerClass' has a wrong offset!");
static_assert(offsetof(UW_WorldMap3D_C, HasStoredLocation) == 0x0007C8, "Member 'UW_WorldMap3D_C::HasStoredLocation' has a wrong offset!");
static_assert(offsetof(UW_WorldMap3D_C, CurrentMapLocationPanDebug) == 0x0007D0, "Member 'UW_WorldMap3D_C::CurrentMapLocationPanDebug' has a wrong offset!");
static_assert(offsetof(UW_WorldMap3D_C, PreviousMapLocationPanDebug) == 0x0007E8, "Member 'UW_WorldMap3D_C::PreviousMapLocationPanDebug' has a wrong offset!");
static_assert(offsetof(UW_WorldMap3D_C, IsEnter) == 0x000800, "Member 'UW_WorldMap3D_C::IsEnter' has a wrong offset!");

}

