#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WebSocketNetworking

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class WebSocketNetworking.WebSocketConnection
// 0x0010 (0x1DE0 - 0x1DD0)
class UWebSocketConnection final : public UNetConnection
{
public:
	uint8                                         Pad_1DD0[0x10];                                    // 0x1DD0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"WebSocketConnection">();
	}
	static class UWebSocketConnection* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UWebSocketConnection>();
	}
};
static_assert(alignof(UWebSocketConnection) == 0x000008, "Wrong alignment on UWebSocketConnection");
static_assert(sizeof(UWebSocketConnection) == 0x001DE0, "Wrong size on UWebSocketConnection");

// Class WebSocketNetworking.WebSocketNetDriver
// 0x0010 (0x07B8 - 0x07A8)
class UWebSocketNetDriver final : public UNetDriver
{
public:
	int32                                         WebSocketPort;                                     // 0x07A8(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7AC[0xC];                                      // 0x07AC(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"WebSocketNetDriver">();
	}
	static class UWebSocketNetDriver* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UWebSocketNetDriver>();
	}
};
static_assert(alignof(UWebSocketNetDriver) == 0x000008, "Wrong alignment on UWebSocketNetDriver");
static_assert(sizeof(UWebSocketNetDriver) == 0x0007B8, "Wrong size on UWebSocketNetDriver");
static_assert(offsetof(UWebSocketNetDriver, WebSocketPort) == 0x0007A8, "Member 'UWebSocketNetDriver::WebSocketPort' has a wrong offset!");

}

