#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WwiseResourceLoader

#include "Basic.hpp"

#include "WwiseResourceLoader_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class WwiseResourceLoader.WwiseEventInfoLibrary
// 0x0000 (0x0028 - 0x0028)
class UWwiseEventInfoLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void BreakStruct(const struct FWwiseEventInfo& Ref, struct FGuid* OutWwiseGuid, int32* OutWwiseShortId, class FString* OutWwiseName, EWwiseEventSwitchContainerLoading* OutSwitchContainerLoading, EWwiseEventDestroyOptions* OutDestroyOptions, int32* OutHardCodedSoundBankShortId)	 // 0x43d8fc8;
	static EWwiseEventDestroyOptions GetDestroyOptions(const struct FWwiseEventInfo& Ref)	 // 0x43d99f8;
	static int32 GetHardCodedSoundBankShortId(const struct FWwiseEventInfo& Ref)	 // 0x43d9b18;
	static EWwiseEventSwitchContainerLoading GetSwitchContainerLoading(const struct FWwiseEventInfo& Ref)	 // 0x43d9c3c;
	static struct FGuid GetWwiseGuid(const struct FWwiseEventInfo& Ref)	 // 0x43d9ccc;
	static class FString GetWwiseName(const struct FWwiseEventInfo& Ref)	 // 0x43d9df0;
	static int32 GetWwiseShortID(const struct FWwiseEventInfo& Ref)	 // 0x43da00c;
	static struct FWwiseEventInfo MakeStruct(const struct FGuid& WwiseGuid, int32 WwiseShortId, const class FString& WwiseName, EWwiseEventSwitchContainerLoading SwitchContainerLoading, EWwiseEventDestroyOptions DestroyOptions, int32 HardCodedSoundBankShortId)	 // 0x43da1c0;
	static struct FWwiseEventInfo SetDestroyOptions(const struct FWwiseEventInfo& Ref, const EWwiseEventDestroyOptions& DestroyOptions)	 // 0x43daf40;
	static struct FWwiseEventInfo SetHardCodedSoundBankShortId(const struct FWwiseEventInfo& Ref, int32 HardCodedSoundBankShortId)	 // 0x43db1ec;
	static struct FWwiseEventInfo SetSwitchContainerLoading(const struct FWwiseEventInfo& Ref, const EWwiseEventSwitchContainerLoading& SwitchContainerLoading)	 // 0x43db530;
	static struct FWwiseEventInfo SetWwiseGuid(const struct FWwiseEventInfo& Ref, const struct FGuid& WwiseGuid)	 // 0x43db638;
	static struct FWwiseEventInfo SetWwiseName(const struct FWwiseEventInfo& Ref, const class FString& WwiseName)	 // 0x43db85c;
	static struct FWwiseEventInfo SetWwiseShortId(const struct FWwiseEventInfo& Ref, int32 WwiseShortId)	 // 0x43dbe50;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"WwiseEventInfoLibrary">();
	}
	static class UWwiseEventInfoLibrary* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UWwiseEventInfoLibrary>();
	}
};
static_assert(alignof(UWwiseEventInfoLibrary) == 0x000008, "Wrong alignment on UWwiseEventInfoLibrary");
static_assert(sizeof(UWwiseEventInfoLibrary) == 0x000028, "Wrong size on UWwiseEventInfoLibrary");

// Class WwiseResourceLoader.WwiseGroupValueInfoLibrary
// 0x0000 (0x0028 - 0x0028)
class UWwiseGroupValueInfoLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void BreakStruct(const struct FWwiseGroupValueInfo& Ref, struct FGuid* OutAssetGuid, int32* OutGroupShortId, int32* OutWwiseShortId, class FString* OutWwiseName)	 // 0x43d9360;
	static struct FGuid GetAssetGuid(const struct FWwiseGroupValueInfo& Ref)	 // 0x43d9968;
	static int32 GetGroupShortId(const struct FWwiseGroupValueInfo& Ref)	 // 0x43d9a88;
	static class FString GetWwiseName(const struct FWwiseGroupValueInfo& Ref)	 // 0x43d9e9c;
	static int32 GetWwiseShortID(const struct FWwiseGroupValueInfo& Ref)	 // 0x43da09c;
	static struct FWwiseGroupValueInfo MakeStruct(const struct FGuid& AssetGuid, int32 GroupShortId, int32 WwiseShortId, const class FString& WwiseName)	 // 0x43da70c;
	static struct FWwiseGroupValueInfo SetAssetGuid(const struct FWwiseGroupValueInfo& Ref, const struct FGuid& AssetGuid)	 // 0x43dae24;
	static struct FWwiseGroupValueInfo SetGroupShortId(const struct FWwiseGroupValueInfo& Ref, int32 GroupShortId)	 // 0x43db048;
	static struct FWwiseGroupValueInfo SetWwiseName(const struct FWwiseGroupValueInfo& Ref, const class FString& WwiseName)	 // 0x43dba54;
	static struct FWwiseGroupValueInfo SetWwiseShortId(const struct FWwiseGroupValueInfo& Ref, int32 WwiseShortId)	 // 0x43dbff0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"WwiseGroupValueInfoLibrary">();
	}
	static class UWwiseGroupValueInfoLibrary* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UWwiseGroupValueInfoLibrary>();
	}
};
static_assert(alignof(UWwiseGroupValueInfoLibrary) == 0x000008, "Wrong alignment on UWwiseGroupValueInfoLibrary");
static_assert(sizeof(UWwiseGroupValueInfoLibrary) == 0x000028, "Wrong size on UWwiseGroupValueInfoLibrary");

// Class WwiseResourceLoader.WwiseObjectInfoLibrary
// 0x0000 (0x0028 - 0x0028)
class UWwiseObjectInfoLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void BreakStruct(const struct FWwiseObjectInfo& Ref, struct FGuid* OutWwiseGuid, int32* OutWwiseShortId, class FString* OutWwiseName, int32* OutHardCodedSoundBankShortId)	 // 0x43d9660;
	static int32 GetHardCodedSoundBankShortId(const struct FWwiseObjectInfo& Ref)	 // 0x43d9ba8;
	static struct FGuid GetWwiseGuid(const struct FWwiseObjectInfo& Ref)	 // 0x43d9d5c;
	static class FString GetWwiseName(const struct FWwiseObjectInfo& Ref)	 // 0x43d9f48;
	static int32 GetWwiseShortID(const struct FWwiseObjectInfo& Ref)	 // 0x43da12c;
	static struct FWwiseObjectInfo MakeStruct(const struct FGuid& WwiseGuid, int32 WwiseShortId, const class FString& WwiseName, int32 HardCodedSoundBankShortId)	 // 0x43daa9c;
	static struct FWwiseObjectInfo SetHardCodedSoundBankShortId(const struct FWwiseObjectInfo& Ref, int32 HardCodedSoundBankShortId)	 // 0x43db38c;
	static struct FWwiseObjectInfo SetWwiseGuid(const struct FWwiseObjectInfo& Ref, const struct FGuid& WwiseGuid)	 // 0x43db748;
	static struct FWwiseObjectInfo SetWwiseName(const struct FWwiseObjectInfo& Ref, const class FString& WwiseName)	 // 0x43dbc54;
	static struct FWwiseObjectInfo SetWwiseShortId(const struct FWwiseObjectInfo& Ref, int32 WwiseShortId)	 // 0x43dc194;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"WwiseObjectInfoLibrary">();
	}
	static class UWwiseObjectInfoLibrary* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UWwiseObjectInfoLibrary>();
	}
};
static_assert(alignof(UWwiseObjectInfoLibrary) == 0x000008, "Wrong alignment on UWwiseObjectInfoLibrary");
static_assert(sizeof(UWwiseObjectInfoLibrary) == 0x000028, "Wrong size on UWwiseObjectInfoLibrary");

}

